<div class="main-sc post article">
    <h2 class="descr">Элитная вторичная недвижимость</h2>

    <div class="article-text">
        <p>Агентство «М16-Недвижимость» предлагает вам лучшие квартиры в центре СПб и других
            районах города на «вторичке»! Популярные варианты и квартиры в закрытой продаже,
            лучшие локации, комфортабельные планировки и самые эффектные виды из окна – мы
            подберем для вас идеальное решение!</p>

        <p>Вторичный рынок элитной недвижимости насчитывает множество вариантов, но далеко
            не каждая из предложенных квартир может соответствовать высокому классу. Мы
            тщательно следим за тем, чтобы в активе агентства были представлены по-настоящему
            эксклюзивные предложения премиум-класса.</p>
        <p>В СПб места, где реализовано высококлассное жилье, не ограничиваются центром! Это и
            районы у Финского залива, и исторические части города, и локации по соседству с
            дворцово-парковыми ансамблями Петербурга. Жить здесь – роскошь, привилегия особ
            высокого происхождения, культурной и интеллектуальной элиты города.</p>
        <p>Элитные квартиры от «М16-Недвижимость» - это:</p>
        <ul>
            <li>Достойный метраж;</li>
            <li>Количество спален от 1 до 6;</li>
            <li>Классические и европейские планировки;</li>
            <li>Гардеробные, постирочные, гостевые санузлы, кладовые;</li>
            <li>Мансарды, двухуровневые квартиры, террасы;</li>
            <li>Роскошные интерьеры и квартиры, стиль которых вы создаете самостоятельно;</li>
            <li>Удачная локация и хорошая транспортная доступность;</li>
            <li>И многое другое!</li>
        </ul>
    </div>
</div>
