<?php  return array (
  'resourceClass' => 'modDocument',
  'resource' => 
  array (
    'id' => 1,
    'type' => 'document',
    'contentType' => 'text/html',
    'pagetitle' => 'Главная',
    'longtitle' => 'Агентство элитной недвижимости М16',
    'description' => 'Текст для тега <meta name=description>',
    'alias' => 'index',
    'alias_visible' => 1,
    'link_attributes' => '',
    'published' => 1,
    'pub_date' => 0,
    'unpub_date' => 0,
    'parent' => 0,
    'isfolder' => 0,
    'introtext' => '',
    'content' => '',
    'richtext' => 1,
    'template' => 1,
    'menuindex' => 0,
    'searchable' => 1,
    'cacheable' => 1,
    'createdby' => 1,
    'createdon' => 1588749316,
    'editedby' => 1,
    'editedon' => 1602756217,
    'deleted' => 0,
    'deletedon' => 0,
    'deletedby' => 0,
    'publishedon' => 0,
    'publishedby' => 0,
    'menutitle' => '',
    'donthit' => 0,
    'privateweb' => 0,
    'privatemgr' => 0,
    'content_dispo' => 0,
    'hidemenu' => 0,
    'class_key' => 'modDocument',
    'context_key' => 'web',
    'content_type' => 1,
    'uri' => '',
    'uri_override' => 0,
    'hide_children_in_tree' => 0,
    'show_in_tree' => 1,
    'properties' => NULL,
    'advantages_title' => 
    array (
      0 => 'advantages_title',
      1 => 'Почему выбирают нас?',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'policy_pdf' => 
    array (
      0 => 'policy_pdf',
      1 => 'Политика конфиденциальности.pdf',
      2 => 'default',
      3 => NULL,
      4 => 'file',
    ),
    'banner_title' => 
    array (
      0 => 'banner_title',
      1 => 'Хотите продать квартиру премиум-класса выгодно и&nbsp;безопасно?',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'advantages_text' => 
    array (
      0 => 'advantages_text',
      1 => 'Нас выбирают, потому что мы надежные!',
      2 => 'default',
      3 => NULL,
      4 => 'textarea',
    ),
    'services_title' => 
    array (
      0 => 'services_title',
      1 => 'Наши услуги',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'calc_title' => 
    array (
      0 => 'calc_title',
      1 => 'Узнайте стоимость вашей квартиры',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'about_title' => 
    array (
      0 => 'about_title',
      1 => 'О нашей компании',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'work_title' => 
    array (
      0 => 'work_title',
      1 => 'Работая с М16, вы получаете',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'clients_title' => 
    array (
      0 => 'clients_title',
      1 => 'Наши клиенты',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'consult_title' => 
    array (
      0 => 'consult_title',
      1 => 'Заказать консультацию',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'contact_title' => 
    array (
      0 => 'contact_title',
      1 => 'Контакты',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'header_logo' => 
    array (
      0 => 'header_logo',
      1 => 'logo.png',
      2 => 'default',
      3 => NULL,
      4 => 'image',
    ),
    'footer_copyright' => 
    array (
      0 => 'footer_copyright',
      1 => '&copy; [[!year]]. Все права защищены.',
      2 => 'default',
      3 => NULL,
      4 => 'textarea',
    ),
    'banner_text' => 
    array (
      0 => 'banner_text',
      1 => 'Мы оперативно найдем вам покупателей и возьмем на себя юридическое сопровождение сделки!',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'advantages_migx' => 
    array (
      0 => 'advantages_migx',
      1 => '[{"MIGX_id":"1","title":"\\u041c\\u044b \\u0433\\u0430\\u0440\\u0430\\u043d\\u0442\\u0438\\u0440\\u0443\\u0435\\u043c \\u043f\\u043e\\u043b\\u043d\\u0443\\u044e \\u043a\\u043e\\u043d\\u0444\\u0438\\u0434\\u0435\\u043d\\u0446\\u0438\\u0430\\u043b\\u044c\\u043d\\u043e\\u0441\\u0442\\u044c","descr":"","icon":"advantages\\/advantage-1.png"},{"MIGX_id":"2","title":"100% \\u0431\\u0435\\u0437\\u043e\\u043f\\u0430\\u0441\\u043d\\u043e\\u0441\\u0442\\u044c","descr":"\\u041a\\u043e\\u043c\\u043f\\u0430\\u043d\\u0438\\u044f 7 \\u043b\\u0435\\u0442 \\u043d\\u0430 \\u0440\\u044b\\u043d\\u043a\\u0435 \\u043d\\u0435\\u0434\\u0432\\u0438\\u0436\\u0438\\u043c\\u043e\\u0441\\u0442\\u0438, \\u041c16 \\u2013 \\u044d\\u0442\\u043e \\u00ab\\u043a\\u043e\\u043c\\u043f\\u0430\\u043d\\u0438\\u044f \\u0441 \\u043b\\u0438\\u0446\\u043e\\u043c\\u00bb \\u0412\\u044f\\u0447\\u0435\\u0441\\u043b\\u0430\\u0432 \\u041c\\u0430\\u043b\\u0430\\u0444\\u0435\\u0435\\u0432 \\u2013 \\u043f\\u0443\\u0431\\u043b\\u0438\\u0447\\u043d\\u0430\\u044f \\u043f\\u0435\\u0440\\u0441\\u043e\\u043d\\u0430 \\u043e\\u043f\\u0440\\u0430\\u0432\\u0434\\u044b\\u0432\\u0430\\u044e\\u0449\\u0430\\u044f \\u0434\\u043e\\u0432\\u0435\\u0440\\u0438\\u0435 17 \\u043b\\u0435\\u0442","icon":"advantages\\/advantage-1.png"},{"MIGX_id":"3","title":"\\u0412\\u044b \\u044d\\u043a\\u043e\\u043d\\u043e\\u043c\\u0438\\u0442\\u0435 \\u0441\\u0432\\u043e\\u0435 \\u0432\\u0440\\u0435\\u043c\\u044f","descr":"\\u041c16 \\u0431\\u0435\\u0440\\u0435\\u0442 \\u043d\\u0430 \\u0441\\u0435\\u0431\\u044f \\u0441\\u043e\\u043f\\u0440\\u043e\\u0432\\u043e\\u0436\\u0434\\u0435\\u043d\\u0438\\u0435 (\\u0440\\u0430\\u0431\\u043e\\u0442\\u0430 \\u0441 \\u0432\\u0445\\u043e\\u0434\\u044f\\u0449\\u0438\\u043c \\u043f\\u043e\\u0442\\u043e\\u043a\\u043e\\u043c, \\u0430\\u043a\\u0442\\u0443\\u0430\\u043b\\u0438\\u0437\\u0438\\u0440\\u043e\\u0432\\u0430\\u043d\\u0438\\u0435 \\u0438\\u043d\\u0444\\u043e\\u0440\\u043c\\u0430\\u0446\\u0438\\u0438 \\u0438 \\u0442.\\u043f.), \\u0440\\u0435\\u043a\\u043b\\u0430\\u043c\\u0443 \\u043e\\u0431\\u044a\\u0435\\u043a\\u0442\\u0430, \\u043f\\u0440\\u0438\\u0432\\u043b\\u0435\\u0447\\u0435\\u043d\\u0438\\u0435 \\u043f\\u043e\\u043a\\u0443\\u043f\\u0430\\u0442\\u0435\\u043b\\u0435\\u0439, \\u043f\\u0440\\u043e\\u0432\\u0435\\u0434\\u0435\\u043d\\u0438\\u0435 \\u043e\\u0441\\u043c\\u043e\\u0442\\u0440\\u043e\\u0432","icon":"advantages\\/advantage-3.png"},{"MIGX_id":"4","title":"\\u041c\\u044b \\u0434\\u0430\\u0435\\u043c \\u0444\\u0438\\u043d\\u0430\\u043d\\u0441\\u043e\\u0432\\u044b\\u0435 \\u0433\\u0430\\u0440\\u0430\\u043d\\u0442\\u0438\\u0438 \\u043f\\u0440\\u043e\\u0434\\u0430\\u0436\\u0438","descr":"\\u041c\\u044b \\u0432\\u0441\\u0435\\u0433\\u0434\\u0430 \\u043e\\u0440\\u0438\\u0435\\u043d\\u0442\\u0438\\u0440\\u0443\\u0435\\u043c\\u0441\\u044f \\u043d\\u0430 \\u043a\\u0430\\u0447\\u0435\\u0441\\u0442\\u0432\\u043e \\u0438 \\u0432\\u044b\\u0441\\u043e\\u043a\\u0438\\u0439 \\u0443\\u0440\\u043e\\u0432\\u0435\\u043d\\u044c \\u043e\\u043a\\u0430\\u0437\\u0430\\u043d\\u0438\\u044f \\u0443\\u0441\\u043b\\u0443\\u0433, \\u043c\\u044b \\u0440\\u0430\\u0431\\u043e\\u0442\\u0430\\u0435\\u043c \\u0447\\u0435\\u0441\\u0442\\u043d\\u043e \\u0438 \\u043f\\u0440\\u043e\\u0437\\u0440\\u0430\\u0447\\u043d\\u043e \\u0438 \\u0443\\u0432\\u0435\\u0440\\u0435\\u043d\\u044b \\u0432 \\u0441\\u0432\\u043e\\u0438\\u0445 \\u0432\\u043e\\u0437\\u043c\\u043e\\u0436\\u043d\\u043e\\u0441\\u0442\\u044f\\u0445, \\u0430 \\u043f\\u043e\\u0442\\u043e\\u043c\\u0443 \\u0433\\u043e\\u0442\\u043e\\u0432\\u044b \\u043f\\u043e\\u0434\\u043a\\u0440\\u0435\\u043f\\u043b\\u044f\\u0442\\u044c \\u0443\\u0432\\u0435\\u0440\\u0435\\u043d\\u043d\\u043e\\u0441\\u0442\\u044c \\u043d\\u0430\\u0448\\u0438\\u0445 \\u043a\\u043b\\u0438\\u0435\\u043d\\u0442\\u043e\\u0432 \\u043a\\u043e\\u043d\\u043a\\u0440\\u0435\\u0442\\u043d\\u044b\\u043c\\u0438 \\u0444\\u0438\\u043d\\u0430\\u043d\\u0441\\u043e\\u0432\\u044b\\u043c\\u0438 \\u043e\\u0431\\u044f\\u0437\\u0430\\u0442\\u0435\\u043b\\u044c\\u0441\\u0442\\u0432\\u0430\\u043c\\u0438","icon":"advantages\\/advantage-4.png"},{"MIGX_id":"5","title":"\\u041f\\u043e\\u043c\\u043e\\u0433\\u0430\\u0435\\u043c \\u0432 \\u0441\\u043d\\u044f\\u0442\\u0438\\u0438 \\u043e\\u0431\\u0440\\u0435\\u043c\\u0435\\u043d\\u0435\\u043d\\u0438\\u0439","descr":"","icon":"advantages\\/advantage-5.png"},{"MIGX_id":"6","title":"\\u0421\\u0440\\u043e\\u0447\\u043d\\u044b\\u0439 \\u0432\\u044b\\u043a\\u0443\\u043f + trade-in","descr":"","icon":"advantages\\/advantage-6.png"},{"MIGX_id":"7","title":"\\u0428\\u0438\\u0440\\u043e\\u043a\\u0438\\u0435 \\u0440\\u0435\\u043a\\u043b\\u0430\\u043c\\u043d\\u044b\\u0435 \\u0432\\u043e\\u0437\\u043c\\u043e\\u0436\\u043d\\u043e\\u0441\\u0442\\u0438","descr":"\\u0423\\u0441\\u0438\\u043b\\u0438\\u044f\\u043c\\u0438 \\u043d\\u0430\\u0448\\u0435\\u0439 \\u043a\\u043e\\u043c\\u0430\\u043d\\u0434\\u044b \\u043d\\u0430 \\u043f\\u0440\\u043e\\u0434\\u0430\\u0436\\u0443 \\u0432\\u0430\\u0448\\u0435\\u0433\\u043e \\u043e\\u0431\\u044a\\u0435\\u043a\\u0442\\u0430 \\u0431\\u0443\\u0434\\u0443\\u0442 \\u0440\\u0430\\u0431\\u043e\\u0442\\u0430\\u0442\\u044c \\u0432\\u0435\\u0434\\u0443\\u0449\\u0438\\u0435 \\u043c\\u0430\\u0440\\u043a\\u0435\\u0442\\u043f\\u043b\\u0435\\u0439\\u0441\\u044b \\u0438 \\u044d\\u0444\\u0444\\u0435\\u043a\\u0442\\u0438\\u0432\\u043d\\u044b\\u0435 digital \\u0438 \\u043e\\u0444\\u043b\\u0430\\u0439\\u043d-\\u0438\\u043d\\u0441\\u0442\\u0440\\u0443\\u043c\\u0435\\u043d\\u0442\\u044b \\u043f\\u0440\\u0438\\u0432\\u043b\\u0435\\u0447\\u0435\\u043d\\u0438\\u044f \\u043a\\u043b\\u0438\\u0435\\u043d\\u0442\\u043e\\u0432: \\u043e\\u0442 \\u043a\\u043e\\u043d\\u0442\\u0435\\u043a\\u0441\\u0442\\u043d\\u043e\\u0439 \\u0438 \\u0442\\u0430\\u0440\\u0433\\u0435\\u0442\\u0438\\u0440\\u043e\\u0432\\u0430\\u043d\\u043d\\u043e\\u0439 \\u0440\\u0435\\u043a\\u043b\\u0430\\u043c\\u044b \\u0434\\u043e \\u0431\\u0430\\u043d\\u043d\\u0435\\u0440\\u043e\\u0432 \\u0438 \\u0440\\u0430\\u0434\\u0438\\u043e","icon":"advantages\\/advantage-7.png"},{"MIGX_id":"8","title":"\\u0411\\u0435\\u0441\\u043f\\u043b\\u0430\\u0442\\u043d\\u0430\\u044f \\u043e\\u0446\\u0435\\u043d\\u043a\\u0430","descr":"\\u041d\\u0430\\u0448\\u0438 \\u0441\\u043f\\u0435\\u0446\\u0438\\u0430\\u043b\\u0438\\u0441\\u0442\\u044b \\u043f\\u0440\\u043e\\u0432\\u0435\\u0434\\u0443\\u0442 \\u043f\\u0435\\u0440\\u0432\\u0438\\u0447\\u043d\\u0443\\u044e \\u043e\\u0446\\u0435\\u043d\\u043a\\u0443 \\u0441\\u0442\\u043e\\u0438\\u043c\\u043e\\u0441\\u0442\\u0438 \\u043b\\u043e\\u0442\\u0430, \\u043e\\u0441\\u043d\\u043e\\u0432\\u044b\\u0432\\u0430\\u044f\\u0441\\u044c \\u043a\\u0430\\u043a \\u043d\\u0430 \\u0441\\u0432\\u043e\\u0435\\u043c \\u043c\\u043d\\u043e\\u0433\\u043e\\u043b\\u0435\\u0442\\u043d\\u0435\\u043c \\u043e\\u043f\\u044b\\u0442\\u0435, \\u0442\\u0430\\u043a \\u0438 \\u043d\\u0430 \\u0430\\u043a\\u0442\\u0443\\u0430\\u043b\\u044c\\u043d\\u044b\\u0445 \\u0434\\u0430\\u043d\\u043d\\u044b\\u0445 \\u043f\\u043e \\u0440\\u044b\\u043d\\u043a\\u0443. \\u041a\\u043e\\u043d\\u0435\\u0447\\u043d\\u0430\\u044f \\u0441\\u0442\\u043e\\u0438\\u043c\\u043e\\u0441\\u0442\\u044c \\u0431\\u0443\\u0434\\u0435\\u0442 \\u043e\\u043f\\u0440\\u0435\\u0434\\u0435\\u043b\\u0435\\u043d\\u0430 \\u043f\\u043e\\u0441\\u043b\\u0435 \\u043b\\u0438\\u0447\\u043d\\u043e\\u0433\\u043e \\u043f\\u043e\\u0441\\u0435\\u0449\\u0435\\u043d\\u0438\\u044f \\u043e\\u0431\\u044a\\u0435\\u043a\\u0442\\u0430. \\u041e\\u0446\\u0435\\u043d\\u043a\\u0430 \\u043f\\u0440\\u043e\\u0432\\u043e\\u0434\\u0438\\u0442\\u0441\\u044f \\u0431\\u0435\\u0441\\u043f\\u043b\\u0430\\u0442\\u043d\\u043e \\u0438 \\u0431\\u044b\\u0441\\u0442\\u0440\\u043e","icon":"advantages\\/advantage-8.png"},{"MIGX_id":"9","title":"\\u0421\\u0432\\u043e\\u044f \\u0431\\u0430\\u0437\\u0430 \\u043a\\u043b\\u0438\\u0435\\u043d\\u0442\\u043e\\u0432","descr":"\\u0417\\u0430 7 \\u043b\\u0435\\u0442 \\u0440\\u0430\\u0431\\u043e\\u0442\\u044b \\u043d\\u0430 \\u0440\\u044b\\u043d\\u043a\\u0435 \\u043d\\u0435\\u0434\\u0432\\u0438\\u0436\\u0438\\u043c\\u043e\\u0441\\u0442\\u0438 \\u043c\\u044b \\u0441\\u043e\\u0431\\u0440\\u0430\\u043b\\u0438 \\u0431\\u043e\\u043b\\u044c\\u0448\\u0443\\u044e \\u0431\\u0430\\u0437\\u0443 \\u043a\\u043b\\u0438\\u0435\\u043d\\u0442\\u043e\\u0432. \\u041f\\u043e\\u0441\\u043b\\u0435 \\u043e\\u0446\\u0435\\u043d\\u043a\\u0438 \\u043d\\u0435\\u0434\\u0432\\u0438\\u0436\\u0438\\u043c\\u043e\\u0441\\u0442\\u0438 \\u0438 \\u043f\\u043e\\u0434\\u043f\\u0438\\u0441\\u0430\\u043d\\u0438\\u044f \\u0434\\u043e\\u0433\\u043e\\u0432\\u043e\\u0440\\u0430 \\u043c\\u044b \\u0441\\u043e\\u0431\\u0435\\u0440\\u0435\\u043c \\u043f\\u0443\\u043b \\u043b\\u043e\\u044f\\u043b\\u044c\\u043d\\u044b\\u0445 \\u043a\\u043b\\u0438\\u0435\\u043d\\u0442\\u043e\\u0432 \\u0438 \\u043f\\u0440\\u0435\\u0434\\u043e\\u0441\\u0442\\u0430\\u0432\\u0438\\u043c \\u0438\\u043c \\u043f\\u043e\\u043b\\u043d\\u0443\\u044e \\u0438\\u043d\\u0444\\u043e\\u0440\\u043c\\u0430\\u0446\\u0438\\u044e \\u043e\\u0431 \\u043e\\u0431\\u044a\\u0435\\u043a\\u0442\\u0435 \\u0432 \\u0444\\u043e\\u0440\\u043c\\u0430\\u0442\\u0435 \\u043f\\u0440\\u0435\\u0437\\u0435\\u043d\\u0442\\u0430\\u0446\\u0438\\u0438","icon":"advantages\\/advantage-9.png"},{"MIGX_id":"10","title":"\\u0428\\u0438\\u0440\\u043e\\u043a\\u0430\\u044f \\u043f\\u0430\\u0440\\u0442\\u043d\\u0435\\u0440\\u0441\\u043a\\u0430\\u044f \\u0441\\u0435\\u0442\\u044c","descr":"\\u041d\\u0435\\u0437\\u0430\\u0432\\u0438\\u0441\\u0438\\u043c\\u043e \\u043e\\u0442 \\u0442\\u043e\\u0433\\u043e, \\u0445\\u043e\\u0442\\u0438\\u0442\\u0435 \\u0432\\u044b \\u043a\\u0443\\u043f\\u0438\\u0442\\u044c \\u0438\\u043b\\u0438 \\u043f\\u0440\\u043e\\u0434\\u0430\\u0442\\u044c \\u043d\\u0435\\u0434\\u0432\\u0438\\u0436\\u0438\\u043c\\u043e\\u0441\\u0442\\u044c, \\u043d\\u0430 \\u0432\\u0430\\u0441 \\u0431\\u0443\\u0434\\u0435\\u0442 \\u0440\\u0430\\u0431\\u043e\\u0442\\u0430\\u0442\\u044c \\u0432\\u0441\\u044f \\u043f\\u0430\\u0440\\u0442\\u043d\\u0435\\u0440\\u0441\\u043a\\u0430\\u044f \\u0441\\u0435\\u0442\\u044c \\u043a\\u043e\\u043c\\u043f\\u0430\\u043d\\u0438\\u0438 \\u00ab\\u041c16 \\u041d\\u0435\\u0434\\u0432\\u0438\\u0436\\u0438\\u043c\\u043e\\u0441\\u0442\\u044c\\u00bb, \\u0432 \\u043a\\u043e\\u0442\\u043e\\u0440\\u0443\\u044e \\u0432\\u0445\\u043e\\u0434\\u0438\\u0442 \\u0431\\u043e\\u043b\\u0435\\u0435 500 \\u0437\\u0430\\u0441\\u0442\\u0440\\u043e\\u0439\\u0449\\u0438\\u043a\\u043e\\u0432 \\u0438 \\u0440\\u0438\\u0435\\u043b\\u0442\\u043e\\u0440\\u043e\\u0432","icon":"advantages\\/advantage-10.png"}]',
      2 => 'default',
      3 => NULL,
      4 => 'migx',
    ),
    'services_descr' => 
    array (
      0 => 'services_descr',
      1 => 'Посмотрите, что мы можем вам предложить',
      2 => 'default',
      3 => NULL,
      4 => 'textarea',
    ),
    'calc_descr' => 
    array (
      0 => 'calc_descr',
      1 => 'Наши специалисты имеют многолетний опыт работы на рынке недвижимости. Укажите параметры вашей квартиры и мы сделаем вам интересное предложение!',
      2 => 'default',
      3 => NULL,
      4 => 'textarea',
    ),
    'about_quotation' => 
    array (
      0 => 'about_quotation',
      1 => '<p>Привычка быть лидером помогает мне эффективно управлять командой профессионалов и оправдывать оказанное доверие!</p>',
      2 => 'default',
      3 => NULL,
      4 => 'richtext',
    ),
    'work_photo' => 
    array (
      0 => 'work_photo',
      1 => 'work_with_us/owner.jpg',
      2 => 'default',
      3 => NULL,
      4 => 'image',
    ),
    'clients_btn_text' => 
    array (
      0 => 'clients_btn_text',
      1 => 'Стать клиентом м16',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'consult_descr' => 
    array (
      0 => 'consult_descr',
      1 => 'Оставьте заявку и наши специалисты проконсультируют вас в течение 15 минут',
      2 => 'default',
      3 => NULL,
      4 => 'textarea',
    ),
    'contact_phone' => 
    array (
      0 => 'contact_phone',
      1 => '8 (812) 610-16-09',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'header_text' => 
    array (
      0 => 'header_text',
      1 => 'Продажа элитной недвижимости в&nbsp;Санкт-Петербурге',
      2 => 'default',
      3 => NULL,
      4 => 'textarea',
    ),
    'footer_dev' => 
    array (
      0 => 'footer_dev',
      1 => '',
      2 => 'default',
      3 => NULL,
      4 => 'textarea',
    ),
    'banner_btn_text' => 
    array (
      0 => 'banner_btn_text',
      1 => 'Получить консультацию',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'services_migx' => 
    array (
      0 => 'services_migx',
      1 => '[{"MIGX_id":"1","title":"\\u0411\\u0435\\u0441\\u043f\\u043b\\u0430\\u0442\\u043d\\u0430\\u044f \\u043e\\u0446\\u0435\\u043d\\u043a\\u0430","descr":"\\u041f\\u0440\\u0435\\u0434\\u0432\\u0430\\u0440\\u0438\\u0442\\u0435\\u043b\\u044c\\u043d\\u0430\\u044f \\u0437\\u0430\\u043e\\u0447\\u043d\\u0430\\u044f \\u043e\\u0446\\u0435\\u043d\\u043a\\u0430 \\u0438 \\u0431\\u043e\\u043b\\u0435\\u0435 \\u0434\\u0435\\u0442\\u0430\\u043b\\u044c\\u043d\\u0430\\u044f \\u043f\\u0440\\u0438 \\u0432\\u044b\\u0435\\u0437\\u0434\\u0435 \\u043d\\u0430 \\u043e\\u0431\\u044a\\u0435\\u043a\\u0442","icon":"services\\/service-1.png"},{"MIGX_id":"2","title":"\\u041b\\u0438\\u0447\\u043d\\u044b\\u0439 \\u043c\\u0435\\u043d\\u0435\\u0434\\u0436\\u0435\\u0440","descr":"\\u0417\\u0430 \\u043a\\u043b\\u0438\\u0435\\u043d\\u0442\\u043e\\u043c \\u0437\\u0430\\u043a\\u0440\\u0435\\u043f\\u043b\\u044f\\u0435\\u0442\\u0441\\u044f \\u043b\\u0438\\u0447\\u043d\\u044b\\u0439 \\u043c\\u0435\\u043d\\u0435\\u0434\\u0436\\u0435\\u0440, \\u043a\\u043e\\u0442\\u043e\\u0440\\u044b\\u0439 \\u043f\\u043e\\u043b\\u043d\\u043e\\u0441\\u0442\\u044c\\u044e \\u0431\\u0435\\u0440\\u0435\\u0442 \\u043d\\u0430 \\u0441\\u0435\\u0431\\u044f \\u0441\\u043e\\u043f\\u0440\\u043e\\u0432\\u043e\\u0436\\u0434\\u0435\\u043d\\u0438\\u0435 \\u043a\\u043b\\u0438\\u0435\\u043d\\u0442\\u0430 \\u0438 \\u0435\\u0433\\u043e \\u043e\\u0431\\u044a\\u0435\\u043a\\u0442\\u0430, \\u0434\\u043e\\u0441\\u0442\\u0443\\u043f\\u0435\\u043d \\u043f\\u043e\\u0447\\u0442\\u0438 \\u0432 \\u043b\\u044e\\u0431\\u043e\\u0435 \\u0432\\u0440\\u0435\\u043c\\u044f (\\u0440\\u0430\\u0437\\u0443\\u043c\\u043d\\u043e\\u0435)","icon":"services\\/service-2.png"},{"MIGX_id":"3","title":"\\u0421\\u0440\\u043e\\u0447\\u043d\\u044b\\u0439 \\u0432\\u044b\\u043a\\u0443\\u043f \\u043a\\u0432\\u0430\\u0440\\u0442\\u0438\\u0440 + trade-in","descr":"\\u0412\\u044b \\u043f\\u043e\\u043b\\u0443\\u0447\\u0430\\u0435\\u0442\\u0435 \\u0434\\u0435\\u043d\\u044c\\u0433\\u0438 \\u0443\\u0436\\u0435 \\u0447\\u0435\\u0440\\u0435\\u0437 2-7 \\u0434\\u043d\\u0435\\u0439 \\u0432 \\u0437\\u0430\\u0432\\u0438\\u0441\\u0438\\u043c\\u043e\\u0441\\u0442\\u0438 \\u043e\\u0442 \\u043d\\u0430\\u043b\\u0438\\u0447\\u0438\\u044f \\u043e\\u0431\\u0440\\u0435\\u043c\\u0435\\u043d\\u0435\\u043d\\u0438\\u0439 \\u0438 \\u044e\\u0440\\u0438\\u0434\\u0438\\u0447\\u0435\\u0441\\u043a\\u0438\\u0445 \\u0430\\u0441\\u043f\\u0435\\u043a\\u0442\\u043e\\u0432. \\u0422\\u0430\\u043a\\u0436\\u0435, \\u043c\\u044b \\u043f\\u043e\\u043c\\u043e\\u0433\\u0430\\u0435\\u043c \\u0432 \\u043f\\u043e\\u0438\\u0441\\u043a\\u0435 \\u043d\\u043e\\u0432\\u043e\\u0433\\u043e \\u0436\\u0438\\u043b\\u044c\\u044f","icon":"services\\/service-3.png"},{"MIGX_id":"4","title":"\\u041f\\u0440\\u0435\\u0434\\u043f\\u0440\\u043e\\u0434\\u0430\\u0436\\u043d\\u0430\\u044f \\u043f\\u043e\\u0434\\u0433\\u043e\\u0442\\u043e\\u0432\\u043a\\u0430 (\\u0444\\u043e\\u0442\\u043e, \\u043f\\u0430\\u043d\\u043e\\u0440\\u0430\\u043c\\u044b, \\u043e\\u0442\\u0440\\u0438\\u0441\\u043e\\u0432\\u043a\\u0430 \\u043f\\u043b\\u0430\\u043d\\u0438\\u0440\\u043e\\u0432\\u043e\\u043a)","descr":"\\u041f\\u0430\\u043d\\u043e\\u0440\\u0430\\u043c\\u044b - \\u044d\\u0442\\u043e \\u043f\\u043b\\u0430\\u0442\\u043d\\u0430\\u044f \\u043e\\u043f\\u0446\\u0438\\u044f, \\u0444\\u043e\\u0442\\u043e \\u0438 \\u043f\\u043b\\u0430\\u043d\\u0438\\u0440\\u043e\\u0432\\u043a\\u0438 \\u043c\\u044b \\u0434\\u0435\\u043b\\u0430\\u0435\\u043c \\u0431\\u0435\\u0441\\u043f\\u043b\\u0430\\u0442\\u043d\\u043e","icon":"services\\/service-4.png"},{"MIGX_id":"5","title":"3D- \\u0434\\u0438\\u0437\\u0430\\u0439\\u043d","descr":"\\u041e\\u0442\\u0434\\u0435\\u043b\\u044c\\u043d\\u0430\\u044f \\u0443\\u0441\\u043b\\u0443\\u0433\\u0430 \\u043f\\u043e \\u0441\\u0432\\u043e\\u0435\\u043c\\u0443 \\u0447\\u0435\\u043a\\u0443. \\u0415\\u0435 \\u043d\\u0430\\u043b\\u0438\\u0447\\u0438\\u0435 \\u0438\\u043c\\u0435\\u0435\\u0442 \\u0432\\u0435\\u0441 \\u0440\\u0430\\u0437\\u0432\\u0435 \\u0447\\u0442\\u043e \\u0441 \\u0442\\u043e\\u0447\\u043a\\u0438 \\u0437\\u0440\\u0435\\u043d\\u0438\\u044f \\u0441\\u0435\\u0440\\u0432\\u0438\\u0441\\u0430 \\u00ab\\u043e\\u0434\\u043d\\u043e\\u0433\\u043e \\u043e\\u043a\\u043d\\u0430\\u00bb","icon":"services\\/service-5.png"},{"MIGX_id":"6","title":"\\u042e\\u0440\\u0438\\u0434\\u0438\\u0447\\u0435\\u0441\\u043a\\u043e\\u0435 \\u0441\\u043e\\u043f\\u0440\\u043e\\u0432\\u043e\\u0436\\u0434\\u0435\\u043d\\u0438\\u0435","descr":"\\u0423 \\u043d\\u0430\\u0441 \\u0435\\u0441\\u0442\\u044c \\u0441\\u0432\\u043e\\u044f \\u044e\\u0440\\u0438\\u0434\\u0438\\u0447\\u0435\\u0441\\u043a\\u0430\\u044f \\u043a\\u043e\\u043c\\u043f\\u0430\\u043d\\u0438\\u044f, \\u043d\\u043e \\u0443\\u0433\\u043b\\u0443\\u0431\\u043b\\u0435\\u043d\\u043d\\u044b\\u0435 \\u043f\\u0440\\u043e\\u0432\\u0435\\u0440\\u043a\\u0438 \\u043e\\u0431\\u044a\\u0435\\u043a\\u0442\\u043e\\u0432 \\u0438 \\u0441\\u043e\\u0431\\u0441\\u0442\\u0432\\u0435\\u043d\\u043d\\u0438\\u043a\\u043e\\u0432 \\u043f\\u0440\\u043e\\u0432\\u043e\\u0434\\u044f\\u0442\\u0441\\u044f \\u043a\\u0430\\u043a \\u043f\\u0440\\u0430\\u0432\\u0438\\u043b\\u043e \\u0437\\u0430 \\u043e\\u0442\\u0434\\u0435\\u043b\\u044c\\u043d\\u044b\\u0439 \\u0447\\u0435\\u043a","icon":"services\\/service-6.png"}]',
      2 => 'default',
      3 => NULL,
      4 => 'migx',
    ),
    'calc_btn_text' => 
    array (
      0 => 'calc_btn_text',
      1 => 'Оставить заявку',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'about_text' => 
    array (
      0 => 'about_text',
      1 => '<p>&laquo;М16-Недвижимость&raquo; основана вратарем ФК &laquo;Зенит&raquo; Вячеславом Малафеевым. География работы &mdash; Санкт-Петербург и Ленинградская область.</p>
<p>Отличная ориентация на рынке, безупречный сервис и эксклюзивные услуги, а также постоянное развитие позволяют <br />&laquo;М16-Недвижимость&raquo; быстро и продуктивно решать задачи наших клиентов.</p>',
      2 => 'default',
      3 => NULL,
      4 => 'richtext',
    ),
    'work_list1' => 
    array (
      0 => 'work_list1',
      1 => '[{"MIGX_id":"1","title":"\\u0420\\u0435\\u043a\\u043b\\u0430\\u043c\\u043d\\u044b\\u0435 \\u0432\\u043e\\u0437\\u043c\\u043e\\u0436\\u043d\\u043e\\u0441\\u0442\\u0438","descr":"\\u0423\\u0441\\u0438\\u043b\\u0438\\u044f\\u043c\\u0438 \\u043d\\u0430\\u0448\\u0435\\u0439 \\u043a\\u043e\\u043c\\u0430\\u043d\\u0434\\u044b \\u043d\\u0430 \\u043f\\u0440\\u043e\\u0434\\u0430\\u0436\\u0443 \\u0432\\u0430\\u0448\\u0435\\u0433\\u043e \\u043e\\u0431\\u044a\\u0435\\u043a\\u0442\\u0430 \\u0431\\u0443\\u0434\\u0443\\u0442 \\u0440\\u0430\\u0431\\u043e\\u0442\\u0430\\u0442\\u044c \\u0432\\u0441\\u0435 \\u0432\\u0435\\u0434\\u0443\\u0449\\u0438\\u0435 \\u043c\\u0430\\u0440\\u043a\\u0435\\u0442\\u043f\\u043b\\u0435\\u0439\\u0441\\u044b \\u0438 \\u044d\\u0444\\u0444\\u0435\\u043a\\u0442\\u0438\\u0432\\u043d\\u044b\\u0435 digital \\u0438 \\u043e\\u0444\\u043b\\u0430\\u0439\\u043d-\\u0438\\u043d\\u0441\\u0442\\u0440\\u0443\\u043c\\u0435\\u043d\\u0442\\u044b \\u043f\\u0440\\u0438\\u0432\\u043b\\u0435\\u0447\\u0435\\u043d\\u0438\\u044f \\u043f\\u043e\\u0442\\u0435\\u043d\\u0446\\u0438\\u0430\\u043b\\u044c\\u043d\\u044b\\u0445 \\u043a\\u043b\\u0438\\u0435\\u043d\\u0442\\u043e\\u0432: \\u043e\\u0442 \\u043a\\u043e\\u043d\\u0442\\u0435\\u043a\\u0441\\u0442\\u043d\\u043e\\u0439 \\u0438 \\u0442\\u0430\\u0440\\u0433\\u0435\\u0442\\u0438\\u0440\\u043e\\u0432\\u0430\\u043d\\u043d\\u043e\\u0439 \\u0440\\u0435\\u043a\\u043b\\u0430\\u043c\\u044b \\u0434\\u043e \\u0431\\u0430\\u043d\\u043d\\u0435\\u0440\\u043e\\u0432 \\u0438 \\u0440\\u0430\\u0434\\u0438\\u043e."},{"MIGX_id":"5","title":"\\u0421\\u0432\\u043e\\u044f \\u0431\\u0430\\u0437\\u0430 \\u043a\\u043b\\u0438\\u0435\\u043d\\u0442\\u043e\\u0432","descr":"\\u0417\\u0430 \\u0431\\u043e\\u043b\\u0435\\u0435 \\u0447\\u0435\\u043c 7 \\u043b\\u0435\\u0442 \\u043f\\u0440\\u043e\\u0434\\u0443\\u043a\\u0442\\u0438\\u0432\\u043d\\u043e\\u0439 \\u0440\\u0430\\u0431\\u043e\\u0442\\u044b \\u043d\\u0430 \\u0440\\u044b\\u043d\\u043a\\u0435 \\u043d\\u0435\\u0434\\u0432\\u0438\\u0436\\u0438\\u043c\\u043e\\u0441\\u0442\\u0438 \\u043c\\u044b \\u0441\\u043e\\u0431\\u0440\\u0430\\u043b\\u0438 \\u0431\\u043e\\u043b\\u044c\\u0448\\u0443\\u044e \\u0431\\u0430\\u0437\\u0443 \\u0440\\u0435\\u0433\\u0443\\u043b\\u044f\\u0440\\u043d\\u044b\\u0445 \\u043f\\u0430\\u0440\\u0442\\u043d\\u0435\\u0440\\u043e\\u0432 \\u0438 \\u043f\\u043e\\u0441\\u0442\\u043e\\u044f\\u043d\\u043d\\u044b\\u0445 \\u043a\\u043b\\u0438\\u0435\\u043d\\u0442\\u043e\\u0432 \\u0438 \\u043d\\u0430\\u043b\\u0430\\u0434\\u0438\\u043b\\u0438 \\u0438\\u043d\\u0441\\u0442\\u0440\\u0443\\u043c\\u0435\\u043d\\u0442\\u044b \\u0432\\u0437\\u0430\\u0438\\u043c\\u043e\\u0434\\u0435\\u0439\\u0441\\u0442\\u0432\\u0438\\u044f \\u0441 \\u043d\\u0438\\u043c\\u0438."},{"MIGX_id":"6","title":"\\u0428\\u0438\\u0440\\u043e\\u043a\\u0430\\u044f \\u043f\\u0430\\u0440\\u0442\\u043d\\u0435\\u0440\\u0441\\u043a\\u0430\\u044f \\u0441\\u0435\\u0442\\u044c","descr":"\\u041d\\u0435\\u0437\\u0430\\u0432\\u0438\\u0441\\u0438\\u043c\\u043e \\u043e\\u0442 \\u0442\\u043e\\u0433\\u043e, \\u0445\\u043e\\u0442\\u0438\\u0442\\u0435 \\u0432\\u044b \\u043a\\u0443\\u043f\\u0438\\u0442\\u044c \\u0438\\u043b\\u0438 \\u043f\\u0440\\u043e\\u0434\\u0430\\u0442\\u044c \\u043d\\u0435\\u0434\\u0432\\u0438\\u0436\\u0438\\u043c\\u043e\\u0441\\u0442\\u044c, \\u043d\\u0430 \\u0432\\u0430\\u0441 \\u0431\\u0443\\u0434\\u0435\\u0442 \\u0440\\u0430\\u0431\\u043e\\u0442\\u0430\\u0442\\u044c \\u0432\\u0441\\u044f \\u043f\\u0430\\u0440\\u0442\\u043d\\u0435\\u0440\\u0441\\u043a\\u0430\\u044f \\u0441\\u0435\\u0442\\u044c \\u043a\\u043e\\u043c\\u043f\\u0430\\u043d\\u0438\\u0438 \\u00ab\\u041c16 \\u041d\\u0435\\u0434\\u0432\\u0438\\u0436\\u0438\\u043c\\u043e\\u0441\\u0442\\u044c\\u00bb, \\u0432 \\u043a\\u043e\\u0442\\u043e\\u0440\\u0443\\u044e \\u0432\\u0445\\u043e\\u0434\\u0438\\u0442 \\u0431\\u043e\\u043b\\u0435\\u0435 500 \\u0437\\u0430\\u0441\\u0442\\u0440\\u043e\\u0439\\u0449\\u0438\\u043a\\u043e\\u0432 \\u0438 \\u0440\\u0438\\u0435\\u043b\\u0442\\u043e\\u0440\\u043e\\u0432."}]',
      2 => 'default',
      3 => NULL,
      4 => 'migx',
    ),
    'clients_btn_enabled' => 
    array (
      0 => 'clients_btn_enabled',
      1 => '1',
      2 => 'default',
      3 => NULL,
      4 => 'checkbox',
    ),
    'consult_btn_text' => 
    array (
      0 => 'consult_btn_text',
      1 => 'Получить консультацию',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'contact_email' => 
    array (
      0 => 'contact_email',
      1 => 'mail@m16.bz',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'banner_btn_enabled' => 
    array (
      0 => 'banner_btn_enabled',
      1 => '1',
      2 => 'default',
      3 => NULL,
      4 => 'checkbox',
    ),
    'certificates_migx' => 
    array (
      0 => 'certificates_migx',
      1 => '[{"MIGX_id":"1","title":"","image":"about\\/certificates\\/certificate-1.jpg"},{"MIGX_id":"2","title":"","image":"about\\/certificates\\/certificate-2.jpg"},{"MIGX_id":"3","title":"","image":"about\\/certificates\\/certificate-1.jpg"},{"MIGX_id":"4","title":"","image":"about\\/certificates\\/certificate-2.jpg"},{"MIGX_id":"5","title":"","image":"about\\/certificates\\/certificate-1.jpg"}]',
      2 => 'default',
      3 => NULL,
      4 => 'migx',
    ),
    'work_list2' => 
    array (
      0 => 'work_list2',
      1 => '[{"MIGX_id":"2","title":"\\u0424\\u0438\\u043d\\u0430\\u043d\\u0441\\u043e\\u0432\\u044b\\u0435 \\u0433\\u0430\\u0440\\u0430\\u043d\\u0442\\u0438\\u0438 \\u043f\\u0440\\u043e\\u0434\\u0430\\u0436\\u0438 \\u0432\\u0430\\u0448\\u0435\\u0439 \\u043a\\u0432\\u0430\\u0440\\u0442\\u0438\\u0440\\u044b","descr":"\\u041c\\u044b \\u0432\\u0441\\u0435\\u0433\\u0434\\u0430 \\u043e\\u0440\\u0438\\u0435\\u043d\\u0442\\u0438\\u0440\\u0443\\u0435\\u043c\\u0441\\u044f \\u043d\\u0430 \\u043a\\u0430\\u0447\\u0435\\u0441\\u0442\\u0432\\u043e \\u0438 \\u0432\\u044b\\u0441\\u043e\\u043a\\u0438\\u0439 \\u0443\\u0440\\u043e\\u0432\\u0435\\u043d\\u044c \\u043e\\u043a\\u0430\\u0437\\u0430\\u043d\\u0438\\u044f \\u0443\\u0441\\u043b\\u0443\\u0433, \\u043c\\u044b \\u0440\\u0430\\u0431\\u043e\\u0442\\u0430\\u0435\\u043c \\u0447\\u0435\\u0441\\u0442\\u043d\\u043e \\u0438 \\u043f\\u0440\\u043e\\u0437\\u0440\\u0430\\u0447\\u043d\\u043e \\u0438 \\u0443\\u0432\\u0435\\u0440\\u0435\\u043d\\u044b \\u0432 \\u0441\\u0432\\u043e\\u0438\\u0445 \\u0432\\u043e\\u0437\\u043c\\u043e\\u0436\\u043d\\u043e\\u0441\\u0442\\u044f\\u0445, \\u0430 \\u043f\\u043e\\u0442\\u043e\\u043c\\u0443 \\u0433\\u043e\\u0442\\u043e\\u0432\\u044b \\u043f\\u043e\\u0434\\u043a\\u0440\\u0435\\u043f\\u043b\\u044f\\u0442\\u044c \\u0443\\u0432\\u0435\\u0440\\u0435\\u043d\\u043d\\u043e\\u0441\\u0442\\u044c \\u043d\\u0430\\u0448\\u0438\\u0445 \\u043a\\u043b\\u0438\\u0435\\u043d\\u0442\\u043e\\u0432 \\u043a\\u043e\\u043d\\u043a\\u0440\\u0435\\u0442\\u043d\\u044b\\u043c\\u0438 \\u0444\\u0438\\u043d\\u0430\\u043d\\u0441\\u043e\\u0432\\u044b\\u043c\\u0438 \\u043e\\u0431\\u044f\\u0437\\u0430\\u0442\\u0435\\u043b\\u044c\\u0441\\u0442\\u0432\\u0430\\u043c\\u0438 \\u0441\\u043e \\u0441\\u0432\\u043e\\u0435\\u0439 \\u0441\\u0442\\u043e\\u0440\\u043e\\u043d\\u044b."},{"MIGX_id":"6","title":"\\u0411\\u0435\\u0441\\u043f\\u043b\\u0430\\u0442\\u043d\\u0430\\u044f \\u043e\\u0446\\u0435\\u043d\\u043a\\u0430 \\u043d\\u0435\\u0434\\u0432\\u0438\\u0436\\u0438\\u043c\\u043e\\u0441\\u0442\\u0438","descr":"\\u041d\\u0430\\u0448\\u0438 \\u0441\\u043f\\u0435\\u0446\\u0438\\u0430\\u043b\\u0438\\u0441\\u0442\\u044b \\u043f\\u0440\\u043e\\u0432\\u0435\\u0434\\u0443\\u0442 \\u043f\\u0435\\u0440\\u0432\\u0438\\u0447\\u043d\\u0443\\u044e \\u043e\\u0446\\u0435\\u043d\\u043a\\u0443 \\u0441\\u0442\\u043e\\u0438\\u043c\\u043e\\u0441\\u0442\\u0438 \\u043b\\u043e\\u0442\\u0430, \\u043e\\u0441\\u043d\\u043e\\u0432\\u044b\\u0432\\u0430\\u044f\\u0441\\u044c \\u043a\\u0430\\u043a \\u043d\\u0430 \\u0441\\u0432\\u043e\\u0435\\u043c \\u043c\\u043d\\u043e\\u0433\\u043e\\u043b\\u0435\\u0442\\u043d\\u0435\\u043c \\u043e\\u043f\\u044b\\u0442\\u0435, \\u0442\\u0430\\u043a \\u0438 \\u043d\\u0430 \\u0430\\u043a\\u0442\\u0443\\u0430\\u043b\\u044c\\u043d\\u044b\\u0445 \\u0434\\u0430\\u043d\\u043d\\u044b\\u0445 \\u043f\\u043e \\u0440\\u044b\\u043d\\u043a\\u0443. \\u041a\\u043e\\u043d\\u0435\\u0447\\u043d\\u0430\\u044f \\u0441\\u0442\\u043e\\u0438\\u043c\\u043e\\u0441\\u0442\\u044c \\u0431\\u0443\\u0434\\u0435\\u0442 \\u043e\\u043f\\u0440\\u0435\\u0434\\u0435\\u043b\\u0435\\u043d\\u0430 \\u043f\\u043e\\u0441\\u043b\\u0435 \\u043b\\u0438\\u0447\\u043d\\u043e\\u0433\\u043e \\u043f\\u043e\\u0441\\u0435\\u0449\\u0435\\u043d\\u0438\\u044f \\u043e\\u0431\\u044a\\u0435\\u043a\\u0442\\u0430. \\u041e\\u0446\\u0435\\u043d\\u043a\\u0430 \\u043f\\u0440\\u043e\\u0432\\u043e\\u0434\\u0438\\u0442\\u0441\\u044f \\u0431\\u0435\\u0441\\u043f\\u043b\\u0430\\u0442\\u043d\\u043e \\u0438 \\u0437\\u0430\\u043d\\u0438\\u043c\\u0430\\u0435\\u0442 \\u043c\\u0438\\u043d\\u0438\\u043c\\u0443\\u043c \\u0432\\u0430\\u0448\\u0435\\u0433\\u043e \\u0432\\u0440\\u0435\\u043c\\u0435\\u043d\\u0438. "}]',
      2 => 'default',
      3 => NULL,
      4 => 'migx',
    ),
    'clients_migx' => 
    array (
      0 => 'clients_migx',
      1 => '[{"MIGX_id":"10","image":"a07e622a0a9ae36a47995e0a20d10906.jpg","name":"Бабушкины Евгений и Юлия","message":"От всей души хотелось бы поблагодарить за высокий профессионализм и компетентность ведущего специалиста отдела продаж городской и элитной недвижимости Компании Вячеслава Малафеева \\"М 16Недвижимость\\" Макаренко Марину Васильевну.\\n\\nМы не в первый раз пользуемся Вашей помощью и благодарим Вас за проделанную работу. Все было выполнено в полном объеме и в обещанные сроки. Хотим отметить Вашу целеустремленность, усердие, а так же терпение в переговорах с покупателями. Оформление документов было сделано быстро, четко, на высоком профессиональном уровне.\\n\\nНадеемся, что у нас сохранятся теплые дружеские отношения. Работа таких специалистов формирует очень привлекательный и позитивный имидж Вашей компании. К Вам хочется обращаться и рекомендовать своим друзьям и знакомым.\\n\\nЖелаем всему коллективу крепкого здоровья, благополучия, развития и процветания!!!\\n\\nМы уверенны, что эта команда профессионалов уверенно проведет по тернистому пути взаимоотношений и приобретения нового качества жизни.\\n\\n\\n \\n\\nС уважением и признательностью,\\nБабушкины Евгений и Юлия.","rating":"5"},{"MIGX_id":"8","image":"c067bf5b76f794118d9515e176e5c13e.jpeg","name":"Татьяна и Регина Каримовы","message":"Хочу выразить огромную благодарность Светлане Дубовой, агенту который выполняет свою работу на 100% , а то и больше. Ещё раз спасибо что в такой не простой период нам с дочерью была оказана огромная помощь и поддержка. Спасибо Светлане и удач в работе и в жизни. С благодарностью Татьяна и Регина Каримовы","rating":"5"},{"MIGX_id":"9","image":"349G349GN3G3G.jpeg","name":"Ольга Зуевская","message":"Хочу поблагодарить группу М 16 и лично Марину Макаренко за прекрасно организованную сделку по покупке квартиры. До знакомства  с Мариной у меня было устоявшееся мнение что агенства недвижимости это лишнее звено и раздражающий фактор при сделке. Поэтому легко и спокойно было работать с профессионалом своего дела и к тому же приятным в общении и терпеливым человеком. Мои интересы учитывались на каждом этапе, было приятно. Спасибо вам за ваш труд.","rating":"5"},{"MIGX_id":"7","image":"4e21b9c214d5af525fde4361fbb013be.jpeg","name":"Татьяна","message":"Очень хочется сказать большое человеческое спасибо Светлане Дубовой за помощь в поиске и покупке недвижимости. Я прислушалась к ее ценным советам опытного  специалиста и приобрела отличную квартиру, за что Светлане очень благодарна. И сделка прошла на Ура! Я уже не в первый раз обращаюсь в агенство М-16 и всегда получаю прекрасный результат. Желаю Светлане отличных клиентов","rating":"5"},{"MIGX_id":"2","image":"clients/2.jpeg","name":"Сергей Ермольский","message":"Очень понравилось. Мария Ерофеева предоставила развернутые ответы на все наши вопросы. Предлагала и комментировала все варианты, которые мы отсматривали. Были в восторге от бесплатной услуги по трансферу на объекты и потом на сделку. Спасибо водителю Дмитрию!","rating":"5"},{"MIGX_id":"3","image":"clients/3.png","name":"Елена Михайлова","message":"Благодарю сотрудников М16 и менеджера Ерофееву Марию Александровну за отличную работу, за хорошее отношение,всем советую работать с этой компанией,выражаю благодарность водителям за внимание и отношение к своим клиентам!!!","rating":"4"},{"MIGX_id":"4","image":"clients/4.jpeg","name":"Константин Авдеев","message":"Стали думать о покупке квартиры перед рождением второго ребенка. Через интернет нашел Агенство М16. Очень понравилось работать с сотрудниками этой компании. Спасибо огромное Лиане Кулиджанян за поиск нашей квартиры. Очень рады приобретению квартиры в желаемом месте)))","rating":"5"},{"MIGX_id":"5","image":"clients/5.jpeg","name":"Елизавета Пинчук","message":"Агентство «М16» поразило очень человечным, чутким, заботливым отношением к нам. Все действия профессиональны, с опережением наших пожеланий. Никаких недочётов, ошибок, безупречно всё выполнено. Оказали неоценимую помощь.","rating":"5"},{"MIGX_id":"6","image":"clients/6.jpeg","name":"Кристина Рубцова","message":"Сегодня окончательно завершилась наша очень тяжелая сделка. И мы получили отличный бонус от компании «М16-Недвижимость», мужики мои довольны и покупкой, и подарками. М16 - вы лучшие! Спасибо огромное вашему агентству за профессионализм!!! Я, конечно, больше никогда не ввяжусь в это дело, но если вдруг, то только к вам.","rating":"5"}]',
      2 => 'default',
      3 => NULL,
      4 => 'migx',
    ),
    'contact_address' => 
    array (
      0 => 'contact_address',
      1 => 'Санкт-Петербург, Большая Зеленина, д.18',
      2 => 'default',
      3 => NULL,
      4 => 'textarea',
    ),
    'banner_bg' => 
    array (
      0 => 'banner_bg',
      1 => 'banner/banner-bg.jpg',
      2 => 'default',
      3 => NULL,
      4 => 'image',
    ),
    'about_photo' => 
    array (
      0 => 'about_photo',
      1 => 'about/people.jpg',
      2 => 'default',
      3 => NULL,
      4 => 'image',
    ),
    'contact_work_hours' => 
    array (
      0 => 'contact_work_hours',
      1 => '10:00 - 20:00 (ежедневно)',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'banner_photo' => 
    array (
      0 => 'banner_photo',
      1 => 'banner/banner-owner.png',
      2 => 'default',
      3 => NULL,
      4 => 'image',
    ),
    'about_photo_title' => 
    array (
      0 => 'about_photo_title',
      1 => 'Вячеслав и Екатерина Малафеевы',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'contact_vk' => 
    array (
      0 => 'contact_vk',
      1 => 'https://vk.com',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'owner_name' => 
    array (
      0 => 'owner_name',
      1 => 'Вячеслав Малафеев',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'about_photo_descr' => 
    array (
      0 => 'about_photo_descr',
      1 => 'Владельцы агентства недвижимости M16',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'contact_fb' => 
    array (
      0 => 'contact_fb',
      1 => 'https://fb.com',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'owner_descr' => 
    array (
      0 => 'owner_descr',
      1 => 'Владелец агентства недвижимости M16 Голкипер ФК «Зенит»',
      2 => 'default',
      3 => NULL,
      4 => 'textarea',
    ),
    'contact_instagram' => 
    array (
      0 => 'contact_instagram',
      1 => 'https://instagram.com',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'owner_logo' => 
    array (
      0 => 'owner_logo',
      1 => 'banner/zenit_logo.png',
      2 => 'default',
      3 => NULL,
      4 => 'image',
    ),
    'contact_map_coords' => 
    array (
      0 => 'contact_map_coords',
      1 => '59.962528, 30.288159',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'contact_map_balloon_text' => 
    array (
      0 => 'contact_map_balloon_text',
      1 => 'Офис: г. Санкт-Петербург, Большая Зеленина, д.18',
      2 => 'default',
      3 => NULL,
      4 => 'textarea',
    ),
    'contact_how_to_title' => 
    array (
      0 => 'contact_how_to_title',
      1 => 'Как доехать к нам',
      2 => 'default',
      3 => NULL,
      4 => 'text',
    ),
    'contact_how_to_text' => 
    array (
      0 => 'contact_how_to_text',
      1 => '<p>3 минуты ходьбы от станции метро Чкаловская до Большой Зелениной, дом 18. Вход находится рядом с магазином цветов.<img src="3d83da2daf.jpg" alt="" width="855" height="726" /></p>',
      2 => 'default',
      3 => NULL,
      4 => 'richtext',
    ),
    '_content' => '<!doctype html>
<html lang="ru">
<head>
<!-- Google Tag Manager -->
<script>(function(w,d,s,l,i){w[l]=w[l]||[];w[l].push({\'gtm.start\':
new Date().getTime(),event:\'gtm.js\'});var f=d.getElementsByTagName(s)[0],
j=d.createElement(s),dl=l!=\'dataLayer\'?\'&l=\'+l:\'\';j.async=true;j.src=
\'https://www.googletagmanager.com/gtm.js?id=\'+i+dl;f.parentNode.insertBefore(j,f);
})(window,document,\'script\',\'dataLayer\',\'GTM-NSD85P7\');</script>
<!-- End Google Tag Manager -->

    <base href="[[!++site_url]]" />
<meta charset="utf-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge"/>
<meta name="viewport" content="width=device-width, initial-scale=1"/>


<!-- disable safari phone number detection-->
<meta name="format-detection" content="telephone=no"/>
<title>Агентство элитной недвижимости М16</title>
<meta name="description" content="Текст для тега <meta name=description>">
    
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="icon" href="/favicon.ico" type="image/x-icon">
    
<link href="https://fonts.googleapis.com/css2?family=Roboto:ital,wght@0,300;0,500;0,700;1,500&amp;display=swap" rel="stylesheet"/>
<link href="assets/css/style.css?v=[[!timestamp]]" rel="stylesheet"/>
<style>
    @media screen and (min-width: 768px) {
        .working-with-us-slide ul li {
            margin-top: 32px;
        }
        
        .working-with-us-slide ul li:first-child {
            margin-top: 0;
        }
    }
</style>
<script src="assets/js/libs/jquery.min.js"></script>
<script src="assets/js/libs/jquery.scrollTo.min.js"></script>
<script src="assets/js/libs/jquery.fancybox.min.js"></script>
<script src="assets/js/libs/slick.min.js"></script>
<script src="assets/js/libs/jquery.maskedinput.min.js"></script>
<script src="assets/js/libs/ion.rangeSlider.min.js"></script>
<script src="assets/js/app.js?v=[[!timestamp]]"></script>

<script>
			function get_cookie(cookie_name) {
				let results = document.cookie.match(\'(^|;) ?\' + cookie_name + \'=([^;]*)(;|$)\');
				if (results) return (unescape(results[2]));
				else
					return null;
				}
			setTimeout(function() {
				if (get_cookie(\'privacy_confirm\') != 1) {
					$(\'#cookie-attention-widget\').css(\'display\', \'block\');
					}
				}, 4000);
			function set_cookie(name, value, exp_y, exp_m, exp_d, path, domain, secure) {
				let cookie_string = name + "=" + escape(value);
				if (exp_y) {
					let expires = new Date(exp_y, exp_m, exp_d);
					cookie_string += "; expires=" + expires.toGMTString();
					}
				if (path) cookie_string += "; path=" + escape(path);
				if (domain) cookie_string += "; domain=" + escape(domain);
				if (secure) cookie_string += "; secure";
				document.cookie = cookie_string;
				}
		</script>

<style type="text/css">
.cookie-attention-choice ~ .cookie-attention-presence{
	display: inline-block;
	vertical-align: top;
	margin-right: 16px;
	padding: 6px 6px;
	min-width: 100px;
	text-align: center;
	color: #fff;
	font-weight: bold;
	cursor: pointer;
}
.cookie-attention-choice.__positive ~ .cookie-attention-presence{
	background: #b59974;
}
.cookie-attention-choice{
	position: absolute;
    clip: rect(0,0,0,0);
}
.cookie-attention-wrapper{
	margin: 0 auto;
	padding: 15px 15px 20px 15px;
	max-width: 800px;
	font-family: "Arial", sans-serif;
}
.cookie-attention-text{
	width: auto;
	margin-bottom: 8px;
	line-height: 1.2;
}
.cookie-attention {
    position: fixed;
    z-index: 6;
    width: 100vw;
    bottom: 0;
}
</style>

<script>
$(document).on(\'submit\', \'.ajax_form\', function() {
    var form = $(this);

    // Результатом работы будет выставление глобальной переменной
    //afValidated = false; // Или true, если валидация пройдена
    
    // Check phone mask
    afValidated = true;
    
    var phone_value = form.find(\'.phone-mask\').val();
    if (phone_value == \'+7 (___) ___-__-__\') {
    	afValidated = false;
    }
});
</script>

<script>
    $(document).on(\'af_complete\', function(event, response) {
        var form = response.form;
        var msgTitle, msgText;
        
        if (response.success) {
            msgTitle = form.find("input[name=\'success_title\']").val();
            msgText = form.find("input[name=\'success_message\']").val();
            
            app.showMessage({
            	title: msgTitle,
            	message: msgText
            });
        }
    });
</script>
</head>
<body>
<!-- Google Tag Manager (noscript) -->
<noscript><iframe src="https://www.googletagmanager.com/ns.html?id=GTM-NSD85P7"
height="0" width="0" style="display:none;visibility:hidden"></iframe></noscript>
<!-- End Google Tag Manager (noscript) -->

    <header class="header">

  <div class="container">
    <div class="header__wrapper">
        
      <div class="header__logo">
          <a class="header__logo-img" href="[[!++site_url]]">
              <img src="assets/images/logo.png" alt="Продажа элитной недвижимости в&nbsp;Санкт-Петербурге">
          </a>
        <div class="header__logo-text">Продажа элитной недвижимости в&nbsp;Санкт-Петербурге</div>
      </div>
      
      <div class="header__nav">
          
        <div class="nav">
          <ul>
            <li><a href="#advantages">Преимущества</a></li>
            <li><a href="#services">Услуги</a></li>
            <li><a href="#about">О нас</a></li>
            <li><a href="#working-with-us">Что вы получите</a></li>
            <li><a href="#clients">Отзывы</a></li>
            <li><a href="#contacts">Контакты</a></li>
          </ul>
        </div>
        
        <div class="header__contacts">
            <div class="header-phone"><a href="tel:88126101609">8 (812) 610-16-09</a></div>
            <div class="callback-link-wrapper"><a class="callback-link js-modal" href="javascript:void(0);" data-id="modal-callback"><span class="ct-icon-phone callback-link__icon"></span><span class="callback-link__text">Заказать звонок</span></a></div>
          </div>
      </div>
      
      <div class="header-mobile-buttons">
          <a class="header-mobile-callback" href="tel:88126101609"></a>
          <a class="header-mobile-sandwich hamburger hamburger--squeeze js-menu" href="javascript:void(0);">
              <span class="hamburger-box">
                  <span class="hamburger-inner"></span>
              </span>
          </a>
      </div>
      
    </div>
  </div>
</header>
    
    <div class="banner" style="background-image: url(\'assets/images/banner/banner-bg.jpg\');">
  <div class="section-inner">
    <div class="container">
      <div class="banner__wrapper">
        <div class="banner__content">
          <h1>Хотите продать квартиру премиум-класса выгодно и&nbsp;безопасно?</h1>
          <div class="subtitle">Мы оперативно найдем вам покупателей и возьмем на себя юридическое сопровождение сделки!</div>
          
          
              <div class="banner__btn"><a class="btn js-modal" href="javascript:void(0);" data-id="modal-callback">Получить консультацию</a></div>
          
          
        </div>
        
            <div class="owner">
              <div class="owner__name">Вячеслав Малафеев</div>
              <div class="owner__about">Владелец агентства недвижимости M16 Голкипер ФК «Зенит»</div>
              <div class="owner__zenit-logo"><img src="assets/images/banner/zenit_logo.png" alt="ФК «Зенит»"></div>
            </div>
        
        
      </div>
    </div>
  </div>
  <div class="banner__photo" style="background-image: url(\'assets/images/banner/banner-owner.png\');"></div>
</div>
    <!-- Advantages-->
    <div class="section advantages" id="advantages">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>Почему выбирают нас?</h2>
        <div class="subtitle">Нас выбирают, потому что мы надежные!</div>
      </div>
      <div class="section-content">
        <div class="advantages-container">
          <div class="advantages-list">
              [[!getImageList?
                  &tvname=`advantages_migx`
                  &tpl=`advantagesItem`
              ]]
          </div>
          
          <div class="nav-arrows"><a class="nav-arrow prev" href="javascript:void(0);"></a><a class="nav-arrow next" href="javascript:void(0);"></a></div>
          
        </div>
      </div>
    </div>
  </div>
</div>
    <!-- .Advantages-->
    
    <!-- Services-->
    <div class="section bg-dark services" id="services">
<div class="section-inner">
<div class="container">
  <div class="section-title">
    <h2>Наши услуги</h2>
    <div class="subtitle">Посмотрите, что мы можем вам предложить</div>
  </div>
  <div class="section-content">
    <div class="services-container">
      <div class="services-list">
          [[!getImageList?
              &tvname=`services_migx`
              &tpl=`servicesItem`
          ]]
      </div>
      
      <div class="nav-arrows"><a class="nav-arrow prev" href="javascript:void(0);"></a><a class="nav-arrow next" href="javascript:void(0);"></a></div>
      
    </div>
  </div>
</div>
</div>
</div>
    <!-- .Services-->
    
    <!-- Calc-->
    <div class="section calc">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>Узнайте стоимость вашей квартиры</h2>
        <div class="subtitle">Наши специалисты имеют многолетний опыт работы на рынке недвижимости. Укажите параметры вашей квартиры и мы сделаем вам интересное предложение!</div>
      </div>
      <div class="section-content">
        [[!AjaxForm?
			&form=`calc-form`
			&snippet=`FormIt`
			&hooks=`email`
			&formName=`Запрос стоимости квартиры`
			&emailSubject=`Запрос стоимости квартиры`
			&emailTo=`marketing@m16.bz,gds@m16.bz`
			&emailFrom=`noreply@sell-your-apartment.m16-estate.ru`
			&emailTpl=`calc-email`
			&validate=`phone:required`
			&validationErrorMessage=``
			&vTextRequired=`Данное поле является обязательным для заполнения`
			&successMessage=`Спасибо за заявку!`
		]]
      </div>
    </div>
  </div>
</div>
    <!-- .Calc-->
    
    <!-- About-->
    <div class="section about" id="about">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>О нашей компании</h2>
      </div>
      <div class="section-content">
        <div class="about-container">
          <div class="about-left">
            <div class="people"><img src="assets/images/about/people.jpg" alt="" draggable="false"/>
              <div class="people__bottom">
                <div class="people__title">Вячеслав и Екатерина Малафеевы</div>
                <div class="people__text">Владельцы агентства недвижимости M16</div>
              </div>
            </div>
          </div>
          <div class="about-right">
            <div class="text-editor-content">
              <blockquote>
                <p>Привычка быть лидером помогает мне эффективно управлять командой профессионалов и оправдывать оказанное доверие!</p>
              </blockquote>
              <p>&laquo;М16-Недвижимость&raquo; основана вратарем ФК &laquo;Зенит&raquo; Вячеславом Малафеевым. География работы &mdash; Санкт-Петербург и Ленинградская область.</p>
<p>Отличная ориентация на рынке, безупречный сервис и эксклюзивные услуги, а также постоянное развитие позволяют <br />&laquo;М16-Недвижимость&raquo; быстро и продуктивно решать задачи наших клиентов.</p>
            </div>
            
            [[!getImageList?
                &tvname=`certificates_migx`
                &tpl=`aboutCertificatesItem`
                &wrapperTpl=`aboutCertificates`
            ]]
          </div>
        </div>
      </div>
    </div>
  </div>
</div>
    <!-- .About-->
    
    <!-- Working with us-->
    <div class="section working-with-us bg-dark" id="working-with-us">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>Работая с М16, вы получаете</h2>
      </div>
      <div class="section-content">
        <div class="working-with-us-container"><img class="working-with-us__photo" src="assets/images/work_with_us/owner.jpg" alt="Работая с М16, вы получаете" draggable="false">
          <div class="working-with-us-slider-outer">
            <div class="working-with-us-slider">
              <div class="working-with-us-slide slide1">
                <ul>
                     [[!getImageList?
                         &tvname=`work_list1`
                         &tpl=`workListItem`
                     ]]
                </ul>
              </div>
              <div class="working-with-us-slide slide2">
                <ul>
                  [[!getImageList?
                         &tvname=`work_list2`
                         &tpl=`workListItem`
                     ]]
                </ul>
              </div>
            </div>
            
            <div class="nav-arrows"><a class="nav-arrow prev" href="javascript:void(0);"></a><a class="nav-arrow next" href="javascript:void(0);"></a></div>
            
          </div>
        </div>
      </div>
    </div>
  </div>
</div>
    <!-- .Working with us-->
    
    <!-- Clients-->
    [[!getImageList?
    &tvname=`clients_migx`
    &tpl=`clientCard`
    &wrapperTpl=`clientsOuter`
]]
    <!-- .Clients-->
    
    <!-- Call To Action-->
    <div class="section cta">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>Заказать консультацию</h2>
        <div class="subtitle">Оставьте заявку и наши специалисты проконсультируют вас в течение 15 минут</div>
      </div>
      <div class="section-content">
        [[!AjaxForm?
			&form=`consult-form`
			&snippet=`FormIt`
			&hooks=`email`
			&formName=`Заказ консультации`
			&emailSubject=`Заказ консультации`
			&emailTo=`marketing@m16.bz,gds@m16.bz`
			&emailFrom=`noreply@sell-your-apartment.m16-estate.ru`
			&emailTpl=`consult-email`
			&validate=`phone:required`
			&validationErrorMessage=``
			&vTextRequired=`Данное поле является обязательным для заполнения`
			&successMessage=`Спасибо за заявку!`
		]]
      </div>
    </div>
  </div>
</div>
    <!-- .Call To Action-->
    
    <!-- Contacts-->
    <div class="contacts" id="contacts">
  <div class="container">
    <div class="contacts-box">
      <h2 class="contacts-box__title">Контакты</h2>
      <div class="contacts-box__main">
        <div class="contacts-box__group">
          <div class="contacts-box__group-title">Телефон</div>
          <div class="contacts-box__group-content">
            <div class="contacts-box__icon ct-icon-phone"></div>
            <div class="ct-phone"><a href="tel:88126101609">8 (812) 610-16-09</a></div>
            <div class="contacts-box__btn"><a class="btn js-modal" href="javascript:void(0);" data-id="modal-callback">Заказать <span class="mobile-hidden">обратный </span>звонок</a></div>
          </div>
        </div>
        <div class="contacts-box__group">
          <div class="contacts-box__group-title">E-mail</div>
          <div class="contacts-box__group-content">
            <div class="contacts-box__icon ct-icon-email"></div>
            <div class="ct-email"><a href="mailto:mail@m16.bz">mail@m16.bz</a></div>
          </div>
        </div>
        <div class="contacts-box__group">
          <div class="contacts-box__group-title">Адрес</div>
          <div class="contacts-box__group-content">
            <div class="contacts-box__icon ct-icon-address"></div>Санкт-Петербург, Большая Зеленина, д.18
            <div class="address-link"><a href="javascript:void(0);" class="js-modal" data-id="modal-how-to-find">Как добраться?</a></div>
          </div>
        </div>
        <div class="contacts-box__group">
          <div class="contacts-box__group-title">Режим работы</div>
          <div class="contacts-box__group-content">
            <div class="contacts-box__icon ct-icon-clock"></div>10:00 - 20:00 (ежедневно)
          </div>
        </div>
        [[!social]]
      </div>
    </div>
  </div>
  <div class="map" id="map"></div>
</div>

<script src="https://api-maps.yandex.ru/2.1/?lang=ru_RU" type="text/javascript"></script>
<script>
	ymaps.ready(function() {
		var coords = \'59.962528, 30.288159\';
		if (coords != \'\') {
		    coords = coords.replace(/\\s/gi,\'\');
		    coords = coords.split(\',\');
		    if (!coords.length) {
		        return false;
		    }
		}

		var myMap = new ymaps.Map(\'map\', {
			center: coords,
			zoom: 16,
			controls: [] //\'zoomControl\'
		}, {
			//searchControlProvider: \'yandex#search\'
		});
		placemarkOffice = new ymaps.Placemark(coords, {
			hintContent: \'Офис компании\',
			balloonContent: \'Офис: г. Санкт-Петербург, Большая Зеленина, д.18\',
		}, {
			iconLayout: \'default#image\',
            // Своё изображение иконки метки.
            iconImageHref: \'assets/img/marker.png\',
            // Размеры метки.
            iconImageSize: [50, 74],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-25, -74]
		});

		// Offset
		var position = myMap.getGlobalPixelCenter();
		var map_elem = document.getElementById(\'map\');
		var viewport_width = map_elem.clientWidth;
		var map_height = map_elem.clientHeight;

		// vw >= 1200
		var map_offset_x = -348;
		var map_offset_y = 0;

		// vw < 1200
		if (viewport_width < 1200) {
			map_offset_x = 0;
			map_offset_y = Math.ceil(map_height * 0.33) * -1;
		}

		myMap.setGlobalPixelCenter([ position[0] + map_offset_x , position[1] + map_offset_y ]);
	  
		myMap.geoObjects.add(placemarkOffice);
		myMap.behaviors.disable(\'scrollZoom\');
	});
</script>
    <!-- .Contacts-->
    
    <footer class="footer">
  <div class="container">
    <div class="footer__wrapper">
      <div class="footer__copyright">&copy; [[!year]]. Все права защищены.</div>
      <div class="footer__dev"></div>
    </div>
  </div>
<div class="cookie-attention" id="cookie-attention-widget" style="display: none;">
	<div class="cookie-attention-holder">
		<div class="cookie-attention-content cont-w" style="background: #000;border-top: 3px solid #b59974;">
			<div class="cookie-attention-wrapper">
				<div class="cookie-attention-body" style="display: flex;flex-direction: column;">
					<div class="cookie-attention-text">
						<div class="cookie-attention-text" style="color: #fff;width:auto;">
						Сайт <strong>m16-estate.ru</strong> использует файлы «cookie» и системы аналитики для персонализации сервисов и повышения удобства пользования веб-сайтом. Продолжая просмотр сайта, вы разрешаете их использование. С подробной информации о сборе персональных данных можно ознакомится <a href="https://m16-group.ru/privacy_policy">тут</a>.</div>
					</div>
					<div class="cookie-attention-ui" onclick="set_cookie(\'privacy_confirm\', \'1\', 2020, 12, 30); $(\'#cookie-attention-widget\').css(\'display\',\'none\');">
						<input class="cookie-attention-choice __positive js-cookie-attention-choice" id="cookie-attention-positive" type="radio" value="positive">
						<label class="cookie-attention-presence" for="cookie-attention-positive" style="
						padding: 10px 20px;
						">Согласен</label>
					</div>
				</div>
			</div>
		</div>
	</div>
</div>
</footer>
    
    <div class="modals-wrap" style="display:none;">
  <div class="modal" id="modal-callback">
    <div class="modal__wrapper">
      <div class="modal__heading">Заказать обратный звонок .</div>
      <div class="modal__content">
        <div class="modal__text">Отправьте заявку, и наш менеджер свяжется с Вами в течение ближайших 15 минут рабочего времени.</div>
        
        [[!AjaxForm?
			&form=`callback-form`
			&snippet=`FormIt`
			&hooks=`email`
			&formName=`Заказ обратного звонка`
			&emailSubject=`Заказ звонка`
			&emailTo=`marketing@m16.bz,gds@m16.bz`
			&emailFrom=`noreply@sell-your-apartment.m16-estate.ru`
			&emailTpl=`callback-email`
			&validate=`phone:required`
			&validationErrorMessage=``
			&vTextRequired=`Данное поле является обязательным для заполнения`
			&successMessage=`Спасибо за звонок!`
		]]
        
      </div>
    </div>
  </div>
  <div class="modal modal--message" id="modal-message">
    <div class="modal__wrapper">
      <div class="modal__heading">Спасибо за звонок!</div>
      <div class="modal__content">
        <div class="modal__text">Мы перезвоним вам в ближайшее время, пожалуйста ожидайте.</div>
      </div>
    </div>
  </div>
  
  <div class="modal modal--message" id="modal-how-to-find">
    <div class="modal__wrapper">
      <div class="modal__heading">Как доехать к нам</div>
      <div class="modal__content">
        <div class="modal__text"><p>3 минуты ходьбы от станции метро Чкаловская до Большой Зелениной, дом 18. Вход находится рядом с магазином цветов.<img src="3d83da2daf.jpg" alt="" width="855" height="726" /></p></div>
      </div>
    </div>
  </div>
  
</div>
    <!-- Facebook Pixel Code -->
<script>
  !function(f,b,e,v,n,t,s)
  {if(f.fbq)return;n=f.fbq=function(){n.callMethod?
  n.callMethod.apply(n,arguments):n.queue.push(arguments)};
  if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version=\'2.0\';
  n.queue=[];t=b.createElement(e);t.async=!0;
  t.src=v;s=b.getElementsByTagName(e)[0];
  s.parentNode.insertBefore(t,s)}(window, document,\'script\',
  \'https://connect.facebook.net/en_US/fbevents.js\');
  fbq(\'init\', \'675487852858861\');
  fbq(\'track\', \'PageView\');
</script>
<noscript><img height="1" width="1" style="display:none"
  src="https://www.facebook.com/tr?id=675487852858861&ev=PageView&noscript=1"
/></noscript>
<script>
$(document).on(\'af_complete\', function(event, response) {
    var form = response.form;
    fbq(\'track\', \'Lead\');

});
</script>
</body>
</html>
',
    '_isForward' => false,
  ),
  'contentType' => 
  array (
    'id' => 1,
    'name' => 'HTML',
    'description' => 'HTML content',
    'mime_type' => 'text/html',
    'file_extensions' => '.html',
    'headers' => NULL,
    'binary' => 0,
  ),
  'policyCache' => 
  array (
  ),
  'elementCache' => 
  array (
    '[[*longtitle]]' => 'Агентство элитной недвижимости М16',
    '[[*description]]' => 'Текст для тега <meta name=description>',
    '[[$head]]' => '<base href="[[!++site_url]]" />
<meta charset="utf-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge"/>
<meta name="viewport" content="width=device-width, initial-scale=1"/>


<!-- disable safari phone number detection-->
<meta name="format-detection" content="telephone=no"/>
<title>Агентство элитной недвижимости М16</title>
<meta name="description" content="Текст для тега <meta name=description>">
    
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="icon" href="/favicon.ico" type="image/x-icon">
    
<link href="https://fonts.googleapis.com/css2?family=Roboto:ital,wght@0,300;0,500;0,700;1,500&amp;display=swap" rel="stylesheet"/>
<link href="assets/css/style.css?v=[[!timestamp]]" rel="stylesheet"/>
<style>
    @media screen and (min-width: 768px) {
        .working-with-us-slide ul li {
            margin-top: 32px;
        }
        
        .working-with-us-slide ul li:first-child {
            margin-top: 0;
        }
    }
</style>
<script src="assets/js/libs/jquery.min.js"></script>
<script src="assets/js/libs/jquery.scrollTo.min.js"></script>
<script src="assets/js/libs/jquery.fancybox.min.js"></script>
<script src="assets/js/libs/slick.min.js"></script>
<script src="assets/js/libs/jquery.maskedinput.min.js"></script>
<script src="assets/js/libs/ion.rangeSlider.min.js"></script>
<script src="assets/js/app.js?v=[[!timestamp]]"></script>

<script>
			function get_cookie(cookie_name) {
				let results = document.cookie.match(\'(^|;) ?\' + cookie_name + \'=([^;]*)(;|$)\');
				if (results) return (unescape(results[2]));
				else
					return null;
				}
			setTimeout(function() {
				if (get_cookie(\'privacy_confirm\') != 1) {
					$(\'#cookie-attention-widget\').css(\'display\', \'block\');
					}
				}, 4000);
			function set_cookie(name, value, exp_y, exp_m, exp_d, path, domain, secure) {
				let cookie_string = name + "=" + escape(value);
				if (exp_y) {
					let expires = new Date(exp_y, exp_m, exp_d);
					cookie_string += "; expires=" + expires.toGMTString();
					}
				if (path) cookie_string += "; path=" + escape(path);
				if (domain) cookie_string += "; domain=" + escape(domain);
				if (secure) cookie_string += "; secure";
				document.cookie = cookie_string;
				}
		</script>

<style type="text/css">
.cookie-attention-choice ~ .cookie-attention-presence{
	display: inline-block;
	vertical-align: top;
	margin-right: 16px;
	padding: 6px 6px;
	min-width: 100px;
	text-align: center;
	color: #fff;
	font-weight: bold;
	cursor: pointer;
}
.cookie-attention-choice.__positive ~ .cookie-attention-presence{
	background: #b59974;
}
.cookie-attention-choice{
	position: absolute;
    clip: rect(0,0,0,0);
}
.cookie-attention-wrapper{
	margin: 0 auto;
	padding: 15px 15px 20px 15px;
	max-width: 800px;
	font-family: "Arial", sans-serif;
}
.cookie-attention-text{
	width: auto;
	margin-bottom: 8px;
	line-height: 1.2;
}
.cookie-attention {
    position: fixed;
    z-index: 6;
    width: 100vw;
    bottom: 0;
}
</style>

<script>
$(document).on(\'submit\', \'.ajax_form\', function() {
    var form = $(this);

    // Результатом работы будет выставление глобальной переменной
    //afValidated = false; // Или true, если валидация пройдена
    
    // Check phone mask
    afValidated = true;
    
    var phone_value = form.find(\'.phone-mask\').val();
    if (phone_value == \'+7 (___) ___-__-__\') {
    	afValidated = false;
    }
});
</script>

<script>
    $(document).on(\'af_complete\', function(event, response) {
        var form = response.form;
        var msgTitle, msgText;
        
        if (response.success) {
            msgTitle = form.find("input[name=\'success_title\']").val();
            msgText = form.find("input[name=\'success_message\']").val();
            
            app.showMessage({
            	title: msgTitle,
            	message: msgText
            });
        }
    });
</script>',
    '[[*header_logo]]' => 'assets/images/logo.png',
    '[[*header_text]]' => 'Продажа элитной недвижимости в&nbsp;Санкт-Петербурге',
    '[[*contact_phone:phoneHref]]' => '88126101609',
    '[[*contact_phone]]' => '8 (812) 610-16-09',
    '[[$header]]' => '<header class="header">

  <div class="container">
    <div class="header__wrapper">
        
      <div class="header__logo">
          <a class="header__logo-img" href="[[!++site_url]]">
              <img src="assets/images/logo.png" alt="Продажа элитной недвижимости в&nbsp;Санкт-Петербурге">
          </a>
        <div class="header__logo-text">Продажа элитной недвижимости в&nbsp;Санкт-Петербурге</div>
      </div>
      
      <div class="header__nav">
          
        <div class="nav">
          <ul>
            <li><a href="#advantages">Преимущества</a></li>
            <li><a href="#services">Услуги</a></li>
            <li><a href="#about">О нас</a></li>
            <li><a href="#working-with-us">Что вы получите</a></li>
            <li><a href="#clients">Отзывы</a></li>
            <li><a href="#contacts">Контакты</a></li>
          </ul>
        </div>
        
        <div class="header__contacts">
            <div class="header-phone"><a href="tel:88126101609">8 (812) 610-16-09</a></div>
            <div class="callback-link-wrapper"><a class="callback-link js-modal" href="javascript:void(0);" data-id="modal-callback"><span class="ct-icon-phone callback-link__icon"></span><span class="callback-link__text">Заказать звонок</span></a></div>
          </div>
      </div>
      
      <div class="header-mobile-buttons">
          <a class="header-mobile-callback" href="tel:88126101609"></a>
          <a class="header-mobile-sandwich hamburger hamburger--squeeze js-menu" href="javascript:void(0);">
              <span class="hamburger-box">
                  <span class="hamburger-inner"></span>
              </span>
          </a>
      </div>
      
    </div>
  </div>
</header>',
    '[[*banner_bg]]' => 'assets/images/banner/banner-bg.jpg',
    '[[*banner_title]]' => 'Хотите продать квартиру премиум-класса выгодно и&nbsp;безопасно?',
    '[[*banner_text:nl2br]]' => 'Мы оперативно найдем вам покупателей и возьмем на себя юридическое сопровождение сделки!',
    '[[*banner_btn_text:default=`Получить консультацию`]]' => 'Получить консультацию',
    '[[*banner_btn_enabled:is=`1`:then=`
              <div class="banner__btn"><a class="btn js-modal" href="javascript:void(0);" data-id="modal-callback">Получить консультацию</a></div>
          `]]' => '
              <div class="banner__btn"><a class="btn js-modal" href="javascript:void(0);" data-id="modal-callback">Получить консультацию</a></div>
          ',
    '[[*owner_name]]' => 'Вячеслав Малафеев',
    '[[*owner_descr]]' => 'Владелец агентства недвижимости M16 Голкипер ФК «Зенит»',
    '[[*owner_logo]]' => 'assets/images/banner/zenit_logo.png',
    '[[*owner_name:is=``:then=``:else=`
            <div class="owner">
              <div class="owner__name">Вячеслав Малафеев</div>
              <div class="owner__about">Владелец агентства недвижимости M16 Голкипер ФК «Зенит»</div>
              <div class="owner__zenit-logo"><img src="assets/images/banner/zenit_logo.png" alt="ФК «Зенит»"></div>
            </div>
        `]]' => '
            <div class="owner">
              <div class="owner__name">Вячеслав Малафеев</div>
              <div class="owner__about">Владелец агентства недвижимости M16 Голкипер ФК «Зенит»</div>
              <div class="owner__zenit-logo"><img src="assets/images/banner/zenit_logo.png" alt="ФК «Зенит»"></div>
            </div>
        ',
    '[[*banner_photo]]' => 'assets/images/banner/banner-owner.png',
    '[[$banner]]' => '<div class="banner" style="background-image: url(\'assets/images/banner/banner-bg.jpg\');">
  <div class="section-inner">
    <div class="container">
      <div class="banner__wrapper">
        <div class="banner__content">
          <h1>Хотите продать квартиру премиум-класса выгодно и&nbsp;безопасно?</h1>
          <div class="subtitle">Мы оперативно найдем вам покупателей и возьмем на себя юридическое сопровождение сделки!</div>
          
          
              <div class="banner__btn"><a class="btn js-modal" href="javascript:void(0);" data-id="modal-callback">Получить консультацию</a></div>
          
          
        </div>
        
            <div class="owner">
              <div class="owner__name">Вячеслав Малафеев</div>
              <div class="owner__about">Владелец агентства недвижимости M16 Голкипер ФК «Зенит»</div>
              <div class="owner__zenit-logo"><img src="assets/images/banner/zenit_logo.png" alt="ФК «Зенит»"></div>
            </div>
        
        
      </div>
    </div>
  </div>
  <div class="banner__photo" style="background-image: url(\'assets/images/banner/banner-owner.png\');"></div>
</div>',
    '[[*advantages_title]]' => 'Почему выбирают нас?',
    '[[*advantages_text:nl2br]]' => 'Нас выбирают, потому что мы надежные!',
    '[[$advantages]]' => '<div class="section advantages" id="advantages">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>Почему выбирают нас?</h2>
        <div class="subtitle">Нас выбирают, потому что мы надежные!</div>
      </div>
      <div class="section-content">
        <div class="advantages-container">
          <div class="advantages-list">
              [[!getImageList?
                  &tvname=`advantages_migx`
                  &tpl=`advantagesItem`
              ]]
          </div>
          
          <div class="nav-arrows"><a class="nav-arrow prev" href="javascript:void(0);"></a><a class="nav-arrow next" href="javascript:void(0);"></a></div>
          
        </div>
      </div>
    </div>
  </div>
</div>',
    '[[*services_title]]' => 'Наши услуги',
    '[[*services_descr:nl2br]]' => 'Посмотрите, что мы можем вам предложить',
    '[[$services]]' => '<div class="section bg-dark services" id="services">
<div class="section-inner">
<div class="container">
  <div class="section-title">
    <h2>Наши услуги</h2>
    <div class="subtitle">Посмотрите, что мы можем вам предложить</div>
  </div>
  <div class="section-content">
    <div class="services-container">
      <div class="services-list">
          [[!getImageList?
              &tvname=`services_migx`
              &tpl=`servicesItem`
          ]]
      </div>
      
      <div class="nav-arrows"><a class="nav-arrow prev" href="javascript:void(0);"></a><a class="nav-arrow next" href="javascript:void(0);"></a></div>
      
    </div>
  </div>
</div>
</div>
</div>',
    '[[*calc_title]]' => 'Узнайте стоимость вашей квартиры',
    '[[*calc_descr:nl2br]]' => 'Наши специалисты имеют многолетний опыт работы на рынке недвижимости. Укажите параметры вашей квартиры и мы сделаем вам интересное предложение!',
    '[[$calc]]' => '<div class="section calc">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>Узнайте стоимость вашей квартиры</h2>
        <div class="subtitle">Наши специалисты имеют многолетний опыт работы на рынке недвижимости. Укажите параметры вашей квартиры и мы сделаем вам интересное предложение!</div>
      </div>
      <div class="section-content">
        [[!AjaxForm?
			&form=`calc-form`
			&snippet=`FormIt`
			&hooks=`email`
			&formName=`Запрос стоимости квартиры`
			&emailSubject=`Запрос стоимости квартиры`
			&emailTo=`marketing@m16.bz,gds@m16.bz`
			&emailFrom=`noreply@sell-your-apartment.m16-estate.ru`
			&emailTpl=`calc-email`
			&validate=`phone:required`
			&validationErrorMessage=``
			&vTextRequired=`Данное поле является обязательным для заполнения`
			&successMessage=`Спасибо за заявку!`
		]]
      </div>
    </div>
  </div>
</div>',
    '[[*about_title]]' => 'О нашей компании',
    '[[*about_photo]]' => 'assets/images/about/people.jpg',
    '[[*about_photo_title]]' => 'Вячеслав и Екатерина Малафеевы',
    '[[*about_photo_descr]]' => 'Владельцы агентства недвижимости M16',
    '[[*about_quotation]]' => '<p>Привычка быть лидером помогает мне эффективно управлять командой профессионалов и оправдывать оказанное доверие!</p>',
    '[[*about_text]]' => '<p>&laquo;М16-Недвижимость&raquo; основана вратарем ФК &laquo;Зенит&raquo; Вячеславом Малафеевым. География работы &mdash; Санкт-Петербург и Ленинградская область.</p>
<p>Отличная ориентация на рынке, безупречный сервис и эксклюзивные услуги, а также постоянное развитие позволяют <br />&laquo;М16-Недвижимость&raquo; быстро и продуктивно решать задачи наших клиентов.</p>',
    '[[$about]]' => '<div class="section about" id="about">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>О нашей компании</h2>
      </div>
      <div class="section-content">
        <div class="about-container">
          <div class="about-left">
            <div class="people"><img src="assets/images/about/people.jpg" alt="" draggable="false"/>
              <div class="people__bottom">
                <div class="people__title">Вячеслав и Екатерина Малафеевы</div>
                <div class="people__text">Владельцы агентства недвижимости M16</div>
              </div>
            </div>
          </div>
          <div class="about-right">
            <div class="text-editor-content">
              <blockquote>
                <p>Привычка быть лидером помогает мне эффективно управлять командой профессионалов и оправдывать оказанное доверие!</p>
              </blockquote>
              <p>&laquo;М16-Недвижимость&raquo; основана вратарем ФК &laquo;Зенит&raquo; Вячеславом Малафеевым. География работы &mdash; Санкт-Петербург и Ленинградская область.</p>
<p>Отличная ориентация на рынке, безупречный сервис и эксклюзивные услуги, а также постоянное развитие позволяют <br />&laquo;М16-Недвижимость&raquo; быстро и продуктивно решать задачи наших клиентов.</p>
            </div>
            
            [[!getImageList?
                &tvname=`certificates_migx`
                &tpl=`aboutCertificatesItem`
                &wrapperTpl=`aboutCertificates`
            ]]
          </div>
        </div>
      </div>
    </div>
  </div>
</div>',
    '[[*work_title]]' => 'Работая с М16, вы получаете',
    '[[*work_photo]]' => 'assets/images/work_with_us/owner.jpg',
    '[[$working_with_us]]' => '<div class="section working-with-us bg-dark" id="working-with-us">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>Работая с М16, вы получаете</h2>
      </div>
      <div class="section-content">
        <div class="working-with-us-container"><img class="working-with-us__photo" src="assets/images/work_with_us/owner.jpg" alt="Работая с М16, вы получаете" draggable="false">
          <div class="working-with-us-slider-outer">
            <div class="working-with-us-slider">
              <div class="working-with-us-slide slide1">
                <ul>
                     [[!getImageList?
                         &tvname=`work_list1`
                         &tpl=`workListItem`
                     ]]
                </ul>
              </div>
              <div class="working-with-us-slide slide2">
                <ul>
                  [[!getImageList?
                         &tvname=`work_list2`
                         &tpl=`workListItem`
                     ]]
                </ul>
              </div>
            </div>
            
            <div class="nav-arrows"><a class="nav-arrow prev" href="javascript:void(0);"></a><a class="nav-arrow next" href="javascript:void(0);"></a></div>
            
          </div>
        </div>
      </div>
    </div>
  </div>
</div>',
    '[[$clients]]' => '[[!getImageList?
    &tvname=`clients_migx`
    &tpl=`clientCard`
    &wrapperTpl=`clientsOuter`
]]',
    '[[*consult_title]]' => 'Заказать консультацию',
    '[[*consult_descr]]' => 'Оставьте заявку и наши специалисты проконсультируют вас в течение 15 минут',
    '[[$cta]]' => '<div class="section cta">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>Заказать консультацию</h2>
        <div class="subtitle">Оставьте заявку и наши специалисты проконсультируют вас в течение 15 минут</div>
      </div>
      <div class="section-content">
        [[!AjaxForm?
			&form=`consult-form`
			&snippet=`FormIt`
			&hooks=`email`
			&formName=`Заказ консультации`
			&emailSubject=`Заказ консультации`
			&emailTo=`marketing@m16.bz,gds@m16.bz`
			&emailFrom=`noreply@sell-your-apartment.m16-estate.ru`
			&emailTpl=`consult-email`
			&validate=`phone:required`
			&validationErrorMessage=``
			&vTextRequired=`Данное поле является обязательным для заполнения`
			&successMessage=`Спасибо за заявку!`
		]]
      </div>
    </div>
  </div>
</div>',
    '[[*contact_title]]' => 'Контакты',
    '[[*contact_email]]' => 'mail@m16.bz',
    '[[*contact_address]]' => 'Санкт-Петербург, Большая Зеленина, д.18',
    '[[*contact_work_hours]]' => '10:00 - 20:00 (ежедневно)',
    '[[*contact_map_coords:default=``]]' => '59.962528, 30.288159',
    '[[*contact_map_balloon_text]]' => 'Офис: г. Санкт-Петербург, Большая Зеленина, д.18',
    '[[$contacts]]' => '<div class="contacts" id="contacts">
  <div class="container">
    <div class="contacts-box">
      <h2 class="contacts-box__title">Контакты</h2>
      <div class="contacts-box__main">
        <div class="contacts-box__group">
          <div class="contacts-box__group-title">Телефон</div>
          <div class="contacts-box__group-content">
            <div class="contacts-box__icon ct-icon-phone"></div>
            <div class="ct-phone"><a href="tel:88126101609">8 (812) 610-16-09</a></div>
            <div class="contacts-box__btn"><a class="btn js-modal" href="javascript:void(0);" data-id="modal-callback">Заказать <span class="mobile-hidden">обратный </span>звонок</a></div>
          </div>
        </div>
        <div class="contacts-box__group">
          <div class="contacts-box__group-title">E-mail</div>
          <div class="contacts-box__group-content">
            <div class="contacts-box__icon ct-icon-email"></div>
            <div class="ct-email"><a href="mailto:mail@m16.bz">mail@m16.bz</a></div>
          </div>
        </div>
        <div class="contacts-box__group">
          <div class="contacts-box__group-title">Адрес</div>
          <div class="contacts-box__group-content">
            <div class="contacts-box__icon ct-icon-address"></div>Санкт-Петербург, Большая Зеленина, д.18
            <div class="address-link"><a href="javascript:void(0);" class="js-modal" data-id="modal-how-to-find">Как добраться?</a></div>
          </div>
        </div>
        <div class="contacts-box__group">
          <div class="contacts-box__group-title">Режим работы</div>
          <div class="contacts-box__group-content">
            <div class="contacts-box__icon ct-icon-clock"></div>10:00 - 20:00 (ежедневно)
          </div>
        </div>
        [[!social]]
      </div>
    </div>
  </div>
  <div class="map" id="map"></div>
</div>

<script src="https://api-maps.yandex.ru/2.1/?lang=ru_RU" type="text/javascript"></script>
<script>
	ymaps.ready(function() {
		var coords = \'59.962528, 30.288159\';
		if (coords != \'\') {
		    coords = coords.replace(/\\s/gi,\'\');
		    coords = coords.split(\',\');
		    if (!coords.length) {
		        return false;
		    }
		}

		var myMap = new ymaps.Map(\'map\', {
			center: coords,
			zoom: 16,
			controls: [] //\'zoomControl\'
		}, {
			//searchControlProvider: \'yandex#search\'
		});
		placemarkOffice = new ymaps.Placemark(coords, {
			hintContent: \'Офис компании\',
			balloonContent: \'Офис: г. Санкт-Петербург, Большая Зеленина, д.18\',
		}, {
			iconLayout: \'default#image\',
            // Своё изображение иконки метки.
            iconImageHref: \'assets/img/marker.png\',
            // Размеры метки.
            iconImageSize: [50, 74],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-25, -74]
		});

		// Offset
		var position = myMap.getGlobalPixelCenter();
		var map_elem = document.getElementById(\'map\');
		var viewport_width = map_elem.clientWidth;
		var map_height = map_elem.clientHeight;

		// vw >= 1200
		var map_offset_x = -348;
		var map_offset_y = 0;

		// vw < 1200
		if (viewport_width < 1200) {
			map_offset_x = 0;
			map_offset_y = Math.ceil(map_height * 0.33) * -1;
		}

		myMap.setGlobalPixelCenter([ position[0] + map_offset_x , position[1] + map_offset_y ]);
	  
		myMap.geoObjects.add(placemarkOffice);
		myMap.behaviors.disable(\'scrollZoom\');
	});
</script>',
    '[[*footer_copyright]]' => '&copy; [[!year]]. Все права защищены.',
    '[[*footer_dev]]' => '',
    '[[$footer]]' => '<footer class="footer">
  <div class="container">
    <div class="footer__wrapper">
      <div class="footer__copyright">&copy; [[!year]]. Все права защищены.</div>
      <div class="footer__dev"></div>
    </div>
  </div>
<div class="cookie-attention" id="cookie-attention-widget" style="display: none;">
	<div class="cookie-attention-holder">
		<div class="cookie-attention-content cont-w" style="background: #000;border-top: 3px solid #b59974;">
			<div class="cookie-attention-wrapper">
				<div class="cookie-attention-body" style="display: flex;flex-direction: column;">
					<div class="cookie-attention-text">
						<div class="cookie-attention-text" style="color: #fff;width:auto;">
						Сайт <strong>m16-estate.ru</strong> использует файлы «cookie» и системы аналитики для персонализации сервисов и повышения удобства пользования веб-сайтом. Продолжая просмотр сайта, вы разрешаете их использование. С подробной информации о сборе персональных данных можно ознакомится <a href="https://m16-group.ru/privacy_policy">тут</a>.</div>
					</div>
					<div class="cookie-attention-ui" onclick="set_cookie(\'privacy_confirm\', \'1\', 2020, 12, 30); $(\'#cookie-attention-widget\').css(\'display\',\'none\');">
						<input class="cookie-attention-choice __positive js-cookie-attention-choice" id="cookie-attention-positive" type="radio" value="positive">
						<label class="cookie-attention-presence" for="cookie-attention-positive" style="
						padding: 10px 20px;
						">Согласен</label>
					</div>
				</div>
			</div>
		</div>
	</div>
</div>
</footer>',
    '[[*contact_how_to_title]]' => 'Как доехать к нам',
    '[[*contact_how_to_text]]' => '<p>3 минуты ходьбы от станции метро Чкаловская до Большой Зелениной, дом 18. Вход находится рядом с магазином цветов.<img src="3d83da2daf.jpg" alt="" width="855" height="726" /></p>',
    '[[$modals]]' => '<div class="modals-wrap" style="display:none;">
  <div class="modal" id="modal-callback">
    <div class="modal__wrapper">
      <div class="modal__heading">Заказать обратный звонок .</div>
      <div class="modal__content">
        <div class="modal__text">Отправьте заявку, и наш менеджер свяжется с Вами в течение ближайших 15 минут рабочего времени.</div>
        
        [[!AjaxForm?
			&form=`callback-form`
			&snippet=`FormIt`
			&hooks=`email`
			&formName=`Заказ обратного звонка`
			&emailSubject=`Заказ звонка`
			&emailTo=`marketing@m16.bz,gds@m16.bz`
			&emailFrom=`noreply@sell-your-apartment.m16-estate.ru`
			&emailTpl=`callback-email`
			&validate=`phone:required`
			&validationErrorMessage=``
			&vTextRequired=`Данное поле является обязательным для заполнения`
			&successMessage=`Спасибо за звонок!`
		]]
        
      </div>
    </div>
  </div>
  <div class="modal modal--message" id="modal-message">
    <div class="modal__wrapper">
      <div class="modal__heading">Спасибо за звонок!</div>
      <div class="modal__content">
        <div class="modal__text">Мы перезвоним вам в ближайшее время, пожалуйста ожидайте.</div>
      </div>
    </div>
  </div>
  
  <div class="modal modal--message" id="modal-how-to-find">
    <div class="modal__wrapper">
      <div class="modal__heading">Как доехать к нам</div>
      <div class="modal__content">
        <div class="modal__text"><p>3 минуты ходьбы от станции метро Чкаловская до Большой Зелениной, дом 18. Вход находится рядом с магазином цветов.<img src="3d83da2daf.jpg" alt="" width="855" height="726" /></p></div>
      </div>
    </div>
  </div>
  
</div>',
    '[[*calc_btn_text:default=`Оставить заявку`]]' => 'Оставить заявку',
    '[[*clients_title]]' => 'Наши клиенты',
    '[[*clients_btn_text]]' => 'Стать клиентом м16',
    '[[*clients_btn_enabled:is=`1`:then=`
            <div class="clients-btn"><a class="btn js-modal" href="javascript:void(0);" data-id="modal-callback">Стать клиентом м16</a></div>
        `]]' => '
            <div class="clients-btn"><a class="btn js-modal" href="javascript:void(0);" data-id="modal-callback">Стать клиентом м16</a></div>
        ',
    '[[*consult_btn_text]]' => 'Получить консультацию',
    '[[*policy_pdf]]' => 'assets/images/Политика конфиденциальности.pdf',
  ),
  'sourceCache' => 
  array (
    'modChunk' => 
    array (
      'head' => 
      array (
        'fields' => 
        array (
          'id' => 1,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'head',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '<base href="[[!++site_url]]" />
<meta charset="utf-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge"/>
<meta name="viewport" content="width=device-width, initial-scale=1"/>
[[-<meta name="viewport" content="width=1600"/>]]

<!-- disable safari phone number detection-->
<meta name="format-detection" content="telephone=no"/>
<title>[[*longtitle]]</title>
<meta name="description" content="[[*description]]">
    
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="icon" href="/favicon.ico" type="image/x-icon">
    
<link href="https://fonts.googleapis.com/css2?family=Roboto:ital,wght@0,300;0,500;0,700;1,500&amp;display=swap" rel="stylesheet"/>
<link href="assets/css/style.css?v=[[!timestamp]]" rel="stylesheet"/>
<style>
    @media screen and (min-width: 768px) {
        .working-with-us-slide ul li {
            margin-top: 32px;
        }
        
        .working-with-us-slide ul li:first-child {
            margin-top: 0;
        }
    }
</style>
<script src="assets/js/libs/jquery.min.js"></script>
<script src="assets/js/libs/jquery.scrollTo.min.js"></script>
<script src="assets/js/libs/jquery.fancybox.min.js"></script>
<script src="assets/js/libs/slick.min.js"></script>
<script src="assets/js/libs/jquery.maskedinput.min.js"></script>
<script src="assets/js/libs/ion.rangeSlider.min.js"></script>
<script src="assets/js/app.js?v=[[!timestamp]]"></script>

<script>
			function get_cookie(cookie_name) {
				let results = document.cookie.match(\'(^|;) ?\' + cookie_name + \'=([^;]*)(;|$)\');
				if (results) return (unescape(results[2]));
				else
					return null;
				}
			setTimeout(function() {
				if (get_cookie(\'privacy_confirm\') != 1) {
					$(\'#cookie-attention-widget\').css(\'display\', \'block\');
					}
				}, 4000);
			function set_cookie(name, value, exp_y, exp_m, exp_d, path, domain, secure) {
				let cookie_string = name + "=" + escape(value);
				if (exp_y) {
					let expires = new Date(exp_y, exp_m, exp_d);
					cookie_string += "; expires=" + expires.toGMTString();
					}
				if (path) cookie_string += "; path=" + escape(path);
				if (domain) cookie_string += "; domain=" + escape(domain);
				if (secure) cookie_string += "; secure";
				document.cookie = cookie_string;
				}
		</script>

<style type="text/css">
.cookie-attention-choice ~ .cookie-attention-presence{
	display: inline-block;
	vertical-align: top;
	margin-right: 16px;
	padding: 6px 6px;
	min-width: 100px;
	text-align: center;
	color: #fff;
	font-weight: bold;
	cursor: pointer;
}
.cookie-attention-choice.__positive ~ .cookie-attention-presence{
	background: #b59974;
}
.cookie-attention-choice{
	position: absolute;
    clip: rect(0,0,0,0);
}
.cookie-attention-wrapper{
	margin: 0 auto;
	padding: 15px 15px 20px 15px;
	max-width: 800px;
	font-family: "Arial", sans-serif;
}
.cookie-attention-text{
	width: auto;
	margin-bottom: 8px;
	line-height: 1.2;
}
.cookie-attention {
    position: fixed;
    z-index: 6;
    width: 100vw;
    bottom: 0;
}
</style>

<script>
$(document).on(\'submit\', \'.ajax_form\', function() {
    var form = $(this);

    // Результатом работы будет выставление глобальной переменной
    //afValidated = false; // Или true, если валидация пройдена
    
    // Check phone mask
    afValidated = true;
    
    var phone_value = form.find(\'.phone-mask\').val();
    if (phone_value == \'+7 (___) ___-__-__\') {
    	afValidated = false;
    }
});
</script>

<script>
    $(document).on(\'af_complete\', function(event, response) {
        var form = response.form;
        var msgTitle, msgText;
        
        if (response.success) {
            msgTitle = form.find("input[name=\'success_title\']").val();
            msgText = form.find("input[name=\'success_message\']").val();
            
            app.showMessage({
            	title: msgTitle,
            	message: msgText
            });
        }
    });
</script>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<base href="[[!++site_url]]" />
<meta charset="utf-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge"/>
<meta name="viewport" content="width=device-width, initial-scale=1"/>
[[-<meta name="viewport" content="width=1600"/>]]

<!-- disable safari phone number detection-->
<meta name="format-detection" content="telephone=no"/>
<title>[[*longtitle]]</title>
<meta name="description" content="[[*description]]">
    
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="icon" href="/favicon.ico" type="image/x-icon">
    
<link href="https://fonts.googleapis.com/css2?family=Roboto:ital,wght@0,300;0,500;0,700;1,500&amp;display=swap" rel="stylesheet"/>
<link href="assets/css/style.css?v=[[!timestamp]]" rel="stylesheet"/>
<style>
    @media screen and (min-width: 768px) {
        .working-with-us-slide ul li {
            margin-top: 32px;
        }
        
        .working-with-us-slide ul li:first-child {
            margin-top: 0;
        }
    }
</style>
<script src="assets/js/libs/jquery.min.js"></script>
<script src="assets/js/libs/jquery.scrollTo.min.js"></script>
<script src="assets/js/libs/jquery.fancybox.min.js"></script>
<script src="assets/js/libs/slick.min.js"></script>
<script src="assets/js/libs/jquery.maskedinput.min.js"></script>
<script src="assets/js/libs/ion.rangeSlider.min.js"></script>
<script src="assets/js/app.js?v=[[!timestamp]]"></script>

<script>
			function get_cookie(cookie_name) {
				let results = document.cookie.match(\'(^|;) ?\' + cookie_name + \'=([^;]*)(;|$)\');
				if (results) return (unescape(results[2]));
				else
					return null;
				}
			setTimeout(function() {
				if (get_cookie(\'privacy_confirm\') != 1) {
					$(\'#cookie-attention-widget\').css(\'display\', \'block\');
					}
				}, 4000);
			function set_cookie(name, value, exp_y, exp_m, exp_d, path, domain, secure) {
				let cookie_string = name + "=" + escape(value);
				if (exp_y) {
					let expires = new Date(exp_y, exp_m, exp_d);
					cookie_string += "; expires=" + expires.toGMTString();
					}
				if (path) cookie_string += "; path=" + escape(path);
				if (domain) cookie_string += "; domain=" + escape(domain);
				if (secure) cookie_string += "; secure";
				document.cookie = cookie_string;
				}
		</script>

<style type="text/css">
.cookie-attention-choice ~ .cookie-attention-presence{
	display: inline-block;
	vertical-align: top;
	margin-right: 16px;
	padding: 6px 6px;
	min-width: 100px;
	text-align: center;
	color: #fff;
	font-weight: bold;
	cursor: pointer;
}
.cookie-attention-choice.__positive ~ .cookie-attention-presence{
	background: #b59974;
}
.cookie-attention-choice{
	position: absolute;
    clip: rect(0,0,0,0);
}
.cookie-attention-wrapper{
	margin: 0 auto;
	padding: 15px 15px 20px 15px;
	max-width: 800px;
	font-family: "Arial", sans-serif;
}
.cookie-attention-text{
	width: auto;
	margin-bottom: 8px;
	line-height: 1.2;
}
.cookie-attention {
    position: fixed;
    z-index: 6;
    width: 100vw;
    bottom: 0;
}
</style>

<script>
$(document).on(\'submit\', \'.ajax_form\', function() {
    var form = $(this);

    // Результатом работы будет выставление глобальной переменной
    //afValidated = false; // Или true, если валидация пройдена
    
    // Check phone mask
    afValidated = true;
    
    var phone_value = form.find(\'.phone-mask\').val();
    if (phone_value == \'+7 (___) ___-__-__\') {
    	afValidated = false;
    }
});
</script>

<script>
    $(document).on(\'af_complete\', function(event, response) {
        var form = response.form;
        var msgTitle, msgText;
        
        if (response.success) {
            msgTitle = form.find("input[name=\'success_title\']").val();
            msgText = form.find("input[name=\'success_message\']").val();
            
            app.showMessage({
            	title: msgTitle,
            	message: msgText
            });
        }
    });
</script>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'header' => 
      array (
        'fields' => 
        array (
          'id' => 2,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'header',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '<header class="header">

  <div class="container">
    <div class="header__wrapper">
        
      <div class="header__logo">
          <a class="header__logo-img" href="[[!++site_url]]">
              <img src="[[*header_logo]]" alt="[[*header_text]]">
          </a>
        <div class="header__logo-text">[[*header_text]]</div>
      </div>
      
      <div class="header__nav">
          
        <div class="nav">
          <ul>
            <li><a href="#advantages">Преимущества</a></li>
            <li><a href="#services">Услуги</a></li>
            <li><a href="#about">О нас</a></li>
            <li><a href="#working-with-us">Что вы получите</a></li>
            <li><a href="#clients">Отзывы</a></li>
            <li><a href="#contacts">Контакты</a></li>
          </ul>
        </div>
        
        <div class="header__contacts">
            <div class="header-phone"><a href="tel:[[*contact_phone:phoneHref]]">[[*contact_phone]]</a></div>
            <div class="callback-link-wrapper"><a class="callback-link js-modal" href="javascript:void(0);" data-id="modal-callback"><span class="ct-icon-phone callback-link__icon"></span><span class="callback-link__text">Заказать звонок</span></a></div>
          </div>
      </div>
      
      <div class="header-mobile-buttons">
          <a class="header-mobile-callback" href="tel:[[*contact_phone:phoneHref]]"></a>
          <a class="header-mobile-sandwich hamburger hamburger--squeeze js-menu" href="javascript:void(0);">
              <span class="hamburger-box">
                  <span class="hamburger-inner"></span>
              </span>
          </a>
      </div>
      
    </div>
  </div>
</header>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<header class="header">

  <div class="container">
    <div class="header__wrapper">
        
      <div class="header__logo">
          <a class="header__logo-img" href="[[!++site_url]]">
              <img src="[[*header_logo]]" alt="[[*header_text]]">
          </a>
        <div class="header__logo-text">[[*header_text]]</div>
      </div>
      
      <div class="header__nav">
          
        <div class="nav">
          <ul>
            <li><a href="#advantages">Преимущества</a></li>
            <li><a href="#services">Услуги</a></li>
            <li><a href="#about">О нас</a></li>
            <li><a href="#working-with-us">Что вы получите</a></li>
            <li><a href="#clients">Отзывы</a></li>
            <li><a href="#contacts">Контакты</a></li>
          </ul>
        </div>
        
        <div class="header__contacts">
            <div class="header-phone"><a href="tel:[[*contact_phone:phoneHref]]">[[*contact_phone]]</a></div>
            <div class="callback-link-wrapper"><a class="callback-link js-modal" href="javascript:void(0);" data-id="modal-callback"><span class="ct-icon-phone callback-link__icon"></span><span class="callback-link__text">Заказать звонок</span></a></div>
          </div>
      </div>
      
      <div class="header-mobile-buttons">
          <a class="header-mobile-callback" href="tel:[[*contact_phone:phoneHref]]"></a>
          <a class="header-mobile-sandwich hamburger hamburger--squeeze js-menu" href="javascript:void(0);">
              <span class="hamburger-box">
                  <span class="hamburger-inner"></span>
              </span>
          </a>
      </div>
      
    </div>
  </div>
</header>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'banner' => 
      array (
        'fields' => 
        array (
          'id' => 3,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'banner',
          'description' => '',
          'editor_type' => 0,
          'category' => 1,
          'cache_type' => 0,
          'snippet' => '<div class="banner" style="background-image: url(\'[[*banner_bg]]\');">
  <div class="section-inner">
    <div class="container">
      <div class="banner__wrapper">
        <div class="banner__content">
          <h1>[[*banner_title]]</h1>
          <div class="subtitle">[[*banner_text:nl2br]]</div>
          
          [[*banner_btn_enabled:is=`1`:then=`
              <div class="banner__btn"><a class="btn js-modal" href="javascript:void(0);" data-id="modal-callback">[[*banner_btn_text:default=`Получить консультацию`]]</a></div>
          `]]
          
        </div>
        [[*owner_name:is=``:then=``:else=`
            <div class="owner">
              <div class="owner__name">[[*owner_name]]</div>
              <div class="owner__about">[[*owner_descr]]</div>
              <div class="owner__zenit-logo"><img src="[[*owner_logo]]" alt="ФК «Зенит»"></div>
            </div>
        `]]
        
      </div>
    </div>
  </div>
  <div class="banner__photo" style="background-image: url(\'[[*banner_photo]]\');"></div>
</div>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="banner" style="background-image: url(\'[[*banner_bg]]\');">
  <div class="section-inner">
    <div class="container">
      <div class="banner__wrapper">
        <div class="banner__content">
          <h1>[[*banner_title]]</h1>
          <div class="subtitle">[[*banner_text:nl2br]]</div>
          
          [[*banner_btn_enabled:is=`1`:then=`
              <div class="banner__btn"><a class="btn js-modal" href="javascript:void(0);" data-id="modal-callback">[[*banner_btn_text:default=`Получить консультацию`]]</a></div>
          `]]
          
        </div>
        [[*owner_name:is=``:then=``:else=`
            <div class="owner">
              <div class="owner__name">[[*owner_name]]</div>
              <div class="owner__about">[[*owner_descr]]</div>
              <div class="owner__zenit-logo"><img src="[[*owner_logo]]" alt="ФК «Зенит»"></div>
            </div>
        `]]
        
      </div>
    </div>
  </div>
  <div class="banner__photo" style="background-image: url(\'[[*banner_photo]]\');"></div>
</div>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'advantages' => 
      array (
        'fields' => 
        array (
          'id' => 4,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'advantages',
          'description' => '',
          'editor_type' => 0,
          'category' => 1,
          'cache_type' => 0,
          'snippet' => '<div class="section advantages" id="advantages">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>[[*advantages_title]]</h2>
        <div class="subtitle">[[*advantages_text:nl2br]]</div>
      </div>
      <div class="section-content">
        <div class="advantages-container">
          <div class="advantages-list">
              [[!getImageList?
                  &tvname=`advantages_migx`
                  &tpl=`advantagesItem`
              ]]
          </div>
          
          <div class="nav-arrows"><a class="nav-arrow prev" href="javascript:void(0);"></a><a class="nav-arrow next" href="javascript:void(0);"></a></div>
          
        </div>
      </div>
    </div>
  </div>
</div>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="section advantages" id="advantages">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>[[*advantages_title]]</h2>
        <div class="subtitle">[[*advantages_text:nl2br]]</div>
      </div>
      <div class="section-content">
        <div class="advantages-container">
          <div class="advantages-list">
              [[!getImageList?
                  &tvname=`advantages_migx`
                  &tpl=`advantagesItem`
              ]]
          </div>
          
          <div class="nav-arrows"><a class="nav-arrow prev" href="javascript:void(0);"></a><a class="nav-arrow next" href="javascript:void(0);"></a></div>
          
        </div>
      </div>
    </div>
  </div>
</div>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'services' => 
      array (
        'fields' => 
        array (
          'id' => 5,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'services',
          'description' => '',
          'editor_type' => 0,
          'category' => 1,
          'cache_type' => 0,
          'snippet' => '<div class="section bg-dark services" id="services">
<div class="section-inner">
<div class="container">
  <div class="section-title">
    <h2>[[*services_title]]</h2>
    <div class="subtitle">[[*services_descr:nl2br]]</div>
  </div>
  <div class="section-content">
    <div class="services-container">
      <div class="services-list">
          [[!getImageList?
              &tvname=`services_migx`
              &tpl=`servicesItem`
          ]]
      </div>
      
      <div class="nav-arrows"><a class="nav-arrow prev" href="javascript:void(0);"></a><a class="nav-arrow next" href="javascript:void(0);"></a></div>
      
    </div>
  </div>
</div>
</div>
</div>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="section bg-dark services" id="services">
<div class="section-inner">
<div class="container">
  <div class="section-title">
    <h2>[[*services_title]]</h2>
    <div class="subtitle">[[*services_descr:nl2br]]</div>
  </div>
  <div class="section-content">
    <div class="services-container">
      <div class="services-list">
          [[!getImageList?
              &tvname=`services_migx`
              &tpl=`servicesItem`
          ]]
      </div>
      
      <div class="nav-arrows"><a class="nav-arrow prev" href="javascript:void(0);"></a><a class="nav-arrow next" href="javascript:void(0);"></a></div>
      
    </div>
  </div>
</div>
</div>
</div>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'calc' => 
      array (
        'fields' => 
        array (
          'id' => 6,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'calc',
          'description' => '',
          'editor_type' => 0,
          'category' => 1,
          'cache_type' => 0,
          'snippet' => '<div class="section calc">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>[[*calc_title]]</h2>
        <div class="subtitle">[[*calc_descr:nl2br]]</div>
      </div>
      <div class="section-content">
        [[!AjaxForm?
			&form=`calc-form`
			&snippet=`FormIt`
			&hooks=`email`
			&formName=`Запрос стоимости квартиры`
			&emailSubject=`Запрос стоимости квартиры`
			&emailTo=`[[++emailsender]],gds@m16.bz`
			&emailFrom=`noreply@sell-your-apartment.m16-estate.ru`
			&emailTpl=`calc-email`
			&validate=`phone:required`
			&validationErrorMessage=``
			&vTextRequired=`Данное поле является обязательным для заполнения`
			&successMessage=`Спасибо за заявку!`
		]]
      </div>
    </div>
  </div>
</div>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="section calc">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>[[*calc_title]]</h2>
        <div class="subtitle">[[*calc_descr:nl2br]]</div>
      </div>
      <div class="section-content">
        [[!AjaxForm?
			&form=`calc-form`
			&snippet=`FormIt`
			&hooks=`email`
			&formName=`Запрос стоимости квартиры`
			&emailSubject=`Запрос стоимости квартиры`
			&emailTo=`[[++emailsender]],gds@m16.bz`
			&emailFrom=`noreply@sell-your-apartment.m16-estate.ru`
			&emailTpl=`calc-email`
			&validate=`phone:required`
			&validationErrorMessage=``
			&vTextRequired=`Данное поле является обязательным для заполнения`
			&successMessage=`Спасибо за заявку!`
		]]
      </div>
    </div>
  </div>
</div>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'about' => 
      array (
        'fields' => 
        array (
          'id' => 7,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'about',
          'description' => '',
          'editor_type' => 0,
          'category' => 1,
          'cache_type' => 0,
          'snippet' => '<div class="section about" id="about">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>[[*about_title]]</h2>
      </div>
      <div class="section-content">
        <div class="about-container">
          <div class="about-left">
            <div class="people"><img src="[[*about_photo]]" alt="" draggable="false"/>
              <div class="people__bottom">
                <div class="people__title">[[*about_photo_title]]</div>
                <div class="people__text">[[*about_photo_descr]]</div>
              </div>
            </div>
          </div>
          <div class="about-right">
            <div class="text-editor-content">
              <blockquote>
                [[*about_quotation]]
              </blockquote>
              [[*about_text]]
            </div>
            
            [[!getImageList?
                &tvname=`certificates_migx`
                &tpl=`aboutCertificatesItem`
                &wrapperTpl=`aboutCertificates`
            ]]
          </div>
        </div>
      </div>
    </div>
  </div>
</div>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="section about" id="about">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>[[*about_title]]</h2>
      </div>
      <div class="section-content">
        <div class="about-container">
          <div class="about-left">
            <div class="people"><img src="[[*about_photo]]" alt="" draggable="false"/>
              <div class="people__bottom">
                <div class="people__title">[[*about_photo_title]]</div>
                <div class="people__text">[[*about_photo_descr]]</div>
              </div>
            </div>
          </div>
          <div class="about-right">
            <div class="text-editor-content">
              <blockquote>
                [[*about_quotation]]
              </blockquote>
              [[*about_text]]
            </div>
            
            [[!getImageList?
                &tvname=`certificates_migx`
                &tpl=`aboutCertificatesItem`
                &wrapperTpl=`aboutCertificates`
            ]]
          </div>
        </div>
      </div>
    </div>
  </div>
</div>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'working_with_us' => 
      array (
        'fields' => 
        array (
          'id' => 8,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'working_with_us',
          'description' => '',
          'editor_type' => 0,
          'category' => 1,
          'cache_type' => 0,
          'snippet' => '<div class="section working-with-us bg-dark" id="working-with-us">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>[[*work_title]]</h2>
      </div>
      <div class="section-content">
        <div class="working-with-us-container"><img class="working-with-us__photo" src="[[*work_photo]]" alt="[[*work_title]]" draggable="false">
          <div class="working-with-us-slider-outer">
            <div class="working-with-us-slider">
              <div class="working-with-us-slide slide1">
                <ul>
                     [[!getImageList?
                         &tvname=`work_list1`
                         &tpl=`workListItem`
                     ]]
                </ul>
              </div>
              <div class="working-with-us-slide slide2">
                <ul>
                  [[!getImageList?
                         &tvname=`work_list2`
                         &tpl=`workListItem`
                     ]]
                </ul>
              </div>
            </div>
            
            <div class="nav-arrows"><a class="nav-arrow prev" href="javascript:void(0);"></a><a class="nav-arrow next" href="javascript:void(0);"></a></div>
            
          </div>
        </div>
      </div>
    </div>
  </div>
</div>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="section working-with-us bg-dark" id="working-with-us">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>[[*work_title]]</h2>
      </div>
      <div class="section-content">
        <div class="working-with-us-container"><img class="working-with-us__photo" src="[[*work_photo]]" alt="[[*work_title]]" draggable="false">
          <div class="working-with-us-slider-outer">
            <div class="working-with-us-slider">
              <div class="working-with-us-slide slide1">
                <ul>
                     [[!getImageList?
                         &tvname=`work_list1`
                         &tpl=`workListItem`
                     ]]
                </ul>
              </div>
              <div class="working-with-us-slide slide2">
                <ul>
                  [[!getImageList?
                         &tvname=`work_list2`
                         &tpl=`workListItem`
                     ]]
                </ul>
              </div>
            </div>
            
            <div class="nav-arrows"><a class="nav-arrow prev" href="javascript:void(0);"></a><a class="nav-arrow next" href="javascript:void(0);"></a></div>
            
          </div>
        </div>
      </div>
    </div>
  </div>
</div>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'clients' => 
      array (
        'fields' => 
        array (
          'id' => 9,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'clients',
          'description' => '',
          'editor_type' => 0,
          'category' => 1,
          'cache_type' => 0,
          'snippet' => '[[!getImageList?
    &tvname=`clients_migx`
    &tpl=`clientCard`
    &wrapperTpl=`clientsOuter`
]]',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '[[!getImageList?
    &tvname=`clients_migx`
    &tpl=`clientCard`
    &wrapperTpl=`clientsOuter`
]]',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'cta' => 
      array (
        'fields' => 
        array (
          'id' => 10,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'cta',
          'description' => '',
          'editor_type' => 0,
          'category' => 1,
          'cache_type' => 0,
          'snippet' => '<div class="section cta">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>[[*consult_title]]</h2>
        <div class="subtitle">[[*consult_descr]]</div>
      </div>
      <div class="section-content">
        [[!AjaxForm?
			&form=`consult-form`
			&snippet=`FormIt`
			&hooks=`email`
			&formName=`Заказ консультации`
			&emailSubject=`Заказ консультации`
			&emailTo=`[[++emailsender]],gds@m16.bz`
			&emailFrom=`noreply@sell-your-apartment.m16-estate.ru`
			&emailTpl=`consult-email`
			&validate=`phone:required`
			&validationErrorMessage=``
			&vTextRequired=`Данное поле является обязательным для заполнения`
			&successMessage=`Спасибо за заявку!`
		]]
      </div>
    </div>
  </div>
</div>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="section cta">
  <div class="section-inner">
    <div class="container">
      <div class="section-title">
        <h2>[[*consult_title]]</h2>
        <div class="subtitle">[[*consult_descr]]</div>
      </div>
      <div class="section-content">
        [[!AjaxForm?
			&form=`consult-form`
			&snippet=`FormIt`
			&hooks=`email`
			&formName=`Заказ консультации`
			&emailSubject=`Заказ консультации`
			&emailTo=`[[++emailsender]],gds@m16.bz`
			&emailFrom=`noreply@sell-your-apartment.m16-estate.ru`
			&emailTpl=`consult-email`
			&validate=`phone:required`
			&validationErrorMessage=``
			&vTextRequired=`Данное поле является обязательным для заполнения`
			&successMessage=`Спасибо за заявку!`
		]]
      </div>
    </div>
  </div>
</div>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'contacts' => 
      array (
        'fields' => 
        array (
          'id' => 11,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'contacts',
          'description' => '',
          'editor_type' => 0,
          'category' => 1,
          'cache_type' => 0,
          'snippet' => '<div class="contacts" id="contacts">
  <div class="container">
    <div class="contacts-box">
      <h2 class="contacts-box__title">[[*contact_title]]</h2>
      <div class="contacts-box__main">
        <div class="contacts-box__group">
          <div class="contacts-box__group-title">Телефон</div>
          <div class="contacts-box__group-content">
            <div class="contacts-box__icon ct-icon-phone"></div>
            <div class="ct-phone"><a href="tel:[[*contact_phone:phoneHref]]">[[*contact_phone]]</a></div>
            <div class="contacts-box__btn"><a class="btn js-modal" href="javascript:void(0);" data-id="modal-callback">Заказать <span class="mobile-hidden">обратный </span>звонок</a></div>
          </div>
        </div>
        <div class="contacts-box__group">
          <div class="contacts-box__group-title">E-mail</div>
          <div class="contacts-box__group-content">
            <div class="contacts-box__icon ct-icon-email"></div>
            <div class="ct-email"><a href="mailto:[[*contact_email]]">[[*contact_email]]</a></div>
          </div>
        </div>
        <div class="contacts-box__group">
          <div class="contacts-box__group-title">Адрес</div>
          <div class="contacts-box__group-content">
            <div class="contacts-box__icon ct-icon-address"></div>[[*contact_address]]
            <div class="address-link"><a href="javascript:void(0);" class="js-modal" data-id="modal-how-to-find">Как добраться?</a></div>
          </div>
        </div>
        <div class="contacts-box__group">
          <div class="contacts-box__group-title">Режим работы</div>
          <div class="contacts-box__group-content">
            <div class="contacts-box__icon ct-icon-clock"></div>[[*contact_work_hours]]
          </div>
        </div>
        [[!social]]
      </div>
    </div>
  </div>
  <div class="map" id="map"></div>
</div>

<script src="https://api-maps.yandex.ru/2.1/?lang=ru_RU" type="text/javascript"></script>
<script>
	ymaps.ready(function() {
		var coords = \'[[*contact_map_coords:default=``]]\';
		if (coords != \'\') {
		    coords = coords.replace(/\\s/gi,\'\');
		    coords = coords.split(\',\');
		    if (!coords.length) {
		        return false;
		    }
		}

		var myMap = new ymaps.Map(\'map\', {
			center: coords,
			zoom: 16,
			controls: [] //\'zoomControl\'
		}, {
			//searchControlProvider: \'yandex#search\'
		});
		placemarkOffice = new ymaps.Placemark(coords, {
			hintContent: \'Офис компании\',
			balloonContent: \'[[*contact_map_balloon_text]]\',
		}, {
			iconLayout: \'default#image\',
            // Своё изображение иконки метки.
            iconImageHref: \'assets/img/marker.png\',
            // Размеры метки.
            iconImageSize: [50, 74],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-25, -74]
		});

		// Offset
		var position = myMap.getGlobalPixelCenter();
		var map_elem = document.getElementById(\'map\');
		var viewport_width = map_elem.clientWidth;
		var map_height = map_elem.clientHeight;

		// vw >= 1200
		var map_offset_x = -348;
		var map_offset_y = 0;

		// vw < 1200
		if (viewport_width < 1200) {
			map_offset_x = 0;
			map_offset_y = Math.ceil(map_height * 0.33) * -1;
		}

		myMap.setGlobalPixelCenter([ position[0] + map_offset_x , position[1] + map_offset_y ]);
	  
		myMap.geoObjects.add(placemarkOffice);
		myMap.behaviors.disable(\'scrollZoom\');
	});
</script>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="contacts" id="contacts">
  <div class="container">
    <div class="contacts-box">
      <h2 class="contacts-box__title">[[*contact_title]]</h2>
      <div class="contacts-box__main">
        <div class="contacts-box__group">
          <div class="contacts-box__group-title">Телефон</div>
          <div class="contacts-box__group-content">
            <div class="contacts-box__icon ct-icon-phone"></div>
            <div class="ct-phone"><a href="tel:[[*contact_phone:phoneHref]]">[[*contact_phone]]</a></div>
            <div class="contacts-box__btn"><a class="btn js-modal" href="javascript:void(0);" data-id="modal-callback">Заказать <span class="mobile-hidden">обратный </span>звонок</a></div>
          </div>
        </div>
        <div class="contacts-box__group">
          <div class="contacts-box__group-title">E-mail</div>
          <div class="contacts-box__group-content">
            <div class="contacts-box__icon ct-icon-email"></div>
            <div class="ct-email"><a href="mailto:[[*contact_email]]">[[*contact_email]]</a></div>
          </div>
        </div>
        <div class="contacts-box__group">
          <div class="contacts-box__group-title">Адрес</div>
          <div class="contacts-box__group-content">
            <div class="contacts-box__icon ct-icon-address"></div>[[*contact_address]]
            <div class="address-link"><a href="javascript:void(0);" class="js-modal" data-id="modal-how-to-find">Как добраться?</a></div>
          </div>
        </div>
        <div class="contacts-box__group">
          <div class="contacts-box__group-title">Режим работы</div>
          <div class="contacts-box__group-content">
            <div class="contacts-box__icon ct-icon-clock"></div>[[*contact_work_hours]]
          </div>
        </div>
        [[!social]]
      </div>
    </div>
  </div>
  <div class="map" id="map"></div>
</div>

<script src="https://api-maps.yandex.ru/2.1/?lang=ru_RU" type="text/javascript"></script>
<script>
	ymaps.ready(function() {
		var coords = \'[[*contact_map_coords:default=``]]\';
		if (coords != \'\') {
		    coords = coords.replace(/\\s/gi,\'\');
		    coords = coords.split(\',\');
		    if (!coords.length) {
		        return false;
		    }
		}

		var myMap = new ymaps.Map(\'map\', {
			center: coords,
			zoom: 16,
			controls: [] //\'zoomControl\'
		}, {
			//searchControlProvider: \'yandex#search\'
		});
		placemarkOffice = new ymaps.Placemark(coords, {
			hintContent: \'Офис компании\',
			balloonContent: \'[[*contact_map_balloon_text]]\',
		}, {
			iconLayout: \'default#image\',
            // Своё изображение иконки метки.
            iconImageHref: \'assets/img/marker.png\',
            // Размеры метки.
            iconImageSize: [50, 74],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-25, -74]
		});

		// Offset
		var position = myMap.getGlobalPixelCenter();
		var map_elem = document.getElementById(\'map\');
		var viewport_width = map_elem.clientWidth;
		var map_height = map_elem.clientHeight;

		// vw >= 1200
		var map_offset_x = -348;
		var map_offset_y = 0;

		// vw < 1200
		if (viewport_width < 1200) {
			map_offset_x = 0;
			map_offset_y = Math.ceil(map_height * 0.33) * -1;
		}

		myMap.setGlobalPixelCenter([ position[0] + map_offset_x , position[1] + map_offset_y ]);
	  
		myMap.geoObjects.add(placemarkOffice);
		myMap.behaviors.disable(\'scrollZoom\');
	});
</script>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'footer' => 
      array (
        'fields' => 
        array (
          'id' => 13,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'footer',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '<footer class="footer">
  <div class="container">
    <div class="footer__wrapper">
      <div class="footer__copyright">[[*footer_copyright]]</div>
      <div class="footer__dev">[[*footer_dev]]</div>
    </div>
  </div>
<div class="cookie-attention" id="cookie-attention-widget" style="display: none;">
	<div class="cookie-attention-holder">
		<div class="cookie-attention-content cont-w" style="background: #000;border-top: 3px solid #b59974;">
			<div class="cookie-attention-wrapper">
				<div class="cookie-attention-body" style="display: flex;flex-direction: column;">
					<div class="cookie-attention-text">
						<div class="cookie-attention-text" style="color: #fff;width:auto;">
						Сайт <strong>m16-estate.ru</strong> использует файлы «cookie» и системы аналитики для персонализации сервисов и повышения удобства пользования веб-сайтом. Продолжая просмотр сайта, вы разрешаете их использование. С подробной информации о сборе персональных данных можно ознакомится <a href="https://m16-group.ru/privacy_policy">тут</a>.</div>
					</div>
					<div class="cookie-attention-ui" onclick="set_cookie(\'privacy_confirm\', \'1\', 2020, 12, 30); $(\'#cookie-attention-widget\').css(\'display\',\'none\');">
						<input class="cookie-attention-choice __positive js-cookie-attention-choice" id="cookie-attention-positive" type="radio" value="positive">
						<label class="cookie-attention-presence" for="cookie-attention-positive" style="
						padding: 10px 20px;
						">Согласен</label>
					</div>
				</div>
			</div>
		</div>
	</div>
</div>
</footer>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<footer class="footer">
  <div class="container">
    <div class="footer__wrapper">
      <div class="footer__copyright">[[*footer_copyright]]</div>
      <div class="footer__dev">[[*footer_dev]]</div>
    </div>
  </div>
<div class="cookie-attention" id="cookie-attention-widget" style="display: none;">
	<div class="cookie-attention-holder">
		<div class="cookie-attention-content cont-w" style="background: #000;border-top: 3px solid #b59974;">
			<div class="cookie-attention-wrapper">
				<div class="cookie-attention-body" style="display: flex;flex-direction: column;">
					<div class="cookie-attention-text">
						<div class="cookie-attention-text" style="color: #fff;width:auto;">
						Сайт <strong>m16-estate.ru</strong> использует файлы «cookie» и системы аналитики для персонализации сервисов и повышения удобства пользования веб-сайтом. Продолжая просмотр сайта, вы разрешаете их использование. С подробной информации о сборе персональных данных можно ознакомится <a href="https://m16-group.ru/privacy_policy">тут</a>.</div>
					</div>
					<div class="cookie-attention-ui" onclick="set_cookie(\'privacy_confirm\', \'1\', 2020, 12, 30); $(\'#cookie-attention-widget\').css(\'display\',\'none\');">
						<input class="cookie-attention-choice __positive js-cookie-attention-choice" id="cookie-attention-positive" type="radio" value="positive">
						<label class="cookie-attention-presence" for="cookie-attention-positive" style="
						padding: 10px 20px;
						">Согласен</label>
					</div>
				</div>
			</div>
		</div>
	</div>
</div>
</footer>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'modals' => 
      array (
        'fields' => 
        array (
          'id' => 12,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'modals',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '<div class="modals-wrap" style="display:none;">
  <div class="modal" id="modal-callback">
    <div class="modal__wrapper">
      <div class="modal__heading">Заказать обратный звонок .</div>
      <div class="modal__content">
        <div class="modal__text">Отправьте заявку, и наш менеджер свяжется с Вами в течение ближайших 15 минут рабочего времени.</div>
        
        [[!AjaxForm?
			&form=`callback-form`
			&snippet=`FormIt`
			&hooks=`email`
			&formName=`Заказ обратного звонка`
			&emailSubject=`Заказ звонка`
			&emailTo=`[[++emailsender]],gds@m16.bz`
			&emailFrom=`noreply@sell-your-apartment.m16-estate.ru`
			&emailTpl=`callback-email`
			&validate=`phone:required`
			&validationErrorMessage=``
			&vTextRequired=`Данное поле является обязательным для заполнения`
			&successMessage=`Спасибо за звонок!`
		]]
        
      </div>
    </div>
  </div>
  <div class="modal modal--message" id="modal-message">
    <div class="modal__wrapper">
      <div class="modal__heading">Спасибо за звонок!</div>
      <div class="modal__content">
        <div class="modal__text">Мы перезвоним вам в ближайшее время, пожалуйста ожидайте.</div>
      </div>
    </div>
  </div>
  
  <div class="modal modal--message" id="modal-how-to-find">
    <div class="modal__wrapper">
      <div class="modal__heading">[[*contact_how_to_title]]</div>
      <div class="modal__content">
        <div class="modal__text">[[*contact_how_to_text]]</div>
      </div>
    </div>
  </div>
  
</div>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="modals-wrap" style="display:none;">
  <div class="modal" id="modal-callback">
    <div class="modal__wrapper">
      <div class="modal__heading">Заказать обратный звонок .</div>
      <div class="modal__content">
        <div class="modal__text">Отправьте заявку, и наш менеджер свяжется с Вами в течение ближайших 15 минут рабочего времени.</div>
        
        [[!AjaxForm?
			&form=`callback-form`
			&snippet=`FormIt`
			&hooks=`email`
			&formName=`Заказ обратного звонка`
			&emailSubject=`Заказ звонка`
			&emailTo=`[[++emailsender]],gds@m16.bz`
			&emailFrom=`noreply@sell-your-apartment.m16-estate.ru`
			&emailTpl=`callback-email`
			&validate=`phone:required`
			&validationErrorMessage=``
			&vTextRequired=`Данное поле является обязательным для заполнения`
			&successMessage=`Спасибо за звонок!`
		]]
        
      </div>
    </div>
  </div>
  <div class="modal modal--message" id="modal-message">
    <div class="modal__wrapper">
      <div class="modal__heading">Спасибо за звонок!</div>
      <div class="modal__content">
        <div class="modal__text">Мы перезвоним вам в ближайшее время, пожалуйста ожидайте.</div>
      </div>
    </div>
  </div>
  
  <div class="modal modal--message" id="modal-how-to-find">
    <div class="modal__wrapper">
      <div class="modal__heading">[[*contact_how_to_title]]</div>
      <div class="modal__content">
        <div class="modal__text">[[*contact_how_to_text]]</div>
      </div>
    </div>
  </div>
  
</div>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'calc-form' => 
      array (
        'fields' => 
        array (
          'id' => 23,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'calc-form',
          'description' => '',
          'editor_type' => 0,
          'category' => 5,
          'cache_type' => 0,
          'snippet' => '<form class="calc-form form">
  <div class="calc-top-line">
    <div class="calc-type">
      <div class="radio radio--with-icon">
        <label>
          <input type="radio" name="type" value="На вторичном рынке" checked><span class="radio__content"><span class="radio__circle"></span><span class="radio__icon building-type-1"></span><span class="radio__text">На вторичном рынке</span></span>
        </label>
      </div>
      <div class="radio radio--with-icon">
        <label>
          <input type="radio" name="type" value="В строящемся доме"><span class="radio__content"><span class="radio__circle"></span><span class="radio__icon building-type-2"></span><span class="radio__text">В строящемся доме</span></span>
        </label>
      </div>
    </div>
    <div class="calc-checkbox">
      <div class="checkbox">
        <label>
          <input type="checkbox" name="view_checkbox" value="Да"><span class="checkbox__content"><span class="checkbox__icon"></span><span class="checkbox__text">Видовая квартира</span></span>
        </label>
        
        <input type="hidden" name="view" value="Нет" />
      </div>
    </div>
  </div>
  <div class="calc-main">
    <div class="calc-fields">
      <div class="form-group">
        <label for="calc-address">Адрес дома</label>
        <input class="form-control" type="text" name="address" id="calc-address" placeholder="Укажите адрес дома">
        <span class="error_address error-msg"></span>
      </div>
      <div class="form-group">
        <label>Число спален</label>
        <div class="radio-buttons-inline">
          <div class="radio radio--no-icon">
            <label>
              <input type="radio" name="rooms" value="1"><span class="radio__content"><span class="radio__circle"></span><span class="radio__text">1</span></span>
            </label>
          </div>
          <div class="radio radio--no-icon">
            <label>
              <input type="radio" name="rooms" value="2" checked><span class="radio__content"><span class="radio__circle"></span><span class="radio__text">2</span></span>
            </label>
          </div>
          <div class="radio radio--no-icon">
            <label>
              <input type="radio" name="rooms" value="3"><span class="radio__content"><span class="radio__circle"></span><span class="radio__text">3</span></span>
            </label>
          </div>
          <div class="radio radio--no-icon">
            <label>
              <input type="radio" name="rooms" value="4"><span class="radio__content"><span class="radio__circle"></span><span class="radio__text">4</span></span>
            </label>
          </div>
          <div class="radio radio--no-icon">
            <label>
              <input type="radio" name="rooms" value="5+"><span class="radio__content"><span class="radio__circle"></span><span class="radio__text">5+</span></span>
            </label>
          </div>
        </div>
      </div>
      <div class="form-group">
        <label>Площадь (м2)</label>
        <div class="range-slider-box">
          <input class="js-range-slider" type="text" name="input-square-range" value="" data-min="50" data-max="350" data-from="100" data-to="300">
          <input class="input-from" type="hidden" name="square_from" value="50">
          <input class="input-to" type="hidden" name="square_to" value="350">
        </div>
      </div>
      <div class="form-group">
        <label>Стоимость (млн рублей)</label>
        <div class="range-slider-box">
          <input class="js-range-slider" type="text" name="input-square-range" value="" data-min="10" data-max="300" data-from="30" data-to="280">
          <input class="input-from" type="hidden" name="price_from" value="10">
          <input class="input-to" type="hidden" name="price_to" value="300">
        </div>
      </div>
      <div class="form-group">
        <label for="calc-name">Ваше имя</label>
        <input class="form-control" type="text" name="name" id="calc-name" placeholder="Укажите ваше имя">
      </div>
      <div class="form-group">
        <label for="calc-phone">Ваш телефон</label>
        <input class="form-control phone-mask" type="text" name="phone" id="calc-phone" placeholder="Укажите телефон">
        <span class="error_phone error-msg"></span>
      </div>
    </div>
    <div class="form-submit">
      <input class="btn" type="submit" value="[[*calc_btn_text:default=`Оставить заявку`]]"/>
    </div>
    <input type="hidden" name="success_title" value="Спасибо за заявку!">
    <input type="hidden" name="success_message" value="Мы перезвоним вам в ближайшее время, пожалуйста ожидайте.">
  </div>
</form>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<form class="calc-form form">
  <div class="calc-top-line">
    <div class="calc-type">
      <div class="radio radio--with-icon">
        <label>
          <input type="radio" name="type" value="На вторичном рынке" checked><span class="radio__content"><span class="radio__circle"></span><span class="radio__icon building-type-1"></span><span class="radio__text">На вторичном рынке</span></span>
        </label>
      </div>
      <div class="radio radio--with-icon">
        <label>
          <input type="radio" name="type" value="В строящемся доме"><span class="radio__content"><span class="radio__circle"></span><span class="radio__icon building-type-2"></span><span class="radio__text">В строящемся доме</span></span>
        </label>
      </div>
    </div>
    <div class="calc-checkbox">
      <div class="checkbox">
        <label>
          <input type="checkbox" name="view_checkbox" value="Да"><span class="checkbox__content"><span class="checkbox__icon"></span><span class="checkbox__text">Видовая квартира</span></span>
        </label>
        
        <input type="hidden" name="view" value="Нет" />
      </div>
    </div>
  </div>
  <div class="calc-main">
    <div class="calc-fields">
      <div class="form-group">
        <label for="calc-address">Адрес дома</label>
        <input class="form-control" type="text" name="address" id="calc-address" placeholder="Укажите адрес дома">
        <span class="error_address error-msg"></span>
      </div>
      <div class="form-group">
        <label>Число спален</label>
        <div class="radio-buttons-inline">
          <div class="radio radio--no-icon">
            <label>
              <input type="radio" name="rooms" value="1"><span class="radio__content"><span class="radio__circle"></span><span class="radio__text">1</span></span>
            </label>
          </div>
          <div class="radio radio--no-icon">
            <label>
              <input type="radio" name="rooms" value="2" checked><span class="radio__content"><span class="radio__circle"></span><span class="radio__text">2</span></span>
            </label>
          </div>
          <div class="radio radio--no-icon">
            <label>
              <input type="radio" name="rooms" value="3"><span class="radio__content"><span class="radio__circle"></span><span class="radio__text">3</span></span>
            </label>
          </div>
          <div class="radio radio--no-icon">
            <label>
              <input type="radio" name="rooms" value="4"><span class="radio__content"><span class="radio__circle"></span><span class="radio__text">4</span></span>
            </label>
          </div>
          <div class="radio radio--no-icon">
            <label>
              <input type="radio" name="rooms" value="5+"><span class="radio__content"><span class="radio__circle"></span><span class="radio__text">5+</span></span>
            </label>
          </div>
        </div>
      </div>
      <div class="form-group">
        <label>Площадь (м2)</label>
        <div class="range-slider-box">
          <input class="js-range-slider" type="text" name="input-square-range" value="" data-min="50" data-max="350" data-from="100" data-to="300">
          <input class="input-from" type="hidden" name="square_from" value="50">
          <input class="input-to" type="hidden" name="square_to" value="350">
        </div>
      </div>
      <div class="form-group">
        <label>Стоимость (млн рублей)</label>
        <div class="range-slider-box">
          <input class="js-range-slider" type="text" name="input-square-range" value="" data-min="10" data-max="300" data-from="30" data-to="280">
          <input class="input-from" type="hidden" name="price_from" value="10">
          <input class="input-to" type="hidden" name="price_to" value="300">
        </div>
      </div>
      <div class="form-group">
        <label for="calc-name">Ваше имя</label>
        <input class="form-control" type="text" name="name" id="calc-name" placeholder="Укажите ваше имя">
      </div>
      <div class="form-group">
        <label for="calc-phone">Ваш телефон</label>
        <input class="form-control phone-mask" type="text" name="phone" id="calc-phone" placeholder="Укажите телефон">
        <span class="error_phone error-msg"></span>
      </div>
    </div>
    <div class="form-submit">
      <input class="btn" type="submit" value="[[*calc_btn_text:default=`Оставить заявку`]]"/>
    </div>
    <input type="hidden" name="success_title" value="Спасибо за заявку!">
    <input type="hidden" name="success_message" value="Мы перезвоним вам в ближайшее время, пожалуйста ожидайте.">
  </div>
</form>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'consult-form' => 
      array (
        'fields' => 
        array (
          'id' => 21,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'consult-form',
          'description' => '',
          'editor_type' => 0,
          'category' => 5,
          'cache_type' => 0,
          'snippet' => '<form class="form">
	<div class="inline-fields">
	<div class="form-group">
		<input class="form-control" type="text" name="name" placeholder="Имя"/>
	</div>
	<div class="form-group">
		<input class="form-control phone-mask" type="text" name="phone" placeholder="Телефон"/>
		<span class="error_phone error-msg"></span>
	</div>
	<div class="submit-btn">
		<input class="btn" type="submit" value="[[*consult_btn_text]]"/>
	</div>
	</div>
	<input type="hidden" name="success_title" value="Спасибо за заявку!">
	<input type="hidden" name="success_message" value="Мы перезвоним вам в ближайшее время, пожалуйста ожидайте.">
	<div class="agreement">Нажимая на кнопку, я принимаю <a href="[[*policy_pdf]]">соглашение</a> на обработку персональных данных</div>
	
	<input type="hidden" name="success_title" value="Спасибо за заявку!">
    <input type="hidden" name="success_message" value="Мы перезвоним вам в ближайшее время, пожалуйста ожидайте.">
</form>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<form class="form">
	<div class="inline-fields">
	<div class="form-group">
		<input class="form-control" type="text" name="name" placeholder="Имя"/>
	</div>
	<div class="form-group">
		<input class="form-control phone-mask" type="text" name="phone" placeholder="Телефон"/>
		<span class="error_phone error-msg"></span>
	</div>
	<div class="submit-btn">
		<input class="btn" type="submit" value="[[*consult_btn_text]]"/>
	</div>
	</div>
	<input type="hidden" name="success_title" value="Спасибо за заявку!">
	<input type="hidden" name="success_message" value="Мы перезвоним вам в ближайшее время, пожалуйста ожидайте.">
	<div class="agreement">Нажимая на кнопку, я принимаю <a href="[[*policy_pdf]]">соглашение</a> на обработку персональных данных</div>
	
	<input type="hidden" name="success_title" value="Спасибо за заявку!">
    <input type="hidden" name="success_message" value="Мы перезвоним вам в ближайшее время, пожалуйста ожидайте.">
</form>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'socialItem' => 
      array (
        'fields' => 
        array (
          'id' => 32,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'socialItem',
          'description' => '',
          'editor_type' => 0,
          'category' => 18,
          'cache_type' => 0,
          'snippet' => '<a class="social-link [[+icon]]" href="[[+url]]" target="_blank"></a>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<a class="social-link [[+icon]]" href="[[+url]]" target="_blank"></a>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'socialOuter' => 
      array (
        'fields' => 
        array (
          'id' => 33,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'socialOuter',
          'description' => '',
          'editor_type' => 0,
          'category' => 18,
          'cache_type' => 0,
          'snippet' => '<div class="social">[[+output]]</div>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<div class="social">[[+output]]</div>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'callback-form' => 
      array (
        'fields' => 
        array (
          'id' => 15,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'callback-form',
          'description' => '',
          'editor_type' => 0,
          'category' => 5,
          'cache_type' => 0,
          'snippet' => '<form class="form">
  <div class="form-fields">
    <div class="form-group">
      <input class="form-control" type="text" name="name" placeholder="Имя"/>
    </div>
    <div class="form-group">
      <input class="form-control phone-mask" type="text" name="phone" placeholder="Телефон"/>
      <span class="error_phone error-msg"></span>
    </div>
  </div>
  <div class="form-submit">
    <input class="form-submit__btn btn" type="submit" value="Жду звонка">
  </div>
  <div class="agreement">Нажимая на кнопку, я принимаю <a href="[[*policy_pdf]]" target="_blank">соглашение</a> на обработку персональных данных</div>
  <input type="hidden" name="success_title" value="Спасибо за звонок!">
  <input type="hidden" name="success_message" value="Мы перезвоним вам в ближайшее время, пожалуйста ожидайте.">
</form>',
          'locked' => false,
          'properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '<form class="form">
  <div class="form-fields">
    <div class="form-group">
      <input class="form-control" type="text" name="name" placeholder="Имя"/>
    </div>
    <div class="form-group">
      <input class="form-control phone-mask" type="text" name="phone" placeholder="Телефон"/>
      <span class="error_phone error-msg"></span>
    </div>
  </div>
  <div class="form-submit">
    <input class="form-submit__btn btn" type="submit" value="Жду звонка">
  </div>
  <div class="agreement">Нажимая на кнопку, я принимаю <a href="[[*policy_pdf]]" target="_blank">соглашение</a> на обработку персональных данных</div>
  <input type="hidden" name="success_title" value="Спасибо за звонок!">
  <input type="hidden" name="success_message" value="Мы перезвоним вам в ближайшее время, пожалуйста ожидайте.">
</form>',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
    ),
    'modSnippet' => 
    array (
      'phoneHref' => 
      array (
        'fields' => 
        array (
          'id' => 31,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'phoneHref',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '$output = \'\';
$input = $modx->getOption(\'input\', $scriptProperties, \'\');
if (trim($input) != \'\') {
    $output = str_replace(array(\'-\', \'(\', \')\', \' \'), \'\', $input);
}

return $output;',
          'locked' => false,
          'properties' => 
          array (
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => '',
          'content' => '$output = \'\';
$input = $modx->getOption(\'input\', $scriptProperties, \'\');
if (trim($input) != \'\') {
    $output = str_replace(array(\'-\', \'(\', \')\', \' \'), \'\', $input);
}

return $output;',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'timestamp' => 
      array (
        'fields' => 
        array (
          'id' => 9,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'timestamp',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => 'return time();',
          'locked' => false,
          'properties' => 
          array (
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => '',
          'content' => 'return time();',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'getImageList' => 
      array (
        'fields' => 
        array (
          'id' => 10,
          'source' => 0,
          'property_preprocess' => false,
          'name' => 'getImageList',
          'description' => '',
          'editor_type' => 0,
          'category' => 17,
          'cache_type' => 0,
          'snippet' => '/**
 * getImageList
 *
 * Copyright 2009-2014 by Bruno Perner <b.perner@gmx.de>
 *
 * getImageList is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the Free
 * Software Foundation; either version 2 of the License, or (at your option) any
 * later version.
 *
 * getImageList is distributed in the hope that it will be useful, but WITHOUT ANY
 * WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR
 * A PARTICULAR PURPOSE. See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * getImageList; if not, write to the Free Software Foundation, Inc., 59 Temple Place,
 * Suite 330, Boston, MA 02111-1307 USA
 *
 * @package migx
 */
/**
 * getImageList
 *
 * display Items from outputvalue of TV with custom-TV-input-type MIGX or from other JSON-string for MODx Revolution 
 *
 * @version 1.4
 * @author Bruno Perner <b.perner@gmx.de>
 * @copyright Copyright &copy; 2009-2014
 * @license http://www.gnu.org/licenses/old-licenses/gpl-2.0.html GNU General Public License
 * version 2 or (at your option) any later version.
 * @package migx
 */

/*example: <ul>[[!getImageList? &tvname=`myTV`&tpl=`@CODE:<li>[[+idx]]<img src="[[+imageURL]]"/><p>[[+imageAlt]]</p></li>`]]</ul>*/
/* get default properties */


$tvname = $modx->getOption(\'tvname\', $scriptProperties, \'\');
$inherit_children_tvname = $modx->getOption(\'inherit_children_tvname\', $scriptProperties, \'\');
$tpl = $modx->getOption(\'tpl\', $scriptProperties, \'\');
$wrapperTpl = $modx->getOption(\'wrapperTpl\', $scriptProperties, \'\');
$emptyTpl = $modx->getOption(\'emptyTpl\', $scriptProperties, \'\'); 
$limit = $modx->getOption(\'limit\', $scriptProperties, \'0\');
$offset = $modx->getOption(\'offset\', $scriptProperties, 0);
$totalVar = $modx->getOption(\'totalVar\', $scriptProperties, \'total\');
$randomize = $modx->getOption(\'randomize\', $scriptProperties, false);
$preselectLimit = $modx->getOption(\'preselectLimit\', $scriptProperties, 0); // when random preselect important images
$where = $modx->getOption(\'where\', $scriptProperties, \'\');
$where = !empty($where) ? $modx->fromJSON($where) : array();
$sort = $modx->getOption(\'sort\', $scriptProperties, \'\');
$sort = !empty($sort) ? $modx->fromJSON($sort) : array();
$toSeparatePlaceholders = $modx->getOption(\'toSeparatePlaceholders\', $scriptProperties, false);
$toPlaceholder = $modx->getOption(\'toPlaceholder\', $scriptProperties, false);
$outputSeparator = $modx->getOption(\'outputSeparator\', $scriptProperties, \'\');
$splitSeparator = $modx->getOption(\'splitSeparator\', $scriptProperties, \'\');
$placeholdersKeyField = $modx->getOption(\'placeholdersKeyField\', $scriptProperties, \'MIGX_id\');
$toJsonPlaceholder = $modx->getOption(\'toJsonPlaceholder\', $scriptProperties, false);
$jsonVarKey = $modx->getOption(\'jsonVarKey\', $scriptProperties, \'migx_outputvalue\');
$outputvalue = $modx->getOption(\'value\', $scriptProperties, \'\');
$outputvalue = isset($_REQUEST[$jsonVarKey]) ? $_REQUEST[$jsonVarKey] : $outputvalue;
$docidVarKey = $modx->getOption(\'docidVarKey\', $scriptProperties, \'migx_docid\');
$docid = $modx->getOption(\'docid\', $scriptProperties, (isset($modx->resource) ? $modx->resource->get(\'id\') : 1));
$docid = isset($_REQUEST[$docidVarKey]) ? $_REQUEST[$docidVarKey] : $docid;
$processTVs = $modx->getOption(\'processTVs\', $scriptProperties, \'1\');
$reverse = $modx->getOption(\'reverse\', $scriptProperties, \'0\');
$sumFields = $modx->getOption(\'sumFields\', $scriptProperties, \'\');
$sumPrefix = $modx->getOption(\'sumPrefix\', $scriptProperties, \'summary_\');
$addfields = $modx->getOption(\'addfields\', $scriptProperties, \'\');
$addfields = !empty($addfields) ? explode(\',\', $addfields) : null;
//split json into parts
$splits = $modx->fromJson($modx->getOption(\'splits\', $scriptProperties, 0));
$splitTpl = $modx->getOption(\'splitTpl\', $scriptProperties, \'\');
$splitSeparator = $modx->getOption(\'splitSeparator\', $scriptProperties, \'\');
$inheritFrom = $modx->getOption(\'inheritFrom\', $scriptProperties, \'\'); //commaseparated list of resource-ids or/and the keyword \'parents\' where to inherit from
$inheritFrom = !empty($inheritFrom) ? explode(\',\', $inheritFrom) : \'\';

$modx->setPlaceholder(\'docid\', $docid);

$base_path = $modx->getOption(\'base_path\', null, MODX_BASE_PATH);
$base_url = $modx->getOption(\'base_url\', null, MODX_BASE_URL);

$migx = $modx->getService(\'migx\', \'Migx\', $modx->getOption(\'migx.core_path\', null, $modx->getOption(\'core_path\') . \'components/migx/\') . \'model/migx/\', $scriptProperties);
if (!($migx instanceof Migx))
    return \'\';
$migx->working_context = isset($modx->resource) ? $modx->resource->get(\'context_key\') : \'web\';

if (!empty($tvname)) {
    if ($tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $tvname))) {

        /*
        *   get inputProperties
        */


        $properties = $tv->get(\'input_properties\');
        $properties = isset($properties[\'formtabs\']) ? $properties : $tv->getProperties();

        $migx->config[\'configs\'] = $modx->getOption(\'configs\', $properties, \'\');
        if (!empty($migx->config[\'configs\'])) {
            $migx->loadConfigs();
            // get tabs from file or migx-config-table
            $formtabs = $migx->getTabs();
        }
        if (empty($formtabs) && isset($properties[\'formtabs\'])) {
            //try to get formtabs and its fields from properties
            $formtabs = $modx->fromJSON($properties[\'formtabs\']);
        }

        if (!empty($properties[\'basePath\'])) {
            if ($properties[\'autoResourceFolders\'] == \'true\') {
                $scriptProperties[\'base_path\'] = $base_path . $properties[\'basePath\'] . $docid . \'/\';
                $scriptProperties[\'base_url\'] = $base_url . $properties[\'basePath\'] . $docid . \'/\';
            } else {
                $scriptProperties[\'base_path\'] = $base_path . $properties[\'base_path\'];
                $scriptProperties[\'base_url\'] = $base_url . $properties[\'basePath\'];
            }
        }
        if ($jsonVarKey == \'migx_outputvalue\' && !empty($properties[\'jsonvarkey\'])) {
            $jsonVarKey = $properties[\'jsonvarkey\'];
            $outputvalue = isset($_REQUEST[$jsonVarKey]) ? $_REQUEST[$jsonVarKey] : $outputvalue;
        }

        if (empty($outputvalue)) {
            $outputvalue = $tv->renderOutput($docid);
            if (empty($outputvalue) && !empty($inheritFrom)) {
                foreach ($inheritFrom as $from) {
                    if ($from == \'parents\') {
                        if (!empty($inherit_children_tvname)){
                            //try to get items from optional MIGX-TV for children
                            if ($inh_tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $inherit_children_tvname))) {
                                $outputvalue = $inh_tv->processInheritBinding(\'\', $docid);    
                            }
                        }
                        $outputvalue = empty($outputvalue) ? $tv->processInheritBinding(\'\', $docid) : $outputvalue;
                    } else {
                        $outputvalue = $tv->renderOutput($from);
                    }
                    if (!empty($outputvalue)) {
                        break;
                    }
                }
            }
        }


        /*
        *   get inputTvs 
        */
        $inputTvs = array();
        if (is_array($formtabs)) {

            //multiple different Forms
            // Note: use same field-names and inputTVs in all forms
            $inputTvs = $migx->extractInputTvs($formtabs);
        }
        if ($migx->source = $tv->getSource($migx->working_context, false)) {
            $migx->source->initialize();
        }

    }


}

if (empty($outputvalue)) {
    $modx->setPlaceholder($totalVar, 0);
    return \'\';
}

//echo $outputvalue.\'<br/><br/>\';

$items = $modx->fromJSON($outputvalue);

// where filter
if (is_array($where) && count($where) > 0) {
    $items = $migx->filterItems($where, $items);
}
$modx->setPlaceholder($totalVar, count($items));

if (!empty($reverse)) {
    $items = array_reverse($items);
}

// sort items
if (is_array($sort) && count($sort) > 0) {
    $items = $migx->sortDbResult($items, $sort);
}

$summaries = array();
$output = \'\';
$items = $offset > 0 ? array_slice($items, $offset) : $items;
$count = count($items);

if ($count > 0) {
    $limit = $limit == 0 || $limit > $count ? $count : $limit;
    $preselectLimit = $preselectLimit > $count ? $count : $preselectLimit;
    //preselect important items
    $preitems = array();
    if ($randomize && $preselectLimit > 0) {
        for ($i = 0; $i < $preselectLimit; $i++) {
            $preitems[] = $items[$i];
            unset($items[$i]);
        }
        $limit = $limit - count($preitems);
    }

    //shuffle items
    if ($randomize) {
        shuffle($items);
    }

    //limit items
    $count = count($items);
    $tempitems = array();

    for ($i = 0; $i < $limit; $i++) {
        if ($i >= $count) {
            break;
        }
        $tempitems[] = $items[$i];
    }
    $items = $tempitems;

    //add preselected items and schuffle again
    if ($randomize && $preselectLimit > 0) {
        $items = array_merge($preitems, $items);
        shuffle($items);
    }

    $properties = array();
    foreach ($scriptProperties as $property => $value) {
        $properties[\'property.\' . $property] = $value;
    }

    $idx = 0;
    $output = array();
    $template = array();
    $count = count($items);

    foreach ($items as $key => $item) {
        $formname = isset($item[\'MIGX_formname\']) ? $item[\'MIGX_formname\'] . \'_\' : \'\';
        $fields = array();
        foreach ($item as $field => $value) {
            if (is_array($value)) {
                if (is_array($value[0])) {
                    //nested array - convert to json
                    $value = $modx->toJson($value);
                } else {
                    $value = implode(\'||\', $value); //handle arrays (checkboxes, multiselects)
                }
            }


            $inputTVkey = $formname . $field;

            if ($processTVs && isset($inputTvs[$inputTVkey])) {
                if (isset($inputTvs[$inputTVkey][\'inputTV\']) && $tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $inputTvs[$inputTVkey][\'inputTV\']))) {

                } else {
                    $tv = $modx->newObject(\'modTemplateVar\');
                    $tv->set(\'type\', $inputTvs[$inputTVkey][\'inputTVtype\']);
                }
                $inputTV = $inputTvs[$inputTVkey];

                $mTypes = $modx->getOption(\'manipulatable_url_tv_output_types\', null, \'image,file\');
                //don\'t manipulate any urls here
                $modx->setOption(\'manipulatable_url_tv_output_types\', \'\');
                $tv->set(\'default_text\', $value);
                $value = $tv->renderOutput($docid);
                //set option back
                $modx->setOption(\'manipulatable_url_tv_output_types\', $mTypes);
                //now manipulate urls
                if ($mediasource = $migx->getFieldSource($inputTV, $tv)) {
                    $mTypes = explode(\',\', $mTypes);
                    if (!empty($value) && in_array($tv->get(\'type\'), $mTypes)) {
                        //$value = $mediasource->prepareOutputUrl($value);
                        $value = str_replace(\'/./\', \'/\', $mediasource->prepareOutputUrl($value));
                    }
                }

            }
            $fields[$field] = $value;

        }

        if (!empty($addfields)) {
            foreach ($addfields as $addfield) {
                $addfield = explode(\':\', $addfield);
                $addname = $addfield[0];
                $adddefault = isset($addfield[1]) ? $addfield[1] : \'\';
                $fields[$addname] = $adddefault;
            }
        }

        if (!empty($sumFields)) {
            $sumFields = is_array($sumFields) ? $sumFields : explode(\',\', $sumFields);
            foreach ($sumFields as $sumField) {
                if (isset($fields[$sumField])) {
                    $summaries[$sumPrefix . $sumField] = $summaries[$sumPrefix . $sumField] + $fields[$sumField];
                    $fields[$sumPrefix . $sumField] = $summaries[$sumPrefix . $sumField];
                }
            }
        }


        if ($toJsonPlaceholder) {
            $output[] = $fields;
        } else {
            $fields[\'_alt\'] = $idx % 2;
            $idx++;
            $fields[\'_first\'] = $idx == 1 ? true : \'\';
            $fields[\'_last\'] = $idx == $limit ? true : \'\';
            $fields[\'idx\'] = $idx;
            $rowtpl = \'\';
            //get changing tpls from field
            if (substr($tpl, 0, 7) == "@FIELD:") {
                $tplField = substr($tpl, 7);
                $rowtpl = $fields[$tplField];
            }

            if ($fields[\'_first\'] && !empty($tplFirst)) {
                $rowtpl = $tplFirst;
            }
            if ($fields[\'_last\'] && empty($rowtpl) && !empty($tplLast)) {
                $rowtpl = $tplLast;
            }
            $tplidx = \'tpl_\' . $idx;
            if (empty($rowtpl) && !empty($$tplidx)) {
                $rowtpl = $$tplidx;
            }
            if ($idx > 1 && empty($rowtpl)) {
                $divisors = $migx->getDivisors($idx);
                if (!empty($divisors)) {
                    foreach ($divisors as $divisor) {
                        $tplnth = \'tpl_n\' . $divisor;
                        if (!empty($$tplnth)) {
                            $rowtpl = $$tplnth;
                            if (!empty($rowtpl)) {
                                break;
                            }
                        }
                    }
                }
            }

            if ($count == 1 && isset($tpl_oneresult)) {
                $rowtpl = $tpl_oneresult;
            }

            $fields = array_merge($fields, $properties);

            if (!empty($rowtpl)) {
                $template = $migx->getTemplate($tpl, $template);
                $fields[\'_tpl\'] = $template[$tpl];
            } else {
                $rowtpl = $tpl;

            }
            $template = $migx->getTemplate($rowtpl, $template);


            if ($template[$rowtpl]) {
                $chunk = $modx->newObject(\'modChunk\');
                $chunk->setCacheable(false);
                $chunk->setContent($template[$rowtpl]);


                if (!empty($placeholdersKeyField) && isset($fields[$placeholdersKeyField])) {
                    $output[$fields[$placeholdersKeyField]] = $chunk->process($fields);
                } else {
                    $output[] = $chunk->process($fields);
                }
            } else {
                if (!empty($placeholdersKeyField)) {
                    $output[$fields[$placeholdersKeyField]] = \'<pre>\' . print_r($fields, 1) . \'</pre>\';
                } else {
                    $output[] = \'<pre>\' . print_r($fields, 1) . \'</pre>\';
                }
            }
        }


    }
}

if (count($summaries) > 0) {
    $modx->toPlaceholders($summaries);
}


if ($toJsonPlaceholder) {
    $modx->setPlaceholder($toJsonPlaceholder, $modx->toJson($output));
    return \'\';
}

if (!empty($toSeparatePlaceholders)) {
    $modx->toPlaceholders($output, $toSeparatePlaceholders);
    return \'\';
}
/*
if (!empty($outerTpl))
$o = parseTpl($outerTpl, array(\'output\'=>implode($outputSeparator, $output)));
else 
*/

if ($count > 0 && $splits > 0) {
    $size = ceil($count / $splits);
    $chunks = array_chunk($output, $size);
    $output = array();
    foreach ($chunks as $chunk) {
        $o = implode($outputSeparator, $chunk);
        $output[] = $modx->getChunk($splitTpl, array(\'output\' => $o));
    }
    $outputSeparator = $splitSeparator;
}

if (is_array($output)) {
    $o = implode($outputSeparator, $output);
} else {
    $o = $output;
}

if (!empty($o) && !empty($wrapperTpl)) {
    $template = $migx->getTemplate($wrapperTpl);
    if ($template[$wrapperTpl]) {
        $chunk = $modx->newObject(\'modChunk\');
        $chunk->setCacheable(false);
        $chunk->setContent($template[$wrapperTpl]);
        $properties[\'output\'] = $o;
        $o = $chunk->process($properties);
    }
}

if (empty($o) && !empty($emptyTpl)) {
    $template = $migx->getTemplate($emptyTpl);
    if ($template[$emptyTpl]) {
        $chunk = $modx->newObject(\'modChunk\');
        $chunk->setCacheable(false);
        $chunk->setContent($template[$emptyTpl]);
        $o = $chunk->process($properties);
    }
}

if (!empty($toPlaceholder)) {
    $modx->setPlaceholder($toPlaceholder, $o);
    return \'\';
}

return $o;',
          'locked' => false,
          'properties' => 
          array (
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => '',
          'content' => '/**
 * getImageList
 *
 * Copyright 2009-2014 by Bruno Perner <b.perner@gmx.de>
 *
 * getImageList is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the Free
 * Software Foundation; either version 2 of the License, or (at your option) any
 * later version.
 *
 * getImageList is distributed in the hope that it will be useful, but WITHOUT ANY
 * WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR
 * A PARTICULAR PURPOSE. See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * getImageList; if not, write to the Free Software Foundation, Inc., 59 Temple Place,
 * Suite 330, Boston, MA 02111-1307 USA
 *
 * @package migx
 */
/**
 * getImageList
 *
 * display Items from outputvalue of TV with custom-TV-input-type MIGX or from other JSON-string for MODx Revolution 
 *
 * @version 1.4
 * @author Bruno Perner <b.perner@gmx.de>
 * @copyright Copyright &copy; 2009-2014
 * @license http://www.gnu.org/licenses/old-licenses/gpl-2.0.html GNU General Public License
 * version 2 or (at your option) any later version.
 * @package migx
 */

/*example: <ul>[[!getImageList? &tvname=`myTV`&tpl=`@CODE:<li>[[+idx]]<img src="[[+imageURL]]"/><p>[[+imageAlt]]</p></li>`]]</ul>*/
/* get default properties */


$tvname = $modx->getOption(\'tvname\', $scriptProperties, \'\');
$inherit_children_tvname = $modx->getOption(\'inherit_children_tvname\', $scriptProperties, \'\');
$tpl = $modx->getOption(\'tpl\', $scriptProperties, \'\');
$wrapperTpl = $modx->getOption(\'wrapperTpl\', $scriptProperties, \'\');
$emptyTpl = $modx->getOption(\'emptyTpl\', $scriptProperties, \'\'); 
$limit = $modx->getOption(\'limit\', $scriptProperties, \'0\');
$offset = $modx->getOption(\'offset\', $scriptProperties, 0);
$totalVar = $modx->getOption(\'totalVar\', $scriptProperties, \'total\');
$randomize = $modx->getOption(\'randomize\', $scriptProperties, false);
$preselectLimit = $modx->getOption(\'preselectLimit\', $scriptProperties, 0); // when random preselect important images
$where = $modx->getOption(\'where\', $scriptProperties, \'\');
$where = !empty($where) ? $modx->fromJSON($where) : array();
$sort = $modx->getOption(\'sort\', $scriptProperties, \'\');
$sort = !empty($sort) ? $modx->fromJSON($sort) : array();
$toSeparatePlaceholders = $modx->getOption(\'toSeparatePlaceholders\', $scriptProperties, false);
$toPlaceholder = $modx->getOption(\'toPlaceholder\', $scriptProperties, false);
$outputSeparator = $modx->getOption(\'outputSeparator\', $scriptProperties, \'\');
$splitSeparator = $modx->getOption(\'splitSeparator\', $scriptProperties, \'\');
$placeholdersKeyField = $modx->getOption(\'placeholdersKeyField\', $scriptProperties, \'MIGX_id\');
$toJsonPlaceholder = $modx->getOption(\'toJsonPlaceholder\', $scriptProperties, false);
$jsonVarKey = $modx->getOption(\'jsonVarKey\', $scriptProperties, \'migx_outputvalue\');
$outputvalue = $modx->getOption(\'value\', $scriptProperties, \'\');
$outputvalue = isset($_REQUEST[$jsonVarKey]) ? $_REQUEST[$jsonVarKey] : $outputvalue;
$docidVarKey = $modx->getOption(\'docidVarKey\', $scriptProperties, \'migx_docid\');
$docid = $modx->getOption(\'docid\', $scriptProperties, (isset($modx->resource) ? $modx->resource->get(\'id\') : 1));
$docid = isset($_REQUEST[$docidVarKey]) ? $_REQUEST[$docidVarKey] : $docid;
$processTVs = $modx->getOption(\'processTVs\', $scriptProperties, \'1\');
$reverse = $modx->getOption(\'reverse\', $scriptProperties, \'0\');
$sumFields = $modx->getOption(\'sumFields\', $scriptProperties, \'\');
$sumPrefix = $modx->getOption(\'sumPrefix\', $scriptProperties, \'summary_\');
$addfields = $modx->getOption(\'addfields\', $scriptProperties, \'\');
$addfields = !empty($addfields) ? explode(\',\', $addfields) : null;
//split json into parts
$splits = $modx->fromJson($modx->getOption(\'splits\', $scriptProperties, 0));
$splitTpl = $modx->getOption(\'splitTpl\', $scriptProperties, \'\');
$splitSeparator = $modx->getOption(\'splitSeparator\', $scriptProperties, \'\');
$inheritFrom = $modx->getOption(\'inheritFrom\', $scriptProperties, \'\'); //commaseparated list of resource-ids or/and the keyword \'parents\' where to inherit from
$inheritFrom = !empty($inheritFrom) ? explode(\',\', $inheritFrom) : \'\';

$modx->setPlaceholder(\'docid\', $docid);

$base_path = $modx->getOption(\'base_path\', null, MODX_BASE_PATH);
$base_url = $modx->getOption(\'base_url\', null, MODX_BASE_URL);

$migx = $modx->getService(\'migx\', \'Migx\', $modx->getOption(\'migx.core_path\', null, $modx->getOption(\'core_path\') . \'components/migx/\') . \'model/migx/\', $scriptProperties);
if (!($migx instanceof Migx))
    return \'\';
$migx->working_context = isset($modx->resource) ? $modx->resource->get(\'context_key\') : \'web\';

if (!empty($tvname)) {
    if ($tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $tvname))) {

        /*
        *   get inputProperties
        */


        $properties = $tv->get(\'input_properties\');
        $properties = isset($properties[\'formtabs\']) ? $properties : $tv->getProperties();

        $migx->config[\'configs\'] = $modx->getOption(\'configs\', $properties, \'\');
        if (!empty($migx->config[\'configs\'])) {
            $migx->loadConfigs();
            // get tabs from file or migx-config-table
            $formtabs = $migx->getTabs();
        }
        if (empty($formtabs) && isset($properties[\'formtabs\'])) {
            //try to get formtabs and its fields from properties
            $formtabs = $modx->fromJSON($properties[\'formtabs\']);
        }

        if (!empty($properties[\'basePath\'])) {
            if ($properties[\'autoResourceFolders\'] == \'true\') {
                $scriptProperties[\'base_path\'] = $base_path . $properties[\'basePath\'] . $docid . \'/\';
                $scriptProperties[\'base_url\'] = $base_url . $properties[\'basePath\'] . $docid . \'/\';
            } else {
                $scriptProperties[\'base_path\'] = $base_path . $properties[\'base_path\'];
                $scriptProperties[\'base_url\'] = $base_url . $properties[\'basePath\'];
            }
        }
        if ($jsonVarKey == \'migx_outputvalue\' && !empty($properties[\'jsonvarkey\'])) {
            $jsonVarKey = $properties[\'jsonvarkey\'];
            $outputvalue = isset($_REQUEST[$jsonVarKey]) ? $_REQUEST[$jsonVarKey] : $outputvalue;
        }

        if (empty($outputvalue)) {
            $outputvalue = $tv->renderOutput($docid);
            if (empty($outputvalue) && !empty($inheritFrom)) {
                foreach ($inheritFrom as $from) {
                    if ($from == \'parents\') {
                        if (!empty($inherit_children_tvname)){
                            //try to get items from optional MIGX-TV for children
                            if ($inh_tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $inherit_children_tvname))) {
                                $outputvalue = $inh_tv->processInheritBinding(\'\', $docid);    
                            }
                        }
                        $outputvalue = empty($outputvalue) ? $tv->processInheritBinding(\'\', $docid) : $outputvalue;
                    } else {
                        $outputvalue = $tv->renderOutput($from);
                    }
                    if (!empty($outputvalue)) {
                        break;
                    }
                }
            }
        }


        /*
        *   get inputTvs 
        */
        $inputTvs = array();
        if (is_array($formtabs)) {

            //multiple different Forms
            // Note: use same field-names and inputTVs in all forms
            $inputTvs = $migx->extractInputTvs($formtabs);
        }
        if ($migx->source = $tv->getSource($migx->working_context, false)) {
            $migx->source->initialize();
        }

    }


}

if (empty($outputvalue)) {
    $modx->setPlaceholder($totalVar, 0);
    return \'\';
}

//echo $outputvalue.\'<br/><br/>\';

$items = $modx->fromJSON($outputvalue);

// where filter
if (is_array($where) && count($where) > 0) {
    $items = $migx->filterItems($where, $items);
}
$modx->setPlaceholder($totalVar, count($items));

if (!empty($reverse)) {
    $items = array_reverse($items);
}

// sort items
if (is_array($sort) && count($sort) > 0) {
    $items = $migx->sortDbResult($items, $sort);
}

$summaries = array();
$output = \'\';
$items = $offset > 0 ? array_slice($items, $offset) : $items;
$count = count($items);

if ($count > 0) {
    $limit = $limit == 0 || $limit > $count ? $count : $limit;
    $preselectLimit = $preselectLimit > $count ? $count : $preselectLimit;
    //preselect important items
    $preitems = array();
    if ($randomize && $preselectLimit > 0) {
        for ($i = 0; $i < $preselectLimit; $i++) {
            $preitems[] = $items[$i];
            unset($items[$i]);
        }
        $limit = $limit - count($preitems);
    }

    //shuffle items
    if ($randomize) {
        shuffle($items);
    }

    //limit items
    $count = count($items);
    $tempitems = array();

    for ($i = 0; $i < $limit; $i++) {
        if ($i >= $count) {
            break;
        }
        $tempitems[] = $items[$i];
    }
    $items = $tempitems;

    //add preselected items and schuffle again
    if ($randomize && $preselectLimit > 0) {
        $items = array_merge($preitems, $items);
        shuffle($items);
    }

    $properties = array();
    foreach ($scriptProperties as $property => $value) {
        $properties[\'property.\' . $property] = $value;
    }

    $idx = 0;
    $output = array();
    $template = array();
    $count = count($items);

    foreach ($items as $key => $item) {
        $formname = isset($item[\'MIGX_formname\']) ? $item[\'MIGX_formname\'] . \'_\' : \'\';
        $fields = array();
        foreach ($item as $field => $value) {
            if (is_array($value)) {
                if (is_array($value[0])) {
                    //nested array - convert to json
                    $value = $modx->toJson($value);
                } else {
                    $value = implode(\'||\', $value); //handle arrays (checkboxes, multiselects)
                }
            }


            $inputTVkey = $formname . $field;

            if ($processTVs && isset($inputTvs[$inputTVkey])) {
                if (isset($inputTvs[$inputTVkey][\'inputTV\']) && $tv = $modx->getObject(\'modTemplateVar\', array(\'name\' => $inputTvs[$inputTVkey][\'inputTV\']))) {

                } else {
                    $tv = $modx->newObject(\'modTemplateVar\');
                    $tv->set(\'type\', $inputTvs[$inputTVkey][\'inputTVtype\']);
                }
                $inputTV = $inputTvs[$inputTVkey];

                $mTypes = $modx->getOption(\'manipulatable_url_tv_output_types\', null, \'image,file\');
                //don\'t manipulate any urls here
                $modx->setOption(\'manipulatable_url_tv_output_types\', \'\');
                $tv->set(\'default_text\', $value);
                $value = $tv->renderOutput($docid);
                //set option back
                $modx->setOption(\'manipulatable_url_tv_output_types\', $mTypes);
                //now manipulate urls
                if ($mediasource = $migx->getFieldSource($inputTV, $tv)) {
                    $mTypes = explode(\',\', $mTypes);
                    if (!empty($value) && in_array($tv->get(\'type\'), $mTypes)) {
                        //$value = $mediasource->prepareOutputUrl($value);
                        $value = str_replace(\'/./\', \'/\', $mediasource->prepareOutputUrl($value));
                    }
                }

            }
            $fields[$field] = $value;

        }

        if (!empty($addfields)) {
            foreach ($addfields as $addfield) {
                $addfield = explode(\':\', $addfield);
                $addname = $addfield[0];
                $adddefault = isset($addfield[1]) ? $addfield[1] : \'\';
                $fields[$addname] = $adddefault;
            }
        }

        if (!empty($sumFields)) {
            $sumFields = is_array($sumFields) ? $sumFields : explode(\',\', $sumFields);
            foreach ($sumFields as $sumField) {
                if (isset($fields[$sumField])) {
                    $summaries[$sumPrefix . $sumField] = $summaries[$sumPrefix . $sumField] + $fields[$sumField];
                    $fields[$sumPrefix . $sumField] = $summaries[$sumPrefix . $sumField];
                }
            }
        }


        if ($toJsonPlaceholder) {
            $output[] = $fields;
        } else {
            $fields[\'_alt\'] = $idx % 2;
            $idx++;
            $fields[\'_first\'] = $idx == 1 ? true : \'\';
            $fields[\'_last\'] = $idx == $limit ? true : \'\';
            $fields[\'idx\'] = $idx;
            $rowtpl = \'\';
            //get changing tpls from field
            if (substr($tpl, 0, 7) == "@FIELD:") {
                $tplField = substr($tpl, 7);
                $rowtpl = $fields[$tplField];
            }

            if ($fields[\'_first\'] && !empty($tplFirst)) {
                $rowtpl = $tplFirst;
            }
            if ($fields[\'_last\'] && empty($rowtpl) && !empty($tplLast)) {
                $rowtpl = $tplLast;
            }
            $tplidx = \'tpl_\' . $idx;
            if (empty($rowtpl) && !empty($$tplidx)) {
                $rowtpl = $$tplidx;
            }
            if ($idx > 1 && empty($rowtpl)) {
                $divisors = $migx->getDivisors($idx);
                if (!empty($divisors)) {
                    foreach ($divisors as $divisor) {
                        $tplnth = \'tpl_n\' . $divisor;
                        if (!empty($$tplnth)) {
                            $rowtpl = $$tplnth;
                            if (!empty($rowtpl)) {
                                break;
                            }
                        }
                    }
                }
            }

            if ($count == 1 && isset($tpl_oneresult)) {
                $rowtpl = $tpl_oneresult;
            }

            $fields = array_merge($fields, $properties);

            if (!empty($rowtpl)) {
                $template = $migx->getTemplate($tpl, $template);
                $fields[\'_tpl\'] = $template[$tpl];
            } else {
                $rowtpl = $tpl;

            }
            $template = $migx->getTemplate($rowtpl, $template);


            if ($template[$rowtpl]) {
                $chunk = $modx->newObject(\'modChunk\');
                $chunk->setCacheable(false);
                $chunk->setContent($template[$rowtpl]);


                if (!empty($placeholdersKeyField) && isset($fields[$placeholdersKeyField])) {
                    $output[$fields[$placeholdersKeyField]] = $chunk->process($fields);
                } else {
                    $output[] = $chunk->process($fields);
                }
            } else {
                if (!empty($placeholdersKeyField)) {
                    $output[$fields[$placeholdersKeyField]] = \'<pre>\' . print_r($fields, 1) . \'</pre>\';
                } else {
                    $output[] = \'<pre>\' . print_r($fields, 1) . \'</pre>\';
                }
            }
        }


    }
}

if (count($summaries) > 0) {
    $modx->toPlaceholders($summaries);
}


if ($toJsonPlaceholder) {
    $modx->setPlaceholder($toJsonPlaceholder, $modx->toJson($output));
    return \'\';
}

if (!empty($toSeparatePlaceholders)) {
    $modx->toPlaceholders($output, $toSeparatePlaceholders);
    return \'\';
}
/*
if (!empty($outerTpl))
$o = parseTpl($outerTpl, array(\'output\'=>implode($outputSeparator, $output)));
else 
*/

if ($count > 0 && $splits > 0) {
    $size = ceil($count / $splits);
    $chunks = array_chunk($output, $size);
    $output = array();
    foreach ($chunks as $chunk) {
        $o = implode($outputSeparator, $chunk);
        $output[] = $modx->getChunk($splitTpl, array(\'output\' => $o));
    }
    $outputSeparator = $splitSeparator;
}

if (is_array($output)) {
    $o = implode($outputSeparator, $output);
} else {
    $o = $output;
}

if (!empty($o) && !empty($wrapperTpl)) {
    $template = $migx->getTemplate($wrapperTpl);
    if ($template[$wrapperTpl]) {
        $chunk = $modx->newObject(\'modChunk\');
        $chunk->setCacheable(false);
        $chunk->setContent($template[$wrapperTpl]);
        $properties[\'output\'] = $o;
        $o = $chunk->process($properties);
    }
}

if (empty($o) && !empty($emptyTpl)) {
    $template = $migx->getTemplate($emptyTpl);
    if ($template[$emptyTpl]) {
        $chunk = $modx->newObject(\'modChunk\');
        $chunk->setCacheable(false);
        $chunk->setContent($template[$emptyTpl]);
        $o = $chunk->process($properties);
    }
}

if (!empty($toPlaceholder)) {
    $modx->setPlaceholder($toPlaceholder, $o);
    return \'\';
}

return $o;',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
        ),
      ),
      'AjaxForm' => 
      array (
        'fields' => 
        array (
          'id' => 1,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'AjaxForm',
          'description' => '',
          'editor_type' => 0,
          'category' => 2,
          'cache_type' => 0,
          'snippet' => '/** @var array $scriptProperties */
/** @var AjaxForm $AjaxForm */
if (!$modx->loadClass(\'ajaxform\', MODX_CORE_PATH . \'components/ajaxform/model/ajaxform/\', false, true)) {
    return false;
}
$AjaxForm = new AjaxForm($modx, $scriptProperties);

$snippet = $modx->getOption(\'snippet\', $scriptProperties, \'FormIt\', true);
$tpl = $modx->getOption(\'form\', $scriptProperties, \'tpl.AjaxForm.example\', true);
$formSelector = $modx->getOption(\'formSelector\', $scriptProperties, \'ajax_form\', true);
$objectName = $modx->getOption(\'objectName\', $scriptProperties, \'AjaxForm\', true);
$AjaxForm->loadJsCss($objectName);

/** @var pdoTools $pdo */
if (class_exists(\'pdoTools\') && $pdo = $modx->getService(\'pdoTools\')) {
    $content = $pdo->getChunk($tpl, $scriptProperties);
} else {
    $content = $modx->getChunk($tpl, $scriptProperties);
}
if (empty($content)) {
    return $modx->lexicon(\'af_err_chunk_nf\', array(\'name\' => $tpl));
}

// Add selector to tag form
if (preg_match(\'#<form.*?class=(?:"|\\\')(.*?)(?:"|\\\')#i\', $content, $matches)) {
    $classes = explode(\' \', $matches[1]);
    if (!in_array($formSelector, $classes)) {
        $classes[] = $formSelector;
        $classes = preg_replace(
            \'#class=(?:"|\\\')\' . $matches[1] . \'(?:"|\\\')#i\',
            \'class="\' . implode(\' \', $classes) . \'"\',
            $matches[0]
        );
        $content = str_ireplace($matches[0], $classes, $content);
    }
} else {
    $content = str_ireplace(\'<form\', \'<form class="\' . $formSelector . \'"\', $content);
}

// Add method = post
if (preg_match(\'#<form.*?method=(?:"|\\\')(.*?)(?:"|\\\')#i\', $content)) {
    $content = preg_replace(\'#<form(.*?)method=(?:"|\\\')(.*?)(?:"|\\\')#i\', \'<form\\\\1method="post"\', $content);
} else {
    $content = str_ireplace(\'<form\', \'<form method="post"\', $content);
}

// Add action for form processing
$hash = md5(http_build_query($scriptProperties));
$action = \'<input type="hidden" name="af_action" value="\' . $hash . \'" />\';
if ((stripos($content, \'</form>\') !== false)) {
    if (preg_match(\'#<input.*?name=(?:"|\\\')af_action(?:"|\\\').*?>#i\', $content, $matches)) {
        $content = str_ireplace($matches[0], \'\', $content);
    }
    $content = str_ireplace(\'</form>\', "\\n\\t$action\\n</form>", $content);
}

// Save settings to user`s session
$_SESSION[\'AjaxForm\'][$hash] = $scriptProperties;

// Call snippet for preparation of form
$action = !empty($_REQUEST[\'af_action\'])
    ? $_REQUEST[\'af_action\']
    : $hash;

$AjaxForm->process($action, $_REQUEST);

// Return chunk
return $content;',
          'locked' => false,
          'properties' => 
          array (
            'form' => 
            array (
              'name' => 'form',
              'desc' => 'ajaxform_prop_form',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'tpl.AjaxForm.example',
              'lexicon' => 'ajaxform:properties',
              'area' => '',
              'desc_trans' => 'Чанк с формой для отправки.',
              'area_trans' => '',
            ),
            'snippet' => 
            array (
              'name' => 'snippet',
              'desc' => 'ajaxform_prop_snippet',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'FormIt',
              'lexicon' => 'ajaxform:properties',
              'area' => '',
              'desc_trans' => 'Сниппет, который будет обрабатывать указанную форму.',
              'area_trans' => '',
            ),
            'frontend_css' => 
            array (
              'name' => 'frontend_css',
              'desc' => 'ajaxform_prop_frontend_css',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '[[+assetsUrl]]css/default.css',
              'lexicon' => 'ajaxform:properties',
              'area' => '',
              'desc_trans' => 'Файл с css стилями для подключения на фронтенде.',
              'area_trans' => '',
            ),
            'frontend_js' => 
            array (
              'name' => 'frontend_js',
              'desc' => 'ajaxform_prop_frontend_js',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '[[+assetsUrl]]js/default.js',
              'lexicon' => 'ajaxform:properties',
              'area' => '',
              'desc_trans' => 'Файл с javascript для подключения на фронтенде.',
              'area_trans' => '',
            ),
            'actionUrl' => 
            array (
              'name' => 'actionUrl',
              'desc' => 'ajaxform_prop_actionUrl',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => '[[+assetsUrl]]action.php',
              'lexicon' => 'ajaxform:properties',
              'area' => '',
              'desc_trans' => 'Коннектор для обработки ajax запросов.',
              'area_trans' => '',
            ),
            'formSelector' => 
            array (
              'name' => 'formSelector',
              'desc' => 'ajaxform_prop_formSelector',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'ajax_form',
              'lexicon' => 'ajaxform:properties',
              'area' => '',
              'desc_trans' => 'Имя CSS класса, который будеи использован как jQuery селектор для инициализации формы. По умолчанию "ajax_form".',
              'area_trans' => '',
            ),
            'objectName' => 
            array (
              'name' => 'objectName',
              'desc' => 'ajaxform_prop_objectName',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'AjaxForm',
              'lexicon' => 'ajaxform:properties',
              'area' => '',
              'desc_trans' => 'Имя объекта для инициализации в подключаемом javascript. По умолчанию "AjaxForm".',
              'area_trans' => '',
            ),
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => 'core/components/ajaxform/elements/snippets/snippet.ajaxform.php',
          'content' => '/** @var array $scriptProperties */
/** @var AjaxForm $AjaxForm */
if (!$modx->loadClass(\'ajaxform\', MODX_CORE_PATH . \'components/ajaxform/model/ajaxform/\', false, true)) {
    return false;
}
$AjaxForm = new AjaxForm($modx, $scriptProperties);

$snippet = $modx->getOption(\'snippet\', $scriptProperties, \'FormIt\', true);
$tpl = $modx->getOption(\'form\', $scriptProperties, \'tpl.AjaxForm.example\', true);
$formSelector = $modx->getOption(\'formSelector\', $scriptProperties, \'ajax_form\', true);
$objectName = $modx->getOption(\'objectName\', $scriptProperties, \'AjaxForm\', true);
$AjaxForm->loadJsCss($objectName);

/** @var pdoTools $pdo */
if (class_exists(\'pdoTools\') && $pdo = $modx->getService(\'pdoTools\')) {
    $content = $pdo->getChunk($tpl, $scriptProperties);
} else {
    $content = $modx->getChunk($tpl, $scriptProperties);
}
if (empty($content)) {
    return $modx->lexicon(\'af_err_chunk_nf\', array(\'name\' => $tpl));
}

// Add selector to tag form
if (preg_match(\'#<form.*?class=(?:"|\\\')(.*?)(?:"|\\\')#i\', $content, $matches)) {
    $classes = explode(\' \', $matches[1]);
    if (!in_array($formSelector, $classes)) {
        $classes[] = $formSelector;
        $classes = preg_replace(
            \'#class=(?:"|\\\')\' . $matches[1] . \'(?:"|\\\')#i\',
            \'class="\' . implode(\' \', $classes) . \'"\',
            $matches[0]
        );
        $content = str_ireplace($matches[0], $classes, $content);
    }
} else {
    $content = str_ireplace(\'<form\', \'<form class="\' . $formSelector . \'"\', $content);
}

// Add method = post
if (preg_match(\'#<form.*?method=(?:"|\\\')(.*?)(?:"|\\\')#i\', $content)) {
    $content = preg_replace(\'#<form(.*?)method=(?:"|\\\')(.*?)(?:"|\\\')#i\', \'<form\\\\1method="post"\', $content);
} else {
    $content = str_ireplace(\'<form\', \'<form method="post"\', $content);
}

// Add action for form processing
$hash = md5(http_build_query($scriptProperties));
$action = \'<input type="hidden" name="af_action" value="\' . $hash . \'" />\';
if ((stripos($content, \'</form>\') !== false)) {
    if (preg_match(\'#<input.*?name=(?:"|\\\')af_action(?:"|\\\').*?>#i\', $content, $matches)) {
        $content = str_ireplace($matches[0], \'\', $content);
    }
    $content = str_ireplace(\'</form>\', "\\n\\t$action\\n</form>", $content);
}

// Save settings to user`s session
$_SESSION[\'AjaxForm\'][$hash] = $scriptProperties;

// Call snippet for preparation of form
$action = !empty($_REQUEST[\'af_action\'])
    ? $_REQUEST[\'af_action\']
    : $hash;

$AjaxForm->process($action, $_REQUEST);

// Return chunk
return $content;',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'rating' => 
      array (
        'fields' => 
        array (
          'id' => 30,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'rating',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '$value = (int) $modx->getOption(\'value\', $scriptProperties, 0);

if ($value == 0) {
    return;
}

$output = \'\';

$index = 1;
while($index <= 5) {
    $className = ($index <= $value) ? \'active\' : \'\';
    $output .= \'<li class="\'.$className.\'"></li>\';
    $index++;
}

$output = \'<ul class="rating-stars">\' . $output . \'</ul>\';

return $output;',
          'locked' => false,
          'properties' => 
          array (
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => '',
          'content' => '$value = (int) $modx->getOption(\'value\', $scriptProperties, 0);

if ($value == 0) {
    return;
}

$output = \'\';

$index = 1;
while($index <= 5) {
    $className = ($index <= $value) ? \'active\' : \'\';
    $output .= \'<li class="\'.$className.\'"></li>\';
    $index++;
}

$output = \'<ul class="rating-stars">\' . $output . \'</ul>\';

return $output;',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'social' => 
      array (
        'fields' => 
        array (
          'id' => 32,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'social',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => '$output = \'\';
$doc = $modx->resource;
$items = array(
    array(
        \'tvId\' => 44,
        \'icon\' => \'vk\'
    ),
    array(
        \'tvId\' => 45,
        \'icon\' => \'fb\'
    ),
    array(
        \'tvId\' => 46,
        \'icon\' => \'in\',
    )
);

foreach($items as $item) {
    
    $value = \'\';
    $value = $doc->getTVValue($item[\'tvId\']);
    if (trim($value) != \'\') {
        $output .= $modx->getChunk(\'socialItem\', array(
            \'icon\' => $item[\'icon\'],
            \'url\' => $value
        ));
    }
    
}

if ($output != \'\') {
    $output = $modx->getChunk(\'socialOuter\', array(
        \'output\' => $output
    ));
}

return $output;',
          'locked' => false,
          'properties' => 
          array (
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => '',
          'content' => '$output = \'\';
$doc = $modx->resource;
$items = array(
    array(
        \'tvId\' => 44,
        \'icon\' => \'vk\'
    ),
    array(
        \'tvId\' => 45,
        \'icon\' => \'fb\'
    ),
    array(
        \'tvId\' => 46,
        \'icon\' => \'in\',
    )
);

foreach($items as $item) {
    
    $value = \'\';
    $value = $doc->getTVValue($item[\'tvId\']);
    if (trim($value) != \'\') {
        $output .= $modx->getChunk(\'socialItem\', array(
            \'icon\' => $item[\'icon\'],
            \'url\' => $value
        ));
    }
    
}

if ($output != \'\') {
    $output = $modx->getChunk(\'socialOuter\', array(
        \'output\' => $output
    ));
}

return $output;',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'year' => 
      array (
        'fields' => 
        array (
          'id' => 33,
          'source' => 1,
          'property_preprocess' => false,
          'name' => 'year',
          'description' => '',
          'editor_type' => 0,
          'category' => 0,
          'cache_type' => 0,
          'snippet' => 'return date(\'Y\');',
          'locked' => false,
          'properties' => 
          array (
          ),
          'moduleguid' => '',
          'static' => false,
          'static_file' => '',
          'content' => 'return date(\'Y\');',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
    ),
    'modTemplateVar' => 
    array (
      'header_logo' => 
      array (
        'fields' => 
        array (
          'id' => 50,
          'source' => 2,
          'property_preprocess' => false,
          'type' => 'image',
          'name' => 'header_logo',
          'caption' => 'Логотип',
          'description' => '',
          'editor_type' => 0,
          'category' => 16,
          'locked' => false,
          'elements' => '',
          'rank' => 1,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Images',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/images/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/images/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'header_text' => 
      array (
        'fields' => 
        array (
          'id' => 49,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'textarea',
          'name' => 'header_text',
          'caption' => 'Текст рядом с логотипом',
          'description' => '',
          'editor_type' => 0,
          'category' => 16,
          'locked' => false,
          'elements' => '',
          'rank' => 2,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'contact_phone' => 
      array (
        'fields' => 
        array (
          'id' => 40,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'contact_phone',
          'caption' => 'Телефон',
          'description' => '',
          'editor_type' => 0,
          'category' => 15,
          'locked' => false,
          'elements' => '',
          'rank' => 2,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'banner_bg' => 
      array (
        'fields' => 
        array (
          'id' => 5,
          'source' => 2,
          'property_preprocess' => false,
          'type' => 'image',
          'name' => 'banner_bg',
          'caption' => 'Фоновое изображение',
          'description' => '',
          'editor_type' => 0,
          'category' => 7,
          'locked' => false,
          'elements' => '',
          'rank' => 5,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Images',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/images/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/images/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'banner_title' => 
      array (
        'fields' => 
        array (
          'id' => 1,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'banner_title',
          'caption' => 'Заголовок',
          'description' => '',
          'editor_type' => 0,
          'category' => 7,
          'locked' => false,
          'elements' => '',
          'rank' => 1,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'banner_text' => 
      array (
        'fields' => 
        array (
          'id' => 2,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'banner_text',
          'caption' => 'Текст',
          'description' => '',
          'editor_type' => 0,
          'category' => 7,
          'locked' => false,
          'elements' => '',
          'rank' => 2,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'banner_btn_text' => 
      array (
        'fields' => 
        array (
          'id' => 3,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'banner_btn_text',
          'caption' => 'Текст кнопки',
          'description' => '',
          'editor_type' => 0,
          'category' => 7,
          'locked' => false,
          'elements' => '',
          'rank' => 3,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'banner_btn_enabled' => 
      array (
        'fields' => 
        array (
          'id' => 4,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'checkbox',
          'name' => 'banner_btn_enabled',
          'caption' => 'Выводить кнопку на странице?',
          'description' => '',
          'editor_type' => 0,
          'category' => 7,
          'locked' => false,
          'elements' => 'Да==1',
          'rank' => 4,
          'display' => 'default',
          'default_text' => '0',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'columns' => '1',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '0',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'owner_name' => 
      array (
        'fields' => 
        array (
          'id' => 7,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'owner_name',
          'caption' => 'Блок "О владельце". Имя',
          'description' => '',
          'editor_type' => 0,
          'category' => 7,
          'locked' => false,
          'elements' => '',
          'rank' => 7,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'owner_descr' => 
      array (
        'fields' => 
        array (
          'id' => 8,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'textarea',
          'name' => 'owner_descr',
          'caption' => ' Блок "О владельце". Текст',
          'description' => '',
          'editor_type' => 0,
          'category' => 7,
          'locked' => false,
          'elements' => '',
          'rank' => 8,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'owner_logo' => 
      array (
        'fields' => 
        array (
          'id' => 9,
          'source' => 2,
          'property_preprocess' => false,
          'type' => 'image',
          'name' => 'owner_logo',
          'caption' => 'Логотип Зенита',
          'description' => '',
          'editor_type' => 0,
          'category' => 7,
          'locked' => false,
          'elements' => '',
          'rank' => 9,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Images',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/images/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/images/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'banner_photo' => 
      array (
        'fields' => 
        array (
          'id' => 6,
          'source' => 2,
          'property_preprocess' => false,
          'type' => 'image',
          'name' => 'banner_photo',
          'caption' => 'Фото',
          'description' => 'Ширина 576px, высота 525px',
          'editor_type' => 0,
          'category' => 7,
          'locked' => false,
          'elements' => '',
          'rank' => 6,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Images',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/images/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/images/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'advantages_title' => 
      array (
        'fields' => 
        array (
          'id' => 11,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'advantages_title',
          'caption' => 'Заголовок',
          'description' => '',
          'editor_type' => 0,
          'category' => 8,
          'locked' => false,
          'elements' => '',
          'rank' => 0,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'advantages_text' => 
      array (
        'fields' => 
        array (
          'id' => 12,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'textarea',
          'name' => 'advantages_text',
          'caption' => 'Текст',
          'description' => '',
          'editor_type' => 0,
          'category' => 8,
          'locked' => false,
          'elements' => '',
          'rank' => 1,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'services_title' => 
      array (
        'fields' => 
        array (
          'id' => 15,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'services_title',
          'caption' => 'Заголовок',
          'description' => '',
          'editor_type' => 0,
          'category' => 9,
          'locked' => false,
          'elements' => '',
          'rank' => 1,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'services_descr' => 
      array (
        'fields' => 
        array (
          'id' => 16,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'textarea',
          'name' => 'services_descr',
          'caption' => 'Текст',
          'description' => '',
          'editor_type' => 0,
          'category' => 9,
          'locked' => false,
          'elements' => '',
          'rank' => 2,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'calc_title' => 
      array (
        'fields' => 
        array (
          'id' => 17,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'calc_title',
          'caption' => 'Заголовок',
          'description' => '',
          'editor_type' => 0,
          'category' => 10,
          'locked' => false,
          'elements' => '',
          'rank' => 1,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'calc_descr' => 
      array (
        'fields' => 
        array (
          'id' => 18,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'textarea',
          'name' => 'calc_descr',
          'caption' => 'Текст',
          'description' => '',
          'editor_type' => 0,
          'category' => 10,
          'locked' => false,
          'elements' => '',
          'rank' => 2,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'about_title' => 
      array (
        'fields' => 
        array (
          'id' => 21,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'about_title',
          'caption' => 'Заголовок',
          'description' => '',
          'editor_type' => 0,
          'category' => 11,
          'locked' => false,
          'elements' => '',
          'rank' => 1,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'about_photo' => 
      array (
        'fields' => 
        array (
          'id' => 24,
          'source' => 2,
          'property_preprocess' => false,
          'type' => 'image',
          'name' => 'about_photo',
          'caption' => 'Фото',
          'description' => '',
          'editor_type' => 0,
          'category' => 11,
          'locked' => false,
          'elements' => '',
          'rank' => 5,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Images',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/images/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/images/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'about_photo_title' => 
      array (
        'fields' => 
        array (
          'id' => 25,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'about_photo_title',
          'caption' => 'Подпись к фото. Заголовок',
          'description' => '',
          'editor_type' => 0,
          'category' => 11,
          'locked' => false,
          'elements' => '',
          'rank' => 6,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'about_photo_descr' => 
      array (
        'fields' => 
        array (
          'id' => 26,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'about_photo_descr',
          'caption' => 'Подпись к фото. Описание',
          'description' => '',
          'editor_type' => 0,
          'category' => 11,
          'locked' => false,
          'elements' => '',
          'rank' => 7,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'about_quotation' => 
      array (
        'fields' => 
        array (
          'id' => 22,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'richtext',
          'name' => 'about_quotation',
          'caption' => 'Цитата',
          'description' => '',
          'editor_type' => 0,
          'category' => 11,
          'locked' => false,
          'elements' => '',
          'rank' => 2,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'about_text' => 
      array (
        'fields' => 
        array (
          'id' => 23,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'richtext',
          'name' => 'about_text',
          'caption' => 'Текст',
          'description' => '',
          'editor_type' => 0,
          'category' => 11,
          'locked' => false,
          'elements' => '',
          'rank' => 3,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'work_title' => 
      array (
        'fields' => 
        array (
          'id' => 27,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'work_title',
          'caption' => 'Заголовок',
          'description' => '',
          'editor_type' => 0,
          'category' => 12,
          'locked' => false,
          'elements' => '',
          'rank' => 1,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'work_photo' => 
      array (
        'fields' => 
        array (
          'id' => 28,
          'source' => 2,
          'property_preprocess' => false,
          'type' => 'image',
          'name' => 'work_photo',
          'caption' => 'Фото',
          'description' => '',
          'editor_type' => 0,
          'category' => 12,
          'locked' => false,
          'elements' => '',
          'rank' => 2,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Images',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/images/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/images/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'consult_title' => 
      array (
        'fields' => 
        array (
          'id' => 36,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'consult_title',
          'caption' => 'Заголовок',
          'description' => '',
          'editor_type' => 0,
          'category' => 14,
          'locked' => false,
          'elements' => '',
          'rank' => 1,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'consult_descr' => 
      array (
        'fields' => 
        array (
          'id' => 37,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'textarea',
          'name' => 'consult_descr',
          'caption' => 'Текст',
          'description' => '',
          'editor_type' => 0,
          'category' => 14,
          'locked' => false,
          'elements' => '',
          'rank' => 2,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'contact_title' => 
      array (
        'fields' => 
        array (
          'id' => 39,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'contact_title',
          'caption' => 'Заголовок',
          'description' => '',
          'editor_type' => 0,
          'category' => 15,
          'locked' => false,
          'elements' => '',
          'rank' => 1,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'contact_email' => 
      array (
        'fields' => 
        array (
          'id' => 41,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'contact_email',
          'caption' => 'E-mail',
          'description' => '',
          'editor_type' => 0,
          'category' => 15,
          'locked' => false,
          'elements' => '',
          'rank' => 3,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'contact_address' => 
      array (
        'fields' => 
        array (
          'id' => 42,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'textarea',
          'name' => 'contact_address',
          'caption' => 'Адрес',
          'description' => '',
          'editor_type' => 0,
          'category' => 15,
          'locked' => false,
          'elements' => '',
          'rank' => 4,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'contact_work_hours' => 
      array (
        'fields' => 
        array (
          'id' => 43,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'contact_work_hours',
          'caption' => 'Режим работы',
          'description' => '',
          'editor_type' => 0,
          'category' => 15,
          'locked' => false,
          'elements' => '',
          'rank' => 5,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'contact_map_coords' => 
      array (
        'fields' => 
        array (
          'id' => 47,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'contact_map_coords',
          'caption' => 'Координаты на карте',
          'description' => 'Пример: 59.962528, 30.288159',
          'editor_type' => 0,
          'category' => 15,
          'locked' => false,
          'elements' => '',
          'rank' => 9,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'contact_map_balloon_text' => 
      array (
        'fields' => 
        array (
          'id' => 48,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'textarea',
          'name' => 'contact_map_balloon_text',
          'caption' => 'Карта. Описание для метки',
          'description' => '',
          'editor_type' => 0,
          'category' => 15,
          'locked' => false,
          'elements' => '',
          'rank' => 10,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'footer_copyright' => 
      array (
        'fields' => 
        array (
          'id' => 51,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'textarea',
          'name' => 'footer_copyright',
          'caption' => 'Текст',
          'description' => '',
          'editor_type' => 0,
          'category' => 20,
          'locked' => false,
          'elements' => '',
          'rank' => 1,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'footer_dev' => 
      array (
        'fields' => 
        array (
          'id' => 52,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'textarea',
          'name' => 'footer_dev',
          'caption' => 'Информация о разработчике',
          'description' => '',
          'editor_type' => 0,
          'category' => 20,
          'locked' => false,
          'elements' => '',
          'rank' => 2,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'contact_how_to_title' => 
      array (
        'fields' => 
        array (
          'id' => 53,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'contact_how_to_title',
          'caption' => 'Как добраться. Заголовок',
          'description' => '',
          'editor_type' => 0,
          'category' => 15,
          'locked' => false,
          'elements' => '',
          'rank' => 11,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'contact_how_to_text' => 
      array (
        'fields' => 
        array (
          'id' => 54,
          'source' => 2,
          'property_preprocess' => false,
          'type' => 'richtext',
          'name' => 'contact_how_to_text',
          'caption' => 'Как добраться. Текст',
          'description' => '',
          'editor_type' => 0,
          'category' => 15,
          'locked' => false,
          'elements' => '',
          'rank' => 12,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Images',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/images/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/images/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
      'calc_btn_text' => 
      array (
        'fields' => 
        array (
          'id' => 19,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'calc_btn_text',
          'caption' => 'Текст кнопки',
          'description' => '',
          'editor_type' => 0,
          'category' => 10,
          'locked' => false,
          'elements' => '',
          'rank' => 3,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'clients_title' => 
      array (
        'fields' => 
        array (
          'id' => 33,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'clients_title',
          'caption' => 'Заголовок',
          'description' => '',
          'editor_type' => 0,
          'category' => 13,
          'locked' => false,
          'elements' => '',
          'rank' => 1,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'clients_btn_text' => 
      array (
        'fields' => 
        array (
          'id' => 34,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'clients_btn_text',
          'caption' => 'Текст кнопки',
          'description' => '',
          'editor_type' => 0,
          'category' => 13,
          'locked' => false,
          'elements' => '',
          'rank' => 2,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'clients_btn_enabled' => 
      array (
        'fields' => 
        array (
          'id' => 35,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'checkbox',
          'name' => 'clients_btn_enabled',
          'caption' => 'Выводить кнопку на странице?',
          'description' => '',
          'editor_type' => 0,
          'category' => 13,
          'locked' => false,
          'elements' => 'Да==1',
          'rank' => 3,
          'display' => 'default',
          'default_text' => '0',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'columns' => '1',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '0',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'consult_btn_text' => 
      array (
        'fields' => 
        array (
          'id' => 38,
          'source' => 1,
          'property_preprocess' => false,
          'type' => 'text',
          'name' => 'consult_btn_text',
          'caption' => 'Текст кнопки',
          'description' => '',
          'editor_type' => 0,
          'category' => 14,
          'locked' => false,
          'elements' => '',
          'rank' => 3,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
            'allowBlank' => 'true',
            'minLength' => '',
            'maxLength' => '',
            'regex' => '',
            'regexText' => '',
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 1,
          'name' => 'Filesystem',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
          ),
          'is_stream' => true,
        ),
      ),
      'policy_pdf' => 
      array (
        'fields' => 
        array (
          'id' => 55,
          'source' => 2,
          'property_preprocess' => false,
          'type' => 'file',
          'name' => 'policy_pdf',
          'caption' => 'PDF-документ',
          'description' => '',
          'editor_type' => 0,
          'category' => 21,
          'locked' => false,
          'elements' => '',
          'rank' => 0,
          'display' => 'default',
          'default_text' => '',
          'properties' => 
          array (
          ),
          'input_properties' => 
          array (
          ),
          'output_properties' => 
          array (
          ),
          'static' => false,
          'static_file' => '',
          'content' => '',
        ),
        'policies' => 
        array (
        ),
        'source' => 
        array (
          'id' => 2,
          'name' => 'Images',
          'description' => '',
          'class_key' => 'sources.modFileMediaSource',
          'properties' => 
          array (
            'basePath' => 
            array (
              'name' => 'basePath',
              'desc' => 'prop_file.basePath_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/images/',
              'lexicon' => 'core:source',
            ),
            'baseUrl' => 
            array (
              'name' => 'baseUrl',
              'desc' => 'prop_file.baseUrl_desc',
              'type' => 'textfield',
              'options' => 
              array (
              ),
              'value' => 'assets/images/',
              'lexicon' => 'core:source',
            ),
          ),
          'is_stream' => true,
        ),
      ),
    ),
  ),
);